{
  "hypertensive disease": {
    "Overview": "Hypertensive heart disease is a long-term condition that develops over many years in people who have high blood pressure. It's a group of medical problems ― like heart failure and conduction arrhythmias ― that can happen when you don't control your high blood pressure (hypertension).",
    "Diagnosis": "Because there are no symptoms with high blood pressure, many people don't know they have it. Symptoms of hypertensive cardiovascular disease often show up after your heart has already been damaged.",
    "Symptoms": [
      "chest pain",
      "shortness of breath",
      "palpitations",
      "dizziness",
      "fainting",
      "stroke",
      "suddent cardiac death"
    ],
    "Causes": "High blood pressure that is not controlled for years causes hypertensive heart disease.",
    "Precaution": [
      "monitoring and preventing blood pressure from getting too high",
      "having a healthy diet",
      "monitoring stress levels",
      "getting adequate sleep",
      "exercising regularly"
    ],
    "Source": [
      "https://my.clevelandclinic.org/health/diseases/21840-hypertensive-heart-disease",
      "https://www.healthline.com/health/hypertensive-heart-disease#outlook"
    ]
  },
  "diabetes": {
    "Overview": "Diabetes is a disease that occurs when your body doesn't make or use the hormone insulin properly. It causes too much blood glucose (sugar) to build up in the blood. There are 2 main types of diabetes. Type 1 diabetes occurs when your body doesn't produce any insulin. It's sometimes called juvenile diabetes because it's usually discovered in children and teenagers, but it may appear in adults, too. Type 2 diabetes occurs when your body doesn't produce enough insulin or doesn't use the insulin as it should. In the past, doctors thought only adults were at risk of developing type 2 diabetes. However, an increasing number of children in the United States are now being diagnosed with the disease. Doctors think this increase is mostly because more children are overweight or obese and are less physically active.",
    "Diagnosis": "After examining you, discussing your symptoms, and going over your health history, your doctor may test for diabetes if he or she suspects you're at risk. To check for diabetes, your doctor may request the following tests: fasting blood sugar test, oral glucose tolerance test, random blood sugar test and A1C blood test. The AAFP recommends screening adults for type 2 diabetes as part of a heart risk assessment for people between the ages of 40 and 70 years who are overweight or obese. Doctors are encouraged to offer or refer patients with abnormal blood glucose levels to behavioral counseling to promote a healthy diet and physical activity.",
    "Symptoms": [
      "extreme hunger",
      "extreme thrist",
      "frequent urination",
      "unexplained weight loss",
      "fatigue",
      "blurry vision",
      "slow-healing of wounds",
      "dry and itchy skin",
      "dry and itchy skin",
      "tingling of hands or feet",
      "frequent yeast infections"
    ],
    "Causes": "In type 1 diabetes, your body doesn't make insulin. This is because the immune system attacks and destroys the cells in the pancreas that make the insulin. Doctors aren't sure why this happens. You have a greater risk of type 1 diabetes if one of your parents or one of your siblings has it. In type 2 diabetes, when you eat, your body changes most of the food you digest into glucose (a form of sugar). A hormone called insulin allows this glucose to enter all the cells of your body. There it is used for energy. Insulin is produced by the pancreas. In someone who has type 2 diabetes, the pancreas doesn't make enough insulin or the body's cells can't use insulin properly (called insulin resistance). This causes glucose to build up in your blood instead of moving into the cells. Too much glucose in the blood can lead to serious health problems that damage the blood vessels, nerves, heart, eyes, and kidneys.",
    "Precaution": [
      "exercise and weight control",
      "diet"
    ],
    "Source": [
      "https://familydoctor.org/condition/diabetes/"
    ]
  },
  "depression mental": {
    "Overview": "It is a common and serious medical illness that negatively affects how you feel, the way you think and how you act. Fortunately, it is also treatable. Depression causes feelings of sadness and/or a loss of interest in activities you once enjoyed. It can lead to a variety of emotional and physical problems and can decrease your ability to function at work and at home.",
    "Diagnosis": "The first step to being diagnosed is to visit a doctor for a medical evaluation. Certain medications, and some medical conditions such as thyroid disorder, can cause similar symptoms as depression. A doctor can rule out these possibilities by conducting a physical examination, interview and lab tests. If the doctor eliminates a medical condition as a cause, he or she can implement treatment or refer the patient to a mental health professional. Once diagnosed, a person with depression can be treated by various methods. The mainstays of treatment for depression are any of a number of antidepressant medications and psychotherapy, which can also be used in combination. For severe, treatment-resistant depression, studies have been done showing Deep Brain Stimulation may be an option.",
    "Symptoms": [
      "depressed mood",
      "markedly diminished interest",
      "changes in appetite",
      "changes in sleeping patterns",
      "loss of energy",
      "restlessness",
      "feelings of anxiety",
      "feeling of worthlessness",
      "inappropriate guilt",
      "difficulty thinking",
      "thoughts of death"
    ],
    "Causes": "Lots of things can increase the chance of depression, including abuse, age, certain medications, conflict, death or a loss, gender, genes, major events, other personal problems, serious illnesses and substance misuse.",
    "Precaution": [
      "find ways in handling stress",
      "enough sleep",
      "regular exercise",
      "regular medical checkups",
      "reaching out to family and friends"
    ],
    "Source": [
      "https://www.bbrfoundation.org/faq/frequently-asked-questions-about-depression?gclid=Cj0KCQjwjN-SBhCkARIsACsrBz6jTrPKefAkEO0x9uqEfLdxJUGwiw65NrQ5m-BLyV0jp5-d1tyjIA4aAlfBEALw_wcB | https://www.webmd.com/depression/understanding-depression-prevention"
    ]
  },
  "depressive disorder": {
    "Overview": "Depression is a mood disorder that causes a persistent feeling of sadness and loss of interest. Also called major depressive disorder or clinical depression, it affects how you feel, think and behave and can lead to a variety of emotional and physical problems. You may have trouble doing normal day-to-day activities, and sometimes you may feel as if life isn't worth living.",
    "Diagnosis": "Your doctor may determine a diagnosis of depression based on physical exam, lab tests, psychiatric evaluation and DSM-5.",
    "Symptoms": [
      "feelings of sadness",
      "irritability",
      "lost of interest",
      "sleep disturbances",
      "tiredness",
      "reduced appetite",
      "anxiety",
      "slowed thinking",
      "feelings of worthlessness",
      "trouble thinking",
      "frequent thoughts of death",
      "unexplained physical problems"
    ],
    "Causes": "It's not known exactly what causes depression. As with many mental disorders, a variety of factors may be involved, such as biological differences, brain chemistry, hormones, and inherited traits.",
    "Precaution": [
      "seeking help on experts",
      "psychotherapy",
      "prescribed medications",
      "outpatient treatment program"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/depression/diagnosis-treatment/drc-20356013"
    ]
  },
  "coronary arteriosclerosis": {
    "Overview": "Coronary artery disease is the buildup of plaque in the arteries that supply oxygen-rich blood to your heart. Plaque causes a narrowing or blockage that could result in a heart attack. Symptoms include chest pain or discomfort and shortness of breath",
    "Diagnosis": "First, unless your condition is an emergency (you're having a heart attack or stroke), your cardiologist (heart doctor) will ask you about your symptoms, take your medical history, review your risk factors and perform a physical exam.",
    "Symptoms": [
      "chest discomfort",
      "feeling tired",
      "dizziness",
      "nausea",
      "weakness"
    ],
    "Causes": "You may not know you have coronary artery disease since you may not have symptoms at first. The buildup of plaque in your arteries takes years to decades. But as your arteries narrow, you may notice mild symptoms that indicate your heart is pumping harder to deliver oxygen-rich blood to your body. The most common symptoms are chest pain or shortness of breath, especially after light physical activity like walking up stairs, but even at rest.",
    "Precaution": [
      "quit smoking",
      "managing health problems",
      "healthy diet",
      "alcohol intake moderation",
      "increase activity level"
    ],
    "Source": [
      "https://my.clevelandclinic.org/health/diseases/16898-coronary-artery-disease#:~:text=Coronary%20artery%20disease%20is%20caused,your%20arteries%20narrow%20and%20stiffen."
    ]
  },
  "coronary heart disease": {
    "Overview": "Coronary heart disease (CHD) is the thinning or blockage of the coronary arteries, usually caused by atherosclerosis. Atherosclerosis (sometimes called “hardening” or “clogging” of the arteries) is the buildup of cholesterol and fatty deposits (called plaques) on the inner walls of the arteries. These deposits can restrict blood flow to the heart muscle by clogging the artery. This result in reduced supply of blood to the heart, thus heart becomes starved of oxygen and the vital nutrients it requires to work properly. This can lead to chest pain called angina. If blood supply to a portion of the heart muscle is cut off entirely, or if the energy demands of the heart become much greater than its blood supply, a heart attack (injury to the heart muscle) may occur. Coronary heart disease (CHD) is the leading cause of death for both men and women living in urban areas as compared to rural India.",
    "Diagnosis": "In diagnosing a coronary heart disease tests may include electrocardiogram, stress test, coronary CT angiogram, and coronary angiography.",
    "Symptoms": [
      "feeling heavy or like someone is squeezing the heart",
      "pain usually occurs with activity",
      "shortness of breath",
      "fatigue",
      "general weakness"
    ],
    "Causes": "Risk factors associated with coronary heart disease are obesity, smoking, stress, hypertension, sedentary lifestyle, diabetes, family history and high cholesterol levels in the blood.",
    "Precaution": [
      "eating healthy",
      "low fat, high fibre diet",
      "exercising regularly",
      "maintaining a healthy weight",
      "keeping blood pressure under control"
    ],
    "Source": [
      "https://www.nhp.gov.in/disease/cardio-vascular/heart/coronary-heart-disease"
    ]
  },
  "pneumonia": {
    "Overview": "Pneumonia is inflammation (swelling) of tissue in one or both lungs. It is a condition which primarily affects the air sacs of lungs called as alveoli. It is usually caused by infection with viruses or bacteria and less commonly other microorganisms, certain drugs",
    "Diagnosis": "Early diagnosis and treatment is  very important for invasive pneumococcal disease. If disease, like meningitis or bloodstream infections, is suspected, samples of blood or cerebrospinal fluid are collected and sent to the laboratory for testing. It is important to know the cause and the severity of illness as the treatment will change depending on the cause. In the case of pneumococcal disease, antibiotics can help prevent severe illness. If pneumococcus bacteria are present with invasive disease, they can be grown (cultured). Physical examination may sometimes reveal low blood pressure, high heart rate or low oxygen saturation. The respiratory rate may be faster than normal and this may occur a day or two before other signs.",
    "Symptoms": [
      "difficulty breathing",
      "rapid heartbeat",
      "fever",
      "sweating and shivering",
      "loss of appetite",
      "pain in chest",
      "blood during cough",
      "headache",
      "fatigue",
      "nausea",
      "vomitting",
      "wheezing"
    ],
    "Causes": "Pneumonia is primarily due to infections caused by bacteria or viruses and less commonly by fungi and parasites.",
    "Precaution": [
      "painkillers",
      "antibiotic fluids"
    ],
    "Source": [
      "https://www.nhp.gov.in/disease/respiratory/lungs/pneumonia"
    ]
  },
  "failure heart congestive": {
    "Overview": "Heart failure — sometimes known as congestive heart failure — occurs when the heart muscle doesn't pump blood as well as it should. When this happens, blood often backs up and fluid can build up in the lungs, causing shortness of breath. Certain heart conditions, such as narrowed arteries in the heart (coronary artery disease) or high blood pressure, gradually leave the heart too weak or stiff to fill and pump blood properly.",
    "Diagnosis": "To diagnose heart failure, your doctor will take a careful medical history, review your symptoms and perform a physical examination. Your doctor will also check to see if you have risk factors for heart failure, such as high blood pressure, coronary artery disease or diabetes. Your doctor can listen to your lungs for signs of fluid buildup (lung congestion) and your heart for whooshing sounds (murmurs) that may suggest heart failure. The doctor may examine the veins in your neck and check for fluid buildup in your abdomen and legs.",
    "Symptoms": [
      "shortness of breath",
      "fatigue",
      "swelling on legs",
      "irregular heartbeat",
      "reduced ability to exercise",
      "persistent cough or wheezing",
      "swelling of the belly area",
      "rapid weight gain",
      "nausea",
      "difficulty concentrating",
      "chest pain"
    ],
    "Causes": "Heart failure often develops after other conditions have damaged or weakened the heart. However, heart failure can also occur if the heart becomes too stiff. In heart failure, the main pumping chambers of the heart (the ventricles) may become stiff and not fill properly between beats. In some people, the heart muscle may become damaged and weakened. The ventricles may stretch to the point that the heart can't pump enough blood through the body. Over time, the heart can no longer keep up with the typical demands placed on it to pump blood to the rest of the body.",
    "Precaution": [
      "stop smoking",
      "weight monitoring",
      "maintaining a healthy weight",
      "limiting salt intake",
      "limiting alcohol intake",
      "regular exercise",
      "enough sleep"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/heart-failure/diagnosis-treatment/drc-20373148"
    ]
  },
  "accident cerebrovascular": {
    "Overview": "Cerebrovascular accident (CVA) is the medical term for a stroke. A stroke is when blood flow to a part of your brain is stopped either by a blockage or the rupture of a blood vessel. There are important signs of a stroke that you should be aware of and watch out for. Seek medical attention immediately if you think that you or someone around you might be having a stroke. The more quickly you receive treatment, the better the prognosis, as a stroke left untreated for too long can result in permanent brain damage.",
    "Diagnosis": "Healthcare providers have a number of tools to determine whether you've had a stroke. Your healthcare provider will administer a full physical examination, during which they'll check your strength, reflexes, vision, speech, and senses. They'll also check for a particular sound in the blood vessels of your neck. This sound, which is called a bruit, indicates abnormal blood flow. Finally, they will check your blood pressure, which may be high if you've had a stroke.",
    "Symptoms": [
      "difficulty walking",
      "dizziness",
      "loss of balance",
      "difficulty speaking",
      "numbness in the face",
      "blurred vision",
      "sudden headache"
    ],
    "Causes": "There are two main types of cerebrovascular accident, or stroke: an ischemic stroke is caused by a blockage; a hemorrhagic stroke is caused by the rupture of a blood vessel. Both types of stroke deprive part of the brain of blood and oxygen, causing brain cells to die.",
    "Precaution": [
      "maintaining normal blood pressure",
      "limit saturated fat and cholesterol intake",
      "quit smoking",
      "alcohol intake moderation",
      "control diabetes",
      "maintaining a healthy weight",
      "regular exercise",
      "eating a diet rich in vegetables and fruits"
    ],
    "Source": [
      "https://www.healthline.com/health/cerebrovascular-accident"
    ]
  },
  "asthma": {
    "Overview": "Asthma is a chronic disease characterized by recurrent attacks of breathlessness and wheezing. During an asthma attack, the lining of the bronchial tubes (airways) swells, causing the airways to narrow, turn more sensitive to irritants in the environment, and thus reducing the flow of air into and out of the lungs. The causes of asthma are not completely understood.",
    "Diagnosis": "In diagnosing asthma, doctors may check the patient's medical history including information  about allergies, asthma, or other medical conditions. Also results from physical examinations are checked for signs of problems related to cough. Your doctor will use a stethoscope to listen to your lungs. He or she will listen for wheezing (a whistling or squeaky sound when you breathe) or other abnormal sounds.",
    "Symptoms": [
      "recurrent episodes of wheezing",
      "shortness of breath",
      "chest tightness"
    ],
    "Causes": "The exact cause of asthma is yet not known. But there are certain risk factors that are associated with asthma. It is probably caused by interplay of hereditary and environmental factors. Some of the factors include heredity, irritants such as cigarette smoke, sulfites in foods and drinks, colds, physical activity and contact with airborne allergens.",
    "Precaution": [
      "medications such as nebulizers",
      "quick-relief inhaler",
      "preventer inhaler"
    ],
    "Source": [
      "https://www.nhp.gov.in/disease/respiratory/lungs/asthma"
    ]
  },
  "myocardial infarction": {
    "Overview": "A heart attack (medically known as a myocardial infarction) is a deadly medical emergency where your heart muscle begins to die because it isn't getting enough blood flow. This is usually caused by a blockage in the arteries that supply blood to your heart. If blood flow isn't restored quickly, a heart attack can cause permanent heart damage and death.",
    "Diagnosis": "Heart attacks are usually diagnosed in an emergency room setting. A healthcare provider will diagnose a heart attack using history and symptoms, lab testing, heart-specific diagnostic tests and imaging tests.",
    "Symptoms": [
      "chest pain",
      "shortness of breath",
      "nausea",
      "heart palpitations",
      "anxiety",
      "sweating",
      "feeling lightheaded"
    ],
    "Causes": "The vast majority of heart attacks occur because of a blockage in one of the blood vessels that supply your heart. This most often happens because of plaque, a sticky substance that can build up on the insides of your arteries (similar to how pouring grease down your kitchen sink can clog your home plumbing). That buildup is called atherosclerosis. Sometimes, plaque deposits inside the coronary (heart) arteries can break open or rupture, and a blood clot can get stuck where the rupture happened. If the clot blocks the artery, this can deprive the heart muscle of blood and cause a heart attack.",
    "Precaution": [
      "quit smoking",
      "regular exercise",
      "healthy diet",
      "maintaining healthy weight",
      "managing existing health conditions",
      "taking medications",
      "keeping all medical appointments"
    ],
    "Source": [
      "https://my.clevelandclinic.org/health/diseases/16818-heart-attack-myocardial-infarction#:~:text=Heart%20Attack%20(Myocardial%20Infarction),supply%20blood%20to%20your%20heart."
    ]
  },
  "hypercholesterolemia": {
    "Overview": "Familial hypercholesterolemia affects the way the body processes cholesterol. As a result, people with familial hypercholesterolemia have a higher risk of heart disease and a greater risk of early heart attack. The genetic changes that cause familial hypercholesterolemia are inherited. The condition is present from birth, but symptoms may not appear until adulthood.",
    "Diagnosis": "A detailed family history is an important key to diagnosing familial hypercholesterolemia. Doctors will be interested to know if your siblings, parents, aunts, uncles or grandparents ever had high cholesterol levels or heart disease — especially during childhood. During the physical exam, doctors usually check for cholesterol deposits that may occur in the skin around the hands, knees, elbows and eyes. Tendons in the heel and hand may be thickened, and a gray or white ring may develop around the iris of the eye.",
    "Symptoms": [
      "bad cholesterol on skin",
      "cholesterol thickens achilles tendon",
      "high cholesterol causing corneal arcus"
    ],
    "Causes": "Familial hypercholesterolemia is caused by a gene alteration that's passed down from one or both parents. People who have this condition are born with it. This change prevents the body from ridding itself of the type of cholesterol that can build up in the arteries and cause heart disease.",
    "Precaution": [
      "regular exercise",
      "heart-healthy diet",
      "stop smoking"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/familial-hypercholesterolemia/symptoms-causes/syc-20353755"
    ]
  },
  "infection": {
    "Overview": "Infectious diseases are disorders caused by organisms — such as bacteria, viruses, fungi or parasites. Many organisms live in and on our bodies. They're normally harmless or even helpful. But under certain conditions, some organisms may cause disease. Some infectious diseases can be passed from person to person. Some are transmitted by insects or other animals. And you may get others by consuming contaminated food or water or being exposed to organisms in the environment.",
    "Diagnosis": "Your doctor may order lab work or imaging scans to help determine what's causing your symptoms. Many infectious diseases have similar signs and symptoms. Samples of body fluids can sometimes reveal evidence of the particular microbe that's causing the illness. This helps the doctor tailor treatment.",
    "Symptoms": [
      "fever",
      "diarrhea",
      "fatigue",
      "muscle aches",
      "coughing"
    ],
    "Causes": "Infectious diseases can be caused by bacteria, viruses, fungi or parasites.",
    "Precaution": [
      "drinking a lot of fluids",
      "rest regularly",
      "taking allternative medicines"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/infectious-diseases/symptoms-causes/syc-20351173"
    ]
  },
  "infection urinary tract": {
    "Overview": "A urinary tract infection (UTI) is an infection in any part of your urinary system — your kidneys, ureters, bladder and urethra. Most infections involve the lower urinary tract — the bladder and the urethra. Women are at greater risk of developing a UTI than are men. Infection limited to your bladder can be painful and annoying. However, serious consequences can occur if a UTI spreads to your kidneys.",
    "Diagnosis": "Tests and procedures used to diagnose urinary tract infections include analyzing urine samples, growing urinary tract bacteria in a lab, creating images of the urinary tract, and using a scope to see inside the bladder.",
    "Symptoms": [
      "persistent urge to urinate",
      "burning sensation when urinating",
      "passing frequent small amounts of urine",
      "urine appearing cloudy",
      "urine appearing red",
      "strong smelling urine",
      "pelvic pain"
    ],
    "Causes": "Urinary tract infections typically occur when bacteria enter the urinary tract through the urethra and begin to multiply in the bladder. Although the urinary system is designed to keep out such microscopic invaders, these defenses sometimes fail. When that happens, bacteria may take hold and grow into a full-blown infection in the urinary tract. The most common UTIs occur mainly in women and affect the bladder and urethra.",
    "Precaution": [
      "drinking plenty of water",
      "avoiding drinks that irritates the bladder",
      "using a heat pad"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/urinary-tract-infection/diagnosis-treatment/drc-20353453"
    ]
  },
  "anemia": {
    "Overview": "Anemia is a condition in which you lack enough healthy red blood cells to carry adequate oxygen to your body's tissues. Having anemia, also referred to as low hemoglobin, can make you feel tired and weak. There are many forms of anemia, each with its own cause. Anemia can be temporary or long term and can range from mild to severe. In most cases, anemia has more than one cause. See your doctor if you suspect that you have anemia. It can be a warning sign of serious illness.",
    "Diagnosis": "To diagnose anemia, your doctor is likely to ask you about your medical and family history, perform a physical exam, and run a complete blood count and testing ",
    "Symptoms": [
      "fatigue",
      "weakness",
      "yellowish skin",
      "irregular heartbeats",
      "shortness of breath",
      "dizziness",
      "chest pain",
      "cold hands and feet",
      "headaches"
    ],
    "Causes": "Anemia can be due to a condition present at birth (congenital) or to a condition you develop (acquired). Anemia occurs when your blood doesn't have enough red blood cells.",
    "Precaution": [
      "making a list of symptoms for appointment",
      "listing all medications taken",
      "schedule an appointment as soon as possible"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/anemia/symptoms-causes/syc-20351360#:~:text=Anemia%20is%20a%20condition%20in,each%20with%20its%20own%20cause."
    ]
  },
  "chronic obstructive airway disease": {
    "Overview": "Chronic obstructive pulmonary disease (COPD) is a chronic inflammatory lung disease that causes obstructed airflow from the lungs. Symptoms include breathing difficulty, cough, mucus (sputum) production and wheezing. It's typically caused by long-term exposure to irritating gases or particulate matter, most often from cigarette smoke. People with COPD are at increased risk of developing heart disease, lung cancer and a variety of other conditions.",
    "Diagnosis": "COPD is commonly misdiagnosed. Many people who have COPD may not be diagnosed until the disease is advanced. To diagnose your condition, your doctor will review your signs and symptoms, discuss your family and medical history, and discuss any exposure you've had to lung irritants — especially cigarette smoke. Your doctor may order several tests to diagnose your condition.",
    "Symptoms": [
      "shortness of breath",
      "wheezing",
      "chest tightness",
      "chronic cough",
      "frequent respiratory infections",
      "lack of energy",
      "unintended weight loss",
      "swelling in ankles, feet or legs"
    ],
    "Causes": "The main cause of COPD in developed countries is tobacco smoking. In the developing world, COPD often occurs in people exposed to fumes from burning fuel for cooking and heating in poorly ventilated homes. Only some chronic smokers develop clinically apparent COPD, although many smokers with long smoking histories may develop reduced lung function. Some smokers develop less common lung conditions. They may be misdiagnosed as having COPD until a more thorough evaluation is performed.",
    "Precaution": [
      "quit smoking",
      "inhaled steroids",
      "combination inhalers",
      "oral steroids",
      "lung therapies"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/copd/symptoms-causes/syc-20353679#:~:text=Chronic%20obstructive%20pulmonary%20disease%20(COPD,(sputum)%20production%20and%20wheezing."
    ]
  },
  "dementia": {
    "Overview": "Dementia is a term used to describe a group of symptoms affecting memory, thinking and social abilities severely enough to interfere with your daily life. It isn't a specific disease, but several diseases can cause dementia. Though dementia generally involves memory loss, memory loss has different causes. Having memory loss alone doesn't mean you have dementia, although it's often one of the early signs of the condition.",
    "Diagnosis": "Diagnosing dementia and its type can be challenging. To diagnose the cause of the dementia, the doctor must recognize the pattern of the loss of skills and function and determine what a person is still able to do. More recently, biomarkers have become available to make a more accurate diagnosis of Alzheimer's disease. Your doctor will review your medical history and symptoms and conduct a physical examination. He or she will likely ask someone close to you about your symptoms as well. No single test can diagnose dementia, so doctors are likely to run a number of tests that can help pinpoint the problem.",
    "Symptoms": [
      "memory loss",
      "difficulty communicating",
      "difficulty with visual and spatial abilities",
      "difficulty reasoning",
      "difficulty with planning",
      "difficulty with coordination",
      "confusion",
      "personality changes",
      "depression",
      "anxiety",
      "inappropriate behavior",
      "paranoid",
      "agitation",
      "hallucinations"
    ],
    "Causes": "Dementia is caused by damage to or loss of nerve cells and their connections in the brain. Depending on the area of the brain that's damaged, dementia can affect people differently and cause different symptoms. Dementias are often grouped by what they have in common, such as the protein or proteins deposited in the brain or the part of the brain that's affected. Some diseases look like dementias, such as those caused by a reaction to medications or vitamin deficiencies, and they might improve with treatment.",
    "Precaution": [
      "enhance communication",
      "encourage exercise",
      "engage in activity",
      "establish a nighttime ritual",
      "keep a calendar",
      "plan for a future"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/dementia/symptoms-causes/syc-20352013#:~:text=Dementia%20is%20a%20term%20used,memory%20loss%20has%20different%20causes."
    ]
  },
  "insufficiency renal": {
    "Overview": "Kidney failure (also called renal failure) means one or both kidneys can no longer function well on their own. Sometimes, kidney failure is temporary and comes on quickly. Other times, it is a chronic condition that can get worse slowly over a long time. Kidney failure may sound serious, and it is. But treatments such as dialysis and kidney transplant help many people with limited kidney function continue to live fulfilling lives.",
    "Diagnosis": "Doctors use a variety of tests to measure kidney function and diagnose kidney failure. If your doctors suspect you may be at risk for kidney failure, they may recommend blood tests, advanced imaging and urine tests.",
    "Symptoms": [
      "fatigue",
      "vomitting",
      "confusion",
      "swelling of hands or ankles",
      "frequent bathroom trips",
      "muscle spams",
      "dry or itchy skin",
      "poor appetite"
    ],
    "Causes": "The most common causes of kidney failure are diabetes and high blood pressure. Sometimes, though, kidney failure happens quickly due to an unforeseen cause. When the kidneys lose function suddenly (within hours or days), it's called acute kidney failure (or acute kidney injury). This type of kidney failure is often temporary. Common causes of acute kidney failure can include autoimmune kidney diseases, severe dehydration, urinary tract obstruction or uncontrolled systemic disease like heart or liver disease.",
    "Precaution": [
      "monitoring kidney function",
      "keeping blood sugar under control",
      "keeping blood pressure in normal range",
      "avoid smoking",
      "make healthy diet choices"
    ],
    "Source": [
      "https://my.clevelandclinic.org/health/diseases/17689-kidney-failure#:~:text=The%20most%20common%20causes%20of,(or%20acute%20kidney%20injury)."
    ]
  },
  "confusion": {
    "Overview": "Confusion is a term that refers to a decline in cognitive ability, that is, our ability to think, learn and understand. A decline in cognitive ability is often associated with dementia. Symptoms of confusion include problems with short-term memory, difficulty carrying out tasks, poor attention span, unclear speech and difficulty in following a conversation. Sometimes confusion can be temporary and will pass. Sometimes confusion is long term and is due to a permanent condition.",
    "Diagnosis": "Confusion can be the sign of a serious medical condition. Call triple zero (000) and ask for advice if you (or someone you care for) experience sudden onset of confusion, new symptoms, other signs of illnesses or skin/lips turning blue.",
    "Symptoms": [
      "unable to think clearly",
      "uncertain on what is happening around them",
      "unsure what day or what time it is",
      "frustration",
      "aggression",
      "unusual behavior",
      "anxiety"
    ],
    "Causes": "Confusion, or being confused, is often associated with growing older. However, this is not always the case. Sudden confusion, also known as delirium, can be caused by a number of other factors such as drinking too much alcohol, side effects from medicines, using illegal drugs, overdose, lack of oxygen to the brain, head injury, poisoning or lack of sleep.",
    "Precaution": [
      "alcohol intake moderation",
      "avoiding illegal drugs",
      "having a balanced diet",
      "keeping blood sugar levels at a normal range",
      "getting enough sleep",
      "taking prescribed medicines"
    ],
    "Source": [
      "https://www.healthdirect.gov.au/confusion#:~:text=Symptoms%20of%20confusion%20include%20problems,be%20temporary%20and%20will%20pass."
    ]
  },
  "degenerative polyarthritis": {
    "Overview": "Osteoarthritis is the most common form of arthritis, affecting millions of people worldwide. It occurs when the protective cartilage that cushions the ends of the bones wears down over time. Although osteoarthritis can damage any joint, the disorder most commonly affects joints in your hands, knees, hips and spine. Osteoarthritis symptoms can usually be managed, although the damage to joints can't be reversed. Staying active, maintaining a healthy weight and receiving certain treatments might slow progression of the disease and help improve pain and joint function.",
    "Diagnosis": "During the physical exam, your doctor will check your affected joint for tenderness, swelling, redness and flexibility.",
    "Symptoms": [
      "pain",
      "stiffness",
      "tenderness",
      "loss of flexibility",
      "grating sensation",
      "bone spurs",
      "swelling"
    ],
    "Causes": "Osteoarthritis occurs when the cartilage that cushions the ends of bones in your joints gradually deteriorates. Cartilage is a firm, slippery tissue that enables nearly frictionless joint motion. Eventually, if the cartilage wears down completely, bone will rub on bone. Osteoarthritis has often been referred to as a wear and tear disease. But besides the breakdown of cartilage, osteoarthritis affects the entire joint. It causes changes in the bone and deterioration of the connective tissues that hold the joint together and attach muscle to bone. It also causes inflammation of the joint lining.",
    "Precaution": [
      "exercise",
      "losing weight",
      "movement therapies",
      "heat and cold",
      "capsaicin",
      "braces or shoe inserts",
      "assistive devices"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/osteoarthritis/symptoms-causes/syc-20351925"
    ]
  },
  "hypothyroidism": {
    "Overview": "Hypothyroidism (underactive thyroid) is a condition in which your thyroid gland doesn't produce enough of certain crucial hormones. Hypothyroidism may not cause noticeable symptoms in the early stages. Over time, untreated hypothyroidism can cause a number of health problems, such as obesity, joint pain, infertility and heart disease.",
    "Diagnosis": "In general, your doctor may test for an underactive thyroid if you are feeling increasingly tired, have dry skin, constipation and weight gain, or have had previous thyroid problems or a goiter.",
    "Symptoms": [
      "fatigue",
      "increased sensitivity to cold",
      "consitpation",
      "dry skin",
      "weight gain",
      "puffy face",
      "hoarseness",
      "muscle weakness",
      "elevated blood cholesterol level",
      "muscle aches",
      "pain",
      "irregular menstrual periods",
      "thinning hair",
      "slowed heart rate",
      "depression",
      "impaired memory",
      "enlarged thyroid gland"
    ],
    "Causes": "When your thyroid doesn't produce enough hormones, the balance of chemical reactions in your body can be upset. There can be a number of causes, including autoimmune disease, hyperthyroidism treatments, radiation therapy, thyroid surgery and certain medications. Your thyroid is a small, butterfly-shaped gland situated at the base of the front of your neck, just below your Adam's apple. Hormones produced by the thyroid gland — triiodothyronine (T3) and thyroxine (T4) — have an enormous impact on your health, affecting all aspects of your metabolism. These hormones also influence the control of vital functions, such as body temperature and heart rate. Hypothyroidism results when the thyroid gland fails to produce enough hormones. ",
    "Precaution": [
      "oral medication",
      "proper absoprtion of levothyroxine"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/hypothyroidism/symptoms-causes/syc-20350284"
    ]
  },
  "anxiety state": {
    "Overview": "Experiencing occasional anxiety is a normal part of life. However, people with anxiety disorders frequently have intense, excessive and persistent worry and fear about everyday situations. Often, anxiety disorders involve repeated episodes of sudden feelings of intense anxiety and fear or terror that reach a peak within minutes (panic attacks). These feelings of anxiety and panic interfere with daily activities, are difficult to control, are out of proportion to the actual danger and can last a long time. You may avoid places or situations to prevent these feelings. Symptoms may start during childhood or the teen years and continue into adulthood. Examples of anxiety disorders include generalized anxiety disorder, social anxiety disorder (social phobia), specific phobias and separation anxiety disorder. You can have more than one anxiety disorder. Sometimes anxiety results from a medical condition that needs treatment. Whatever form of anxiety you have, treatment can help.",
    "Diagnosis": "You may start by seeing your primary care provider to find out if your anxiety could be related to your physical health. He or she can check for signs of an underlying medical condition that may need treatment. However, you may need to see a mental health specialist if you have severe anxiety. A psychiatrist is a medical doctor who specializes in diagnosing and treating mental health conditions. A psychologist and certain other mental health professionals can diagnose anxiety and provide counseling (psychotherapy).",
    "Symptoms": [
      "nervousness",
      "panic",
      "increased heart rate",
      "sweating",
      "trembling",
      "feeling weak",
      "trouble concentrating",
      "trouble sleeping",
      "experiencing gastrointestinal problems",
      "having difficulty controlling worry",
      "urge to avoid things that trigger anxiety"
    ],
    "Causes": "The causes of anxiety disorders aren't fully understood. Life experiences such as traumatic events appear to trigger anxiety disorders in people who are already prone to anxiety. Inherited traits also can be a factor.",
    "Precaution": [
      "get physically active",
      "avoiding alcohol and recreational drugs",
      "quit smoking",
      "use stress management and relaxation techniques",
      "get enough sleep",
      "eat healthy"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/anxiety/symptoms-causes/syc-20350961"
    ]
  },
  "malignant neoplasms": {
    "Overview": "Malignant neoplasms are cancerous tumors. They develop when cells grow and divide more than they should. Malignant neoplasms can spread to nearby tissues and to distant parts of your body. Treatment options may include surgery, chemotherapy or radiation therapy. ",
    "Diagnosis": "Your healthcare provider may suspect cancer after performing a routine test, such as a mammogram or colonoscopy. In most cases, a biopsy is needed to determine if the tumor is benign (noncancerous) or malignant (cancerous). Your healthcare provider may also take imaging tests, such as MRI, CT scans or PET scans.",
    "Symptoms": [
      "fatigue",
      "shortness of breath",
      "anemia",
      "diarrhea",
      "weight loss",
      "drenching night sweats",
      "abnormal lumps"
    ],
    "Causes": "We know that malignant neoplasms form when cells grow and divide faster than they should. But experts don't know why this happens in the first place. But there are certain risk factors associated with malignant neoplasms, these includes smoking, genetics, obesity, excessive alcohol use, chemical toxins, excessive exposure to radiation and UV rays.",
    "Precaution": [
      "quit smoking",
      "protecting your skin when you go outside",
      "alcohol intake moderation",
      "maintaining a healthy lifestyle",
      "attend all routine cancer screenings"
    ],
    "Source": [
      "https://my.clevelandclinic.org/health/diseases/22319-malignant-neoplasm#:~:text=Malignant%20neoplasms%20are%20cancerous%20tumors,surgery%2C%20chemotherapy%20or%20radiation%20therapy."
    ]
  },
  "primary malignant neoplasm": {
    "Overview": "Malignant neoplasms are cancerous tumors. They develop when cells grow and divide more than they should. Malignant neoplasms can spread to nearby tissues and to distant parts of your body. Treatment options may include surgery, chemotherapy or radiation therapy. Early detection is key, so be sure to attend all recommended cancer screenings.",
    "Diagnosis": "Your healthcare provider may suspect cancer after performing a routine test, such as a mammogram or colonoscopy. In most cases, a biopsy is needed to determine if the tumor is benign (noncancerous) or malignant (cancerous). Your healthcare provider may also take imaging tests, such as MRI, CT scans or PET scans.",
    "Symptoms": [
      "fatigue",
      "shortness of breath",
      "anemia",
      "diarrhea",
      "weight loss",
      "drenching night sweats",
      "abnormal lumps"
    ],
    "Causes": "We know that malignant neoplasms form when cells grow and divide faster than they should. But experts don't know why this happens in the first place. But there are certain risk factors associated with malignant neoplasms, these includes smoking, genetics, obesity, excessive alcohol use, chemical toxins, excessive exposure to radiation and UV rays.",
    "Precaution": [
      "quit smoking",
      "protecting your skin when you go outside",
      "alcohol intake moderation",
      "maintaining a healthy lifestyle",
      "attend all routine cancer screenings"
    ],
    "Source": [
      "https://my.clevelandclinic.org/health/diseases/22319-malignant-neoplasm#:~:text=A%20malignant%20neoplasm%20(NEE%2Doh,beyond%20its%20point%20of%20origin."
    ]
  },
  "acquired immuno-deficiency syndrome": {
    "Overview": "Acquired immunodeficiency syndrome (AIDS) is a chronic, potentially life-threatening condition caused by the human immunodeficiency virus (HIV). By damaging your immune system, HIV interferes with your body's ability to fight infection and disease.",
    "Diagnosis": "HIV can be diagnosed through blood or saliva testing. Available tests includes antigen tests, antibody tests, and nucleic acid tests.",
    "Symptoms": [
      "sweats",
      "chills",
      "recurring fever",
      "chronic diarrhea",
      "swollen lymph glands",
      "persistent white spots or unusual lesions on your tongue or in your mouth",
      "persistent, unexplained fatigue",
      "weakness",
      "weight loss",
      "skin rashes or bumps"
    ],
    "Causes": "You can have an HIV infection, with few or no symptoms, for years before it turns into AIDS. AIDS is diagnosed when the CD4 T cell count falls below 200 or you have an AIDS-defining complication, such as a serious infection or cancer.",
    "Precaution": [
      "eat healthy foods",
      "avoid raw meat eggs and more",
      "get the right vaccinations",
      "take care with companion animals"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/hiv-aids/symptoms-causes/syc-20373524"
    ]
  },
  "HIV": {
    "Overview": "HIV is a sexually transmitted infection (STI). It can also be spread by contact with infected blood and from illicit injection drug use or sharing needles. It can also be spread from mother to child during pregnancy, childbirth or breastfeeding. Without medication, it may take years before HIV weakens your immune system to the point that you have AIDS. There's no cure for HIV/AIDS, but medications can control the infection and prevent progression of the disease. Antiviral treatments for HIV have reduced AIDS deaths around the world, and international organizations are working to increase the availability of prevention measures and treatment in resource-poor countries.",
    "Diagnosis": "HIV can be diagnosed through blood or saliva testing. Available tests includes antigen tests, antibody tests, and nucleic acid tests.",
    "Symptoms": [
      "fever",
      "headache",
      "muscle pain",
      "rash",
      "sore throat",
      "swollen lymph glands",
      "diarrhea",
      "cough",
      "night sweats"
    ],
    "Causes": "HIV is caused by a virus. It can spread through sexual contact, illicit injection drug use or sharing needles, contact with infected blood, or from mother to child during pregnancy, childbirth or breastfeeding. HIV destroys CD4 T cells — white blood cells that play a large role in helping your body fight disease. The fewer CD4 T cells you have, the weaker your immune system becomes.",
    "Precaution": [
      "eat healthy foods",
      "avoid raw meat eggs and more",
      "get the right vaccinations",
      "take care with companion animals"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/hiv-aids/symptoms-causes/syc-20373524"
    ]
  },
  "hiv infections": {
    "Overview": "HIV is a sexually transmitted infection (STI). It can also be spread by contact with infected blood and from illicit injection drug use or sharing needles. It can also be spread from mother to child during pregnancy, childbirth or breastfeeding. Without medication, it may take years before HIV weakens your immune system to the point that you have AIDS. There's no cure for HIV/AIDS, but medications can control the infection and prevent progression of the disease. Antiviral treatments for HIV have reduced AIDS deaths around the world, and international organizations are working to increase the availability of prevention measures and treatment in resource-poor countries.",
    "Diagnosis": "HIV can be diagnosed through blood or saliva testing. Available tests includes antigen tests, antibody tests, and nucleic acid tests.",
    "Symptoms": [
      "fever",
      "headache",
      "muscle pain",
      "rash",
      "sore throat",
      "swollen lymph glands",
      "diarrhea",
      "cough",
      "night sweats"
    ],
    "Causes": "HIV is caused by a virus. It can spread through sexual contact, illicit injection drug use or sharing needles, contact with infected blood, or from mother to child during pregnancy, childbirth or breastfeeding. HIV destroys CD4 T cells — white blood cells that play a large role in helping your body fight disease. The fewer CD4 T cells you have, the weaker your immune system becomes.",
    "Precaution": [
      "eat healthy foods",
      "avoid raw meat eggs and more",
      "get the right vaccinations",
      "take care with companion animals"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/hiv-aids/symptoms-causes/syc-20373524"
    ]
  },
  "cellulitis": {
    "Overview": "Cellulitis (sel-u-LIE-tis) is a common, potentially serious bacterial skin infection. The affected skin appears swollen and red and is typically painful and warm to the touch. Cellulitis usually affects the skin on the lower legs, but it can occur in the face, arms and other areas. It occurs when a crack or break in your skin allows bacteria to enter. Left untreated, the infection can spread to your lymph nodes and bloodstream and rapidly become life-threatening. It isn't usually spread from person to person.",
    "Diagnosis": "Your doctor will likely be able to diagnose cellulitis by looking at your skin. In some cases, he or she may suggest blood tests or other tests to help rule out other conditions.",
    "Symptoms": [
      "red area of skin tends to expand",
      "swelling",
      "tenderness",
      "pain",
      "warmth",
      "fever",
      "red spots",
      "blisters",
      "skin dimpling"
    ],
    "Causes": "Cellulitis occurs when bacteria, most commonly streptococcus and staphylococcus, enter through a crack or break in your skin. The incidence of a more serious staphylococcus infection called methicillin-resistant Staphylococcus aureus (MRSA) is increasing. Although cellulitis can occur anywhere on your body, the most common location is the lower leg. Bacteria are most likely to enter disrupted areas of skin, such as where you've had recent surgery, cuts, puncture wounds, an ulcer, athlete's foot or dermatitis. Animal bites can cause cellulitis. Bacteria can also enter through areas of dry, flaky skin or swollen skin.",
    "Precaution": [
      "placing a cool, damp cloth on the affected area",
      "consult your doctor to suggest an over-the-counter pain medication to treat pain",
      "elevate the affected part of the body",
      "ask your doctor if you are going to wear compression wraps"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/cellulitis/symptoms-causes/syc-20370762"
    ]
  },
  "gastroesophageal reflux disease": {
    "Overview": "Gastroesophageal reflux disease (GERD) occurs when stomach acid frequently flows back into the tube connecting your mouth and stomach (esophagus). This backwash (acid reflux) can irritate the lining of your esophagus. Many people experience acid reflux from time to time. GERD is mild acid reflux that occurs at least twice a week, or moderate to severe acid reflux that occurs at least once a week.",
    "Diagnosis": "Your doctor might be able to diagnose GERD based on a physical examination and history of your signs and symptoms. To confirm a diagnosis of GERD, or to check for complications, your doctor might recommend upper endoscopy, ambulatory acid probe test, esophageal manometry or x-ray of the upper digestive system.",
    "Symptoms": [
      "burning sensation of the chest",
      "chest pain",
      "difficulty swallowing",
      "regurgutation of food",
      "sensation of a lump in your throat"
    ],
    "Causes": "GERD is caused by frequent acid reflux. When you swallow, a circular band of muscle around the bottom of your esophagus (lower esophageal sphincter) relaxes to allow food and liquid to flow into your stomach. Then the sphincter closes again. If the sphincter relaxes abnormally or weakens, stomach acid can flow back up into your esophagus. This constant backwash of acid irritates the lining of your esophagus, often causing it to become inflamed.",
    "Precaution": [
      "maintain a healthy weight",
      "stop smoking",
      "elevate the head part of your bed",
      "don't lie down after a meal",
      "eat food slowly and chew thoroughly",
      "avoid foods and drinks that trigger reflux",
      "avoid tight-fitting clothing"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/gerd/symptoms-causes/syc-20361940"
    ]
  },
  "septicemia": {
    "Overview": "Septicemia, sometimes called blood poisoning, is an infection that occurs when germs get into the bloodstream and spread. The germs are usually bacteria but also can be viruses or fungi.",
    "Diagnosis": "Septicemia diagnosis is based on the presence of septicemia symptoms and blood tests to identify a bacterium, virus or fungus. Depending on your symptoms, you might need other tests to check for damage to tissues and organs.",
    "Symptoms": [
      "high fever",
      "chills",
      "weakness",
      "sweating",
      "drop in blood pressure"
    ],
    "Causes": "Bacteria, viruses and fungi can enter the bloodstream in many ways, including abscessed tooth, germs on medical equipment, kidney infection, pneumonia, skin ulcers, or urinary tract infection.",
    "Precaution": [
      "getting all recommended vaccines",
      "keeping wounds clean",
      "washing hands regularly",
      "taking good care of any medical conditions"
    ],
    "Source": [
      "https://my.clevelandclinic.org/health/diseases/21539-septicemia"
    ]
  },
  "systemic infection": {
    "Overview": "Sepsis is a serious medical condition caused by the body's response to an infection. Bacterial infections are the most common cause of sepsis. Sepsis can be life-threatening.",
    "Diagnosis": "A person may have sepsis if he or she has high or low white blood cell count, low platelet count, acidosis, blood culture that is positive for infection, or abnormal kidney or liver function.",
    "Symptoms": [
      "fast heart rate",
      "fever",
      "chills",
      "warm skin",
      "confusion",
      "hyperventilation"
    ],
    "Causes": "Bacterial infections are the most common cause of sepsis. Sepsis can also be caused by fungal, parasitic, or viral infections. The source of the infection can be any of a number of places throughout the body. ",
    "Precaution": [
      "apply good hand-washing practices",
      "keep up to date on recommended vaccines",
      "get routine medical care for chronic conditions",
      "get medical condition immediately if you suspect an infection"
    ],
    "Source": [
      "https://my.clevelandclinic.org/health/diseases/12361-sepsis"
    ]
  },
  "sepsis (invertebrate)": {
    "Overview": "Sepsis is a serious medical condition caused by the body's response to an infection. Bacterial infections are the most common cause of sepsis. Sepsis can be life-threatening.",
    "Diagnosis": "A person may have sepsis if he or she has high or low white blood cell count, low platelet count, acidosis, blood culture that is positive for infection, or abnormal kidney or liver function.",
    "Symptoms": [
      "fast heart rate",
      "fever",
      "chills",
      "warm skin",
      "confusion",
      "hyperventilation"
    ],
    "Causes": "Bacterial infections are the most common cause of sepsis. Sepsis can also be caused by fungal, parasitic, or viral infections. The source of the infection can be any of a number of places throughout the body. ",
    "Precaution": [
      "apply good hand-washing practices",
      "keep up to date on recommended vaccines",
      "get routine medical care for chronic conditions",
      "get medical condition immediately if you suspect an infection"
    ],
    "Source": [
      "https://my.clevelandclinic.org/health/diseases/12361-sepsis"
    ]
  },
  "deep vein thrombosis": {
    "Overview": "Deep vein thrombosis (DVT) occurs when a blood clot (thrombus) forms in one or more of the deep veins in your body, usually in your legs. Deep vein thrombosis can cause leg pain or swelling but also can occur with no symptoms. You can get DVT if you have certain medical conditions that affect how your blood clots. A blood clot in your legs can also happen if you don't move for a long time, such as after you have surgery or an accident, when you're traveling a long distance, or when you're on bed rest. Deep vein thrombosis can be very serious because blood clots in your veins can break loose, travel through your bloodstream and get stuck in your lungs, blocking blood flow (pulmonary embolism). However, pulmonary embolism can occur with no evidence of DVT.",
    "Diagnosis": "To diagnose DVT, your doctor will ask you about your symptoms. You'll also have a physical exam so that your doctor can check for areas of swelling, tenderness or changes in skin color.",
    "Symptoms": [
      "swelling in the affected leg",
      "leg pain",
      "discolored skin on the leg",
      "feeling of warmth in the affected leg"
    ],
    "Causes": "Anything that prevents your blood from flowing or clotting normally can cause a blood clot. The main causes of DVT are damage to a vein from surgery or trauma and inflammation due to infection or injury.",
    "Precaution": [
      "ask your doctor about your diet",
      "take medications as directed",
      "watch for excessive bleeding",
      "move",
      "wear compression stockings"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/deep-vein-thrombosis/symptoms-causes/syc-20352557#:~:text=Deep%20vein%20thrombosis%20(DVT)%20occurs,affect%20how%20your%20blood%20clots."
    ]
  },
  "dehydration": {
    "Overview": "Dehydration occurs when you use or lose more fluid than you take in, and your body doesn't have enough water and other fluids to carry out its normal functions. If you don't replace lost fluids, you will get dehydrated.",
    "Diagnosis": "Your doctor can often diagnose dehydration on the basis of physical signs and symptoms. If you're dehydrated, you're also likely to have low blood pressure, especially when moving from a lying to a standing position, a faster than normal heart rate and reduced blood flow to your extremities.",
    "Symptoms": [
      "extreme thirst",
      "less frequent urination",
      "dark-colored urine",
      "fatigue",
      "dizziness",
      "confusion"
    ],
    "Causes": "Sometimes dehydration occurs for simple reasons: You don't drink enough because you're sick or busy, or because you lack access to safe drinking water when you're traveling, hiking or camping.",
    "Precaution": [
      "drinking a lot of fluids"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/dehydration/symptoms-causes/syc-20354086"
    ]
  },
  "neoplasm": {
    "Overview": "A neoplasm is an abnormal growth of cells, also known as a tumor. Neoplastic diseases are conditions that cause tumor growth. Growth can be either benign (noncancerous) or malignant (cancerous). Benign tumors usually grow slowly and can't spread to other tissues. Conversely, malignant tumors can grow at a slow pace, but they can also grow very fast depending on the exact tumor type. Malignant tumors carry the risk of metastasis or spreading to multiple tissues and organs.",
    "Diagnosis": "Diagnosis includes both confirming the neoplastic disease and determining whether the neoplasms are benign or malignant. Doctors will conduct a thorough examination that will include a review of your medical history, blood tests, and possibly a biopsy of visible masses.",
    "Symptoms": [
      "anemia",
      "shortness of breath",
      "abdominal pain",
      "persistent fatigue",
      "loss of appetite",
      "chills",
      "diarrhea",
      "fever",
      "bloody stools",
      "lesions",
      "skin masses"
    ],
    "Causes": "The exact causes of tumor growth are still being researched. In general, cancerous tumor growth is triggered by DNA mutations within your cells. Your DNA contains genes that tell cells how to operate, grow, and divide. Your cells can't function normally when the DNA changes. This change is what causes cells to become cancerous.",
    "Precaution": [
      "monitoring benign growths"
    ],
    "Source": [
      "https://www.healthline.com/health/neoplastic-disease"
    ]
  },
  "embolism pulmonary": {
    "Overview": "Pulmonary embolism is a blockage in one of the pulmonary arteries in your lungs. In most cases, pulmonary embolism is caused by blood clots that travel to the lungs from deep veins in the legs or, rarely, from veins in other parts of the body (deep vein thrombosis). Because the clots block blood flow to the lungs, pulmonary embolism can be life-threatening. However, prompt treatment greatly reduces the risk of death. Taking measures to prevent blood clots in your legs will help protect you against pulmonary embolism.",
    "Diagnosis": "Pulmonary embolism can be difficult to diagnose, especially in people who have underlying heart or lung disease. For that reason, your doctor will likely discuss your medical history, do a physical exam, and order one or more of the following tests.",
    "Symptoms": [
      "shortness of breath",
      "chest pain",
      "cough",
      "rapid heartbeat",
      "lightheadedness",
      "excessive sweating",
      "fever",
      "leg pain",
      "clammy skin"
    ],
    "Causes": "Pulmonary embolism occurs when a clump of material, most often a blood clot, gets wedged into an artery in your lungs. These blood clots most commonly come from the deep veins of your legs, a condition known as deep vein thrombosis (DVT). In many cases, multiple clots are involved in pulmonary embolism. The portions of lung served by each blocked artery are robbed of blood and may die. This is known as pulmonary infarction. This makes it more difficult for your lungs to provide oxygen to the rest of your body.",
    "Precaution": [
      "monitoring of blood clot",
      "treatment as soon as possible"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/pulmonary-embolism/symptoms-causes/syc-20354647#:~:text=Pulmonary%20embolism%20(PE)%20occurs%20when,heart%20and%20into%20the%20lungs."
    ]
  },
  "epilepsy": {
    "Overview": "Epilepsy is a central nervous system (neurological) disorder in which brain activity becomes abnormal, causing seizures or periods of unusual behavior, sensations and sometimes loss of awareness. Anyone can develop epilepsy. Epilepsy affects both males and females of all races, ethnic backgrounds and ages.",
    "Diagnosis": "To diagnose your condition, your doctor will review your symptoms and medical history. Your doctor may order several tests to diagnose epilepsy and determine the cause of seizures.",
    "Symptoms": [
      "temporary confusion",
      "staring spell",
      "stiff muscles",
      "uncontrollable jerking movements of the arms and legs",
      "loss of consciousness",
      "fear",
      "anxiety"
    ],
    "Causes": "Epilepsy has no identifiable cause in about half the people with the condition. In the other half, the condition may be traced to various factors, including genetic influence, head trauma, brain abnormalities, infections, prenatal injury or developmental disorders.",
    "Precaution": [
      "anti-seizure medication",
      "therapies"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/epilepsy/symptoms-causes/syc-20350093"
    ]
  },
  "cardiomyopathy": {
    "Overview": "Cardiomyopathy (kahr-dee-o-my-OP-uh-thee) is a disease of the heart muscle that makes it harder for the heart to pump blood to the rest of the body. Cardiomyopathy can lead to heart failure. The main types of cardiomyopathy include dilated, hypertrophic and restrictive cardiomyopathy. Treatment — which might include medications, surgically implanted devices, heart surgery or, in severe cases, a heart transplant — depends on the type of cardiomyopathy and how serious it is.",
    "Diagnosis": "Your health care provider is likely to perform a physical examination and ask questions about your personal and family medical history. You'll also be asked when your symptoms occur — for example, whether exercise triggers your symptoms.",
    "Symptoms": [
      "breathlessness",
      "swelling of the legs, ankles and feet",
      "bloating of the abdomen",
      "cough while lying down",
      "difficulty lying flat to sleep",
      "fatigue",
      "rapid heartbeats",
      "chest discomfort",
      "dizziness"
    ],
    "Causes": "Often the cause of the cardiomyopathy is unknown. In some people, however, it's the result of another condition (acquired) or passed on from a parent (inherited).",
    "Precaution": [
      "manage signs and symptoms",
      "prevent the condition from worsening",
      "reduce the risk of complications"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/cardiomyopathy/symptoms-causes/syc-20370709#:~:text=Cardiomyopathy%20(kahr%2Ddee%2Do,dilated%2C%20hypertrophic%20and%20restrictive%20cardiomyopathy."
    ]
  },
  "chronic kidney failure": {
    "Overview": "Chronic kidney disease, also called chronic kidney failure, involves a gradual loss of kidney function. Your kidneys filter wastes and excess fluids from your blood, which are then removed in your urine. Advanced chronic kidney disease can cause dangerous levels of fluid, electrolytes and wastes to build up in your body.",
    "Diagnosis": "As a first step toward diagnosis of kidney disease, your doctor discusses your personal and family history with you. Among other things, your doctor might ask questions about whether you've been diagnosed with high blood pressure, if you've taken a medication that might affect kidney function, if you've noticed changes in your urinary habits and whether you have family members who have kidney disease. Next, your doctor performs a physical exam, checking for signs of problems with your heart or blood vessels, and conducts a neurological exam.",
    "Symptoms": [
      "nausea",
      "vomitting",
      "loss of appetite",
      "fatigue",
      "sleep problems",
      "urinating more or less",
      "decrease mental sharpness",
      "muscle cramps",
      "swelling of feet and ankles",
      "dry, itchy skin",
      "high blood pressure",
      "shortness of breath",
      "chest pain"
    ],
    "Causes": "Chronic kidney disease occurs when a disease or condition impairs kidney function, causing kidney damage to worsen over several months or years.",
    "Precaution": [
      "help to control signs and symptoms",
      "treatment from various operations"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/chronic-kidney-disease/symptoms-causes/syc-20354521"
    ]
  },
  "carcinoma": {
    "Overview": "Cancer refers to any one of a large number of diseases characterized by the development of abnormal cells that divide uncontrollably and have the ability to infiltrate and destroy normal body tissue. Cancer often has the ability to spread throughout your body. Cancer is the second-leading cause of death in the world. But survival rates are improving for many types of cancer, thanks to improvements in cancer screening, treatment and prevention.",
    "Diagnosis": "Diagnosing cancer at its earliest stages often provides the best chance for a cure. With this in mind, talk with your doctor about what types of cancer screening may be appropriate for you. For a few cancers, studies show that screening tests can save lives by diagnosing cancer early. For other cancers, screening tests are recommended only for people with increased risk. A variety of medical organizations and patient-advocacy groups have recommendations and guidelines for cancer screening. Review the various guidelines with your doctor and together you can determine what's best for you based on your own risk factors for cancer.",
    "Symptoms": [
      "fatigue",
      "lump or area of thickening that can be felt under the skin",
      "weigh changes",
      "skin changes",
      "changes in bowel or bladder habits",
      "persistent cough",
      "difficulty swallowing",
      "hoarseness",
      "persistent indigestion",
      "persistent muscle or joint pain",
      "persistent unexplained fevers",
      "unexplained bleeding or bruising"
    ],
    "Causes": "Cancer is caused by changes (mutations) to the DNA within cells. The DNA inside a cell is packaged into a large number of individual genes, each of which contains a set of instructions telling the cell what functions to perform, as well as how to grow and divide. Errors in the instructions can cause the cell to stop its normal function and may allow a cell to become cancerous.",
    "Precaution": [
      "surgery",
      "chemotherapy",
      "radiation therapy",
      "bone marrow transplant",
      "immunotherapy",
      "hormone therapy",
      "targeted drug therapy",
      "clinical trials"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/cancer/diagnosis-treatment/drc-20370594"
    ]
  },
  "hepatitis C": {
    "Overview": "Hepatitis C is a viral infection that causes liver inflammation, sometimes leading to serious liver damage. The hepatitis C virus (HCV) spreads through contaminated blood. Until recently, hepatitis C treatment required weekly injections and oral medications that many HCV-infected people couldn't take because of other health problems or unacceptable side effects.",
    "Diagnosis": "The U.S. Preventive Services Task Force recommends that all adults ages 18 to 79 years be screened for hepatitis C, even those without symptoms or known liver disease.",
    "Symptoms": [
      "bleeding easily",
      "bruising easily",
      "fatigue",
      "poor appetite",
      "yellow discoloration of skin and eyes",
      "dark-colored urine",
      "itchy skin",
      "fluid buildup in the abdomen",
      "swelling of the legs",
      "weight loss",
      "confusion",
      "spiderlike blood vessels on the skin"
    ],
    "Causes": "Hepatitis C infection is caused by the hepatitis C virus (HCV). The infection spreads when blood contaminated with the virus enters the bloodstream of an uninfected person. Globally, HCV exists in several distinct forms, known as genotypes. Seven distinct HCV genotypes and more than 67 subtypes have been identified. The most common HCV genotype in the United States is type 1. Although chronic hepatitis C follows a similar course regardless of the genotype of the infecting virus, treatment recommendations vary depending on viral genotype.",
    "Precaution": [
      "antiviral medications",
      "liver transplantation",
      "vaccinations"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/hepatitis-c/symptoms-causes/syc-20354278"
    ]
  },
  "peripheral vascular disease": {
    "Overview": "Peripheral vascular disease (PVD) is a blood circulation disorder that causes the blood vessels outside of your heart and brain to narrow, block, or spasm. This can happen in your arteries or veins. PVD typically causes pain and fatigue, often in your legs, and especially during exercise.",
    "Diagnosis": "Early diagnosis is the first step to successful treatment and it can prevent life-threatening complications. Tell your doctor if you have any of the classic symptoms of PVD, such as claudication. Your doctor will also ask about your medical history and perform a physical exam. The physical exam can include measuring the pulses in your legs and feet. If your doctor hears a whooshing sound through their stethoscope, it could mean a narrowed blood vessel.",
    "Symptoms": [
      "reduced hair growth",
      "legs turn reddish blue or pale",
      "thin or pale skin on the legs and feet",
      "blueish color on the toes",
      "muscles feeling numb"
    ],
    "Causes": "Your vessels naturally widen and narrow in response to your environment. But in functional PVD, your vessels exaggerate their response. Raynaud's disease, when stress and temperatures affect your blood flow, is an example of functional PVD.",
    "Precaution": [
      "avoid smoking",
      "controlling your blood sugar",
      "exercising regularly",
      "working to lower cholesterol and blood pressure",
      "eating a healthy diet",
      "keeping your weight at a healthy level"
    ],
    "Source": [
      "https://www.healthline.com/health/peripheral-vascular-disease#:~:text=Peripheral%20vascular%20disease%20(PVD)%20is,legs%2C%20and%20especially%20during%20exercise."
    ]
  },
  "psychotic disorder": {
    "Overview": "Psychotic disorders are a group of serious illnesses that affect the mind. They make it hard for someone to think clearly, make good judgments, respond emotionally, communicate effectively, understand reality, and behave appropriately. When symptoms are severe, people with psychotic disorders have trouble staying in touch with reality and often are unable to handle daily life. But even severe psychotic disorders usually can be treated.",
    "Diagnosis": "To diagnose a psychotic disorder, doctors will take a medical and psychiatric history and possibly perform a brief physical exam. The person may get blood tests and sometimes brain imaging (such as MRI scans) to rule out physical illness or drug use like cocaine or LSD. If the doctor finds no physical reason for the symptoms, they may refer the person to a psychiatrist or psychologist. These mental health professionals will use specially designed interview and assessment tools to decide whether the person has a psychotic disorder.",
    "Symptoms": [
      "hallucinations",
      "delusions",
      "disorganized speech",
      "confused thinking",
      "dangerous behavior",
      "slowed movements",
      "loss of interest in personal hygiene",
      "loss of interest in activities",
      "problems at school or work",
      "cold and detached manner",
      "mood swings"
    ],
    "Causes": "Doctors don't know the exact cause of psychotic disorders. Researchers believe that many things play a role. Some psychotic disorders tend to run in families, which means that the disorder may be partly inherited. Other things may also influence their development, including stress, drug abuse, and major life changes. People with certain psychotic disorders, such as schizophrenia, may also have problems in parts of the brain that control thinking, perception, and motivation.",
    "Precaution": [
      "treatment as soon as possible"
    ],
    "Source": [
      "https://www.webmd.com/schizophrenia/guide/mental-health-psychotic-disorders"
    ]
  },
  "hyperlipidemia": {
    "Overview": "You call it high cholesterol. Your doctor calls it hyperlipidemia. Either way, it's a common problem. The term covers several disorders that result in extra fats, also known as lipids, in your blood. You can control some of its causes; but not all of them. Hyperlipidemia is treatable, but it's often a life-long condition. You'll need to watch what you eat and also exercise regularly. You might need to take a prescription medication, too. The goal is to lower the harmful cholesterol levels. Doing so can reduce your risk of heart disease, heart attack, stroke, and other problems.",
    "Diagnosis": "Your doctor should check your lipid levels regularly. It is a blood test called a lipoprotein panel. The results show the levels of LDL cholesterol, HDL cholesterol and triglycerides.",
    "Symptoms": [
      "cholesterol buildup",
      "high blood pressure"
    ],
    "Causes": "Cholesterol, a waxy substance, is a type of fat your body makes. It can also come from what you eat. Foods that have cholesterol, saturated fat, and trans fats can raise your blood cholesterol level. ",
    "Precaution": [
      "choosing foods low in trans fats and saturated fats",
      "eating more fiber-rich foods",
      "eating fish twice a week",
      "avoiding sugary drinks",
      "avoiding fried and processed meats",
      "alcohol intake moderation",
      "regular exercise"
    ],
    "Source": [
      "https://www.webmd.com/cholesterol-management/hyperlipidemia-overview"
    ]
  },
  "bipolar disorder": {
    "Overview": "Bipolar disorder, formerly called manic depression, is a mental health condition that causes extreme mood swings that include emotional highs (mania or hypomania) and lows (depression). When you become depressed, you may feel sad or hopeless and lose interest or pleasure in most activities. When your mood shifts to mania or hypomania (less extreme than mania), you may feel euphoric, full of energy or unusually irritable. These mood swings can affect sleep, energy, activity, judgment, behavior and the ability to think clearly. Episodes of mood swings may occur rarely or multiple times a year. While most people will experience some emotional symptoms between episodes, some may not experience any. Although bipolar disorder is a lifelong condition, you can manage your mood swings and other symptoms by following a treatment plan. In most cases, bipolar disorder is treated with medications and psychological counseling (psychotherapy).",
    "Diagnosis": "To determine if you have bipolar disorder, your evaluation may include physical exams, psychiatric assessment, mood charting and criteria for bipolar disorder.",
    "Symptoms": [
      "abnormally jumpy",
      "increased activity",
      "exaggerated sense of well-being",
      "decreased need for sleep",
      "unusual talkativeness",
      "racing thoughts",
      "distractability",
      "poor decision-making",
      "depressed mood",
      "loss of interest",
      "weight loss",
      "insomnia",
      "restlessness",
      "fatigue",
      "feelings of worthlessness",
      "decreased ability to think",
      "attempting suicide"
    ],
    "Causes": "The exact cause of bipolar disorder is unknown, but several factors may be involved, such as biological differences and genetics.",
    "Precaution": [
      "medications",
      "day treatment programs",
      "psychotherapy",
      "continued treatment",
      "substance abuse treatment",
      "hospitalization"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/bipolar-disorder/symptoms-causes/syc-20355955"
    ]
  },
  "obesity": {
    "Overview": "Obesity is a complex disease involving an excessive amount of body fat. Obesity isn't just a cosmetic concern. It's a medical problem that increases the risk of other diseases and health problems, such as heart disease, diabetes, high blood pressure and certain cancers. There are many reasons why some people have difficulty losing weight. Usually, obesity results from inherited, physiological and environmental factors, combined with diet, physical activity and exercise choices.",
    "Diagnosis": "To diagnose obesity, your doctor will typically perform a physical exam and recommend some tests. These exams and tests generally include taking your health history, a general physical exam, caluculating your BMI, measuring your waist circumference and checking for other health problems.",
    "Symptoms": [
      "body mass index (BMI) is above 30"
    ],
    "Causes": "Although there are genetic, behavioral, metabolic and hormonal influences on body weight, obesity occurs when you take in more calories than you burn through normal daily activities and exercise. Your body stores these excess calories as fat. In the United States, most people's diets are too high in calories — often from fast food and high-calorie beverages. People with obesity might eat more calories before feeling full, feel hungry sooner, or eat more due to stress or anxiety. Many people who live in Western countries now have jobs that are much less physically demanding, so they don't tend to burn as many calories at work. Even daily activities use fewer calories, courtesy of conveniences such as remote controls, escalators, online shopping and drive-through banks.",
    "Precaution": [
      "dietary changes",
      "exercise regularly",
      "counseling",
      "weight-loss medication"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/obesity/symptoms-causes/syc-20375742"
    ]
  },
  "ischemia": {
    "Overview": "Myocardial ischemia occurs when blood flow to your heart is reduced, preventing the heart muscle from receiving enough oxygen. The reduced blood flow is usually the result of a partial or complete blockage of your heart's arteries (coronary arteries). Myocardial ischemia, also called cardiac ischemia, reduces the heart muscle's ability to pump blood. A sudden, severe blockage of one of the heart's artery can lead to a heart attack. Myocardial ischemia might also cause serious abnormal heart rhythms.",
    "Diagnosis": "Your doctor will start by asking questions about your medical history and with a physical exam. After that, your doctor might recommend electrocardiogram, stress test, echocardiogram, stress echocardiogram, nuclear stress test, coronary angiography, cardiac CT scan.",
    "Symptoms": [
      "neck or jaw pain",
      "shoulder or arm pain",
      "fast heartbeat",
      "shortness of breath",
      "nausea",
      "sweating",
      "fatigue"
    ],
    "Causes": "Myocardial ischemia occurs when the blood flow through one or more of your coronary arteries is decreased. The low blood flow decreases the amount of oxygen your heart muscle receives. Myocardial ischemia can develop slowly as arteries become blocked over time. Or it can occur quickly when an artery becomes blocked suddenly.",
    "Precaution": [
      "quit smoking",
      "manage underlying health conditions",
      "eat a healthy diet",
      "exercise",
      "maintain a healthy weight",
      "decrease stress"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/myocardial-ischemia/symptoms-causes/syc-20375417"
    ]
  },
  "cirrhosis": {
    "Overview": "Cirrhosis is a late stage of scarring (fibrosis) of the liver caused by many forms of liver diseases and conditions, such as hepatitis and chronic alcoholism. Each time your liver is injured — whether by disease, excessive alcohol consumption or another cause — it tries to repair itself. In the process, scar tissue forms. As cirrhosis progresses, more and more scar tissue forms, making it difficult for the liver to function (decompensated cirrhosis). Advanced cirrhosis is life-threatening.",
    "Diagnosis": "People with early-stage cirrhosis of the liver usually don't have symptoms. Often, cirrhosis is first detected through a routine blood test or checkup. To help confirm a diagnosis, a combination of laboratory and imaging tests is usually done.",
    "Symptoms": [
      "fatigue",
      "easily bleeding",
      "loss of appetite",
      "nausea",
      "swelling on legs, feet or ankles",
      "weight loss",
      "itchy skin",
      "yellow discoloration of skin and eyes",
      "fluid accumulation in the abdomen",
      "spiderlike blood vessels on the skin",
      "redness in the palms",
      "confusion"
    ],
    "Causes": "A wide range of diseases and conditions can damage the liver and lead to cirrhosis. Some of the causes include chronic alocohol abuse, chronic vital hepatitis, fat accumulating in the liver, iron buildup in the body, cystic fibrosis, and etc.",
    "Precaution": [
      "treatment for alcohol dependency",
      "weight loss",
      "medications to control hepatitis",
      "medications to control other causes and symptoms of cirrhosis"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/cirrhosis/symptoms-causes/syc-20351487#:~:text=Cirrhosis%20is%20a%20late%20stage,it%20tries%20to%20repair%20itself."
    ]
  },
  "exanthema": {
    "Overview": "A viral exanthem rash is spots, bumps or blotches on your skin that accompany a viral infection. It may or may not be itchy. The rash can start anywhere on the body, often on your face or trunk, and then spread. It may be associated with other virus symptoms. ",
    "Diagnosis": "A healthcare provider can usually diagnose a viral exanthem rash based on your symptoms. Occasionally, they may order a blood test or a swab of your nose or throat to identify the virus.",
    "Symptoms": [
      "abdominal pain",
      "body aches",
      "fever",
      "fatigue",
      "headache",
      "loss of appetite",
      "runny nose",
      "sore throat"
    ],
    "Causes": "A virus can cause a viral exanthem rash in one of three ways. The rash is your body's immune response to the virus. Damages the skin by the organism and reaction to a toxin the virus produces.",
    "Precaution": [
      "avoid touching the eyes, nose and mouth",
      "clean surfaces that you touch frequently",
      "get vaccinated",
      "keep distance from sick people",
      "wash hands frequently"
    ],
    "Source": [
      "https://my.clevelandclinic.org/health/diseases/22510-viral-exanthem-rash#prevention"
    ]
  },
  "benign prostatic hypertrophy": {
    "Overview": "Benign prostatic hyperplasia (BPH) — also called prostate gland enlargement — is a common condition as men get older. An enlarged prostate gland can cause uncomfortable urinary symptoms, such as blocking the flow of urine out of the bladder. It can also cause bladder, urinary tract or kidney problems. There are several effective treatments for prostate gland enlargement, including medications, minimally invasive therapies and surgery. To choose the best option, you and your doctor will consider your symptoms, the size of your prostate, other health conditions you might have and your preferences.",
    "Diagnosis": "Your doctor will start by asking detailed questions about your symptoms and doing a physical exam. This initial exam is likely to include a digital rectal exam, a urine test, blood test, and prostate-specific antigen blood test.",
    "Symptoms": [
      "frequent need to urinate",
      "increased frequency of urination at night",
      "difficulty starting urination",
      "weak urine stream",
      "dribbling at the end of urination",
      "inability to completely empty the bladder"
    ],
    "Causes": "Conditions that can lead to symptoms similar to those caused by enlarged prostate includes UTI, inflammation of prostate, narrowing of the urethra, scarring in the bladder neck, kidney stones, problems with nerves that controls the bladder and cancer of the bladder.",
    "Precaution": [
      "medications",
      "surgical therapy",
      "laser therapy",
      "transurethral resection of the prostate",
      "transurethral incision of the prostate",
      "transurethral microwave thermotherapy",
      "transurethral needle ablation"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/benign-prostatic-hyperplasia/diagnosis-treatment/drc-20370093"
    ]
  },
  "kidney failure acute": {
    "Overview": "Acute kidney failure occurs when your kidneys suddenly become unable to filter waste products from your blood. When your kidneys lose their filtering ability, dangerous levels of wastes may accumulate, and your blood's chemical makeup may get out of balance. Acute kidney failure — also called acute renal failure or acute kidney injury — develops rapidly, usually in less than a few days. Acute kidney failure is most common in people who are already hospitalized, particularly in critically ill people who need intensive care.",
    "Diagnosis": "If your signs and symptoms suggest that you have acute kidney failure, your doctor may recommend certain tests and procedures to verify your diagnosis",
    "Symptoms": [
      "decreased urine output",
      "fluid retention",
      "shortness of breath",
      "fatigue",
      "confusion",
      "nausea",
      "weakness",
      "irregular heartbeat",
      "chest pain",
      "seizures"
    ],
    "Causes": "Acute kidney failure can occur when you have a condition that slows blood flow to your kidneys, experiencing direct damage to the kidneys and the kidneys' urine drainage tubes become blocked.",
    "Precaution": [
      "choose lower potassium foods",
      "avoid products with added salt",
      "limit phosphorus"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/kidney-failure/symptoms-causes/syc-20369048#:~:text=Acute%20kidney%20failure%20occurs%20when,may%20get%20out%20of%20balance."
    ]
  },
  "mitral valve insufficiency": {
    "Overview": "Mitral valve regurgitation is a type of heart valve disease in which the valve between the left heart chambers doesn't close completely, allowing blood to leak backward across the valve. It is the most common type of heart valve disease (valvular heart disease). If the leakage is severe, not enough blood will move through the heart or to the rest of the body. As a result, mitral valve regurgitation can make you feel very tired (fatigued) or short of breath.",
    "Diagnosis": "To diagnose mitral valve regurgitation, a health care provider will usually do a physical exam and ask questions about your symptoms and medical history, including whether you have mitral valve prolapse. The provider will typically listen to your heart with a stethoscope. A heart murmur, also called a holosystolic murmur, may be heard. The mitral valve heart murmur is the sound of blood leaking backward through the valve. Tests may be done to confirm a diagnosis of mitral valve regurgitation or to check for other conditions that can cause similar signs and symptoms.",
    "Symptoms": [
      "heart murmur",
      "irregular heartbeat",
      "shortness of breath",
      "palpitations",
      "swollen feet or ankles"
    ],
    "Causes": "To understand the causes of mitral valve disease, it may be helpful to know how the heart works. The mitral valve is one of four valves in the heart that keep blood flowing in the right direction. Each valve has flaps (leaflets) that open and close once during each heartbeat. If a valve doesn't open or close properly, blood flow through the heart to the body can be reduced. In mitral valve regurgitation, the valve flaps don't close tightly. Blood leaks backward when the valve is closed, making it harder for the heart to work properly. If mitral valve regurgitation is due to problems with the mitral valve, the condition is called primary mitral valve regurgitation.If a problem or disease affecting other areas of the heart cause a leaky mitral valve, the condition is called functional or secondary mitral regurgitation.",
    "Precaution": [
      "healthy lifestyle changes",
      "regular monitoring by a health care provider",
      "medications to treat symptoms",
      "surgery to repair"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/mitral-valve-regurgitation/diagnosis-treatment/drc-20350183"
    ]
  },
  "arthritis": {
    "Overview": "Arthritis is the swelling and tenderness of one or more joints. The main symptoms of arthritis are joint pain and stiffness, which typically worsen with age. The most common types of arthritis are osteoarthritis and rheumatoid arthritis.",
    "Diagnosis": "During the physical exam, doctors check your joints for swelling, redness and warmth. They'll also want to see how well you can move your joints.",
    "Symptoms": [
      "pain",
      "stiffness",
      "swelling",
      "redness",
      "decreased range of motion"
    ],
    "Causes": "The two main types of arthritis — osteoarthritis and rheumatoid arthritis — damage joints in different ways. Osteoarthritis: the most common type of arthritis, osteoarthritis involves wear-and-tear damage to a joint's cartilage — the hard, slick coating on the ends of bones where they form a joint. Cartilage cushions the ends of the bones and allows nearly frictionless joint motion, but enough damage can result in bone grinding directly on bone, which causes pain and restricted movement. This wear and tear can occur over many years, or it can be hastened by a joint injury or infection. Rheumatoid arthritis: the body's immune system attacks the lining of the joint capsule, a tough membrane that encloses all the joint parts. This lining (synovial membrane) becomes inflamed and swollen. The disease process can eventually destroy cartilage and bone within the joint.",
    "Precaution": [
      "weight loss",
      "exercise",
      "heat and cold",
      "assistive devices"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/arthritis/symptoms-causes/syc-20350772#:~:text=Arthritis%20is%20the%20swelling%20and,are%20osteoarthritis%20and%20rheumatoid%20arthritis."
    ]
  },
  "bronchitis": {
    "Overview": "Bronchitis is an inflammation of the lining of your bronchial tubes, which carry air to and from your lungs. People who have bronchitis often cough up thickened mucus, which can be discolored. Bronchitis may be either acute or chronic.",
    "Diagnosis": "During the first few days of illness, it can be difficult to distinguish the signs and symptoms of bronchitis from those of a common cold. During the physical exam, your doctor will use a stethoscope to listen closely to your lungs as you breathe.",
    "Symptoms": [
      "cough",
      "production of mucus",
      "fatigue",
      "shortness of breath",
      "slight fever and chills",
      "chest discomfort"
    ],
    "Causes": "Acute bronchitis is usually caused by viruses, typically the same viruses that cause colds and flu (influenza). Antibiotics don't kill viruses, so this type of medication isn't useful in most cases of bronchitis. The most common cause of chronic bronchitis is cigarette smoking. Air pollution and dust or toxic gases in the environment or workplace also can contribute to the condition.",
    "Precaution": [
      "avoid lung irritants",
      "using a humidifier",
      "consider a face mask outside"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/bronchitis/symptoms-causes/syc-20355566#:~:text=Bronchitis%20is%20an%20inflammation%20of,be%20either%20acute%20or%20chronic."
    ]
  },
  "hemiparesis": {
    "Overview": "Hemiparesis is a common after-effect of stroke that causes weakness on one side of the body. This one-sided weakness can limit your movement and affect all basic activities, such as dressing, eating, and walking. People often confuse hemiparesis and hemiplegia. Both conditions occur as the result of a stroke. In cases of hemiplegia, you will experience one-sided paralysis, which could make it difficult or impossible to move. Hemiplegia may lead to bladder control, trouble swallowing, breathing, and speaking.",
    "Diagnosis": "To diagnose hemiparesis and hemiplegia, a doctor will most likely use a number of diagnostic procedures and imaging tests.",
    "Symptoms": [
      "difficulty standing",
      "difficulty walking",
      "unusual sensations in the affected side of the body",
      "strain on the unaffected side of the body"
    ],
    "Causes": "Your brain and spinal cord control muscle movement. If either your brain or spinal cord is damaged, they're not able to direct the muscles. The result is paralysis.",
    "Precaution": [
      "physical therapy",
      "occupational therapy",
      "mobility ads",
      "adaptive equipment",
      "assistive technology",
      "alternative treatments"
    ],
    "Source": [
      "https://www.webmd.com/stroke/what-is-hemiparesis"
    ]
  },
  "osteoporosis": {
    "Overview": "Osteoporosis is defined by the World Health Organization (WHO) as a bone mineral density of 2.5 standard deviations or more below the mean peak bone mass (average of young, healthy adults) as measured by dual-energy X-ray absorptiometry. The term 'established osteoporosis' includes the presence of a fragility fracture. It is a medical condition that affects the bones, causing them to become weak and fragile and more likely to break (fracture).",
    "Diagnosis": "Osteoporosis is often diagnosed after the weakening of the bones has led to a fracture. Diagnosis can be made on suspicion when patient approaches a doctor for any other reason or x-ray is done otherwise and bones appear weak.",
    "Symptoms": [
      "joint pain",
      "swelling",
      "loss of height and stooped posture",
      "disfigurement",
      "a curved upper back",
      "debilitation"
    ],
    "Causes": "Osteoporosis may be caused due to decrease in density of bones.",
    "Precaution": [
      "regular exercise",
      "healthy eating"
    ],
    "Source": [
      "https://www.nhp.gov.in/disease/musculo-skeletal-bone-joints-/osteoporosis"
    ]
  },
  "transient ischemic attack": {
    "Overview": "A transient ischemic attack (TIA) is a temporary period of symptoms similar to those of a stroke. A TIA usually lasts only a few minutes and doesn't cause permanent damage. Often called a ministroke, a TIA may be a warning. About 1 in 3 people who has a TIA will eventually have a stroke, with about half occurring within a year after the TIA.",
    "Diagnosis": "A prompt evaluation of your symptoms is vital in diagnosing the cause of the TIA and deciding on a method of treatment. To help determine the cause of the TIA and to assess your risk of a stroke, your provider may rely on physical exam and tests, carotid ultrasonography, computerized temography, magnetic resonance imaging, echocardiography, and arteriography.",
    "Symptoms": [
      "weakness",
      "slurred speech",
      "blindness in one or both eyes",
      "vertigo"
    ],
    "Causes": "A TIA has the same origins as that of an ischemic stroke, the most common type of stroke. In an ischemic stroke, a clot blocks the blood supply to part of the brain. In a TIA, unlike a stroke, the blockage is brief, and there is no permanent damage. The underlying cause of a TIA often is a buildup of cholesterol-containing fatty deposits called plaques (atherosclerosis) in an artery or one of its branches that supplies oxygen and nutrients to the brain. Plaques can decrease the blood flow through an artery or lead to the development of a clot. A blood clot moving to an artery that supplies the brain from another part of the body, most commonly from the heart, also may cause a TIA.",
    "Precaution": [
      "medications",
      "surgery",
      "angioplasty"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/transient-ischemic-attack/symptoms-causes/syc-20355679"
    ]
  },
  "adenocarcinoma": {
    "Overview": "Adenocarcinoma is a type of cancer that starts in mucus-producing glandular cells of your body. Many organs have these glands, and adenocarcinoma can occur in any of these organs. Common types include breast cancer, colorectal cancer, lung cancer, pancreatic cancer, and prostate cancer.",
    "Diagnosis": "Your doctor will ask for your medical history and perform a physical exam to help determine which tests to choose. Tests to diagnose cancer will vary depending on the location, but three frequently used tests include biopsy, CT scan, and MRI.",
    "Symptoms": [
      "breast swelling",
      "change in breast shape or size",
      "dimpled or puckered skin on a breast",
      "bloody nipple discharge",
      "nipple retraction",
      "red or scaly skin or nipple"
    ],
    "Causes": "There are a few factors that contribute to the development of this disease. The most common adenocarcinoma causes include smoking, toxin exposure, and previous radiation therapy.",
    "Precaution": [
      "avoid tobacco products",
      "be physically active",
      "maintain healthy weight",
      "well-balanced diet",
      "visit your healthcare provider regularly"
    ],
    "Source": [
      "https://www.healthline.com/health/cancer/adenocarcinoma-symptoms#:~:text=Adenocarcinoma%20is%20a%20type%20of,pancreatic%20cancer%2C%20and%20prostate%20cancer.",
      "https://my.clevelandclinic.org/health/diseases/21652-adenocarcinoma-cancers#prevention"
    ]
  },
  "paranoia": {
    "Overview": "Paranoia is a thought process that causes you to have an irrational suspicion or mistrust of others. People with paranoia may feel like they're being persecuted or that someone is out to get them. They may feel the threat of physical harm even if they aren't in danger. People with dementia sometimes have paranoia, and it also can occur in people who use drugs. Paranoid thoughts can also be a symptom of a mental illness or a personality disorder.",
    "Diagnosis": "Your doctor will perform a medical exam and take a complete medical history to help them rule out a physical or medical reason for your symptoms, such as dementia. If your paranoia is part of a psychiatric issue, your doctor will refer you to a psychiatrist or a psychologist who will perform an evaluation and psychological tests to help them determine your mental status.",
    "Symptoms": [
      "constant stress",
      "mistrust of others",
      "feeling disbelieved",
      "feeling victimized",
      "isolation"
    ],
    "Causes": "Paranoid behavior usually occurs due to personality disorders or other mental illnesses such as schizophrenia. It's not fully understood why some people develop personality disorders or mental illness. It may be a combination of factors, including genetics, stress, and brain chemistry.",
    "Precaution": [
      "accepting one's vulnerability",
      "increasing their self-esteem",
      "developing trust in others",
      "learning to express and handle emotions in a positive manner"
    ],
    "Source": [
      "https://www.healthline.com/health/paranoia#treatment"
    ]
  },
  "pancreatitis": {
    "Overview": "Pancreatitis is inflammation of the pancreas. The pancreas is a long, flat gland that sits tucked behind the stomach in the upper abdomen. The pancreas produces enzymes that help digestion and hormones that help regulate the way your body processes sugar (glucose). Pancreatitis can occur as acute pancreatitis — meaning it appears suddenly and lasts for days. Some people develop chronic pancreatitis, which is pancreatitis that occurs over many years",
    "Diagnosis": "Tests and procedures used to diagnose pancreatitis include blood tests, abdominal ultrasound, computerized tomography scan, magnetic resonance imaging, endoscopic ultrasound, and stool tests.",
    "Symptoms": [
      "upper abdominal pain",
      "abdominal pain that radiates the back",
      "tenderness when touching the abdomen",
      "fever",
      "rapid pulse",
      "nausea",
      "vomiting"
    ],
    "Causes": "Pancreatitis occurs when digestive enzymes become activated while still in the pancreas, irritating the cells of your pancreas and causing inflammation. With repeated bouts of acute pancreatitis, damage to the pancreas can occur and lead to chronic pancreatitis. Scar tissue may form in the pancreas, causing loss of function. A poorly functioning pancreas can cause digestion problems and diabetes.",
    "Precaution": [
      "stop drinking alcohol",
      "stop smoking",
      "choosing a low-fat diet",
      "drink more fluids"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/pancreatitis/symptoms-causes/syc-20360227#:~:text=Pancreatitis%20is%20inflammation%20of%20the,body%20processes%20sugar%20(glucose)."
    ]
  },
  "incontinence": {
    "Overview": "Urinary incontinence — the loss of bladder control — is a common and often embarrassing problem. The severity ranges from occasionally leaking urine when you cough or sneeze to having an urge to urinate that's so sudden and strong you don't get to a toilet in time. Though it occurs more often as people get older, urinary incontinence isn't an inevitable consequence of aging. If urinary incontinence affects your daily activities, don't hesitate to see your doctor. For most people, simple lifestyle and dietary changes or medical care can treat symptoms of urinary incontinence.",
    "Diagnosis": "It's important to determine the type of urinary incontinence that you have, and your symptoms often tell your doctor which type you have. That information will guide treatment decisions. Your doctor is likely to start with a thorough history and physical exam. You may then be asked to do a simple maneuver that can demonstrate incontinence, such as coughing.",
    "Symptoms": [
      "stress incontinence",
      "urge incontinence",
      "overflow incontinence",
      "functional incontinence",
      "mixed incontinence"
    ],
    "Causes": "Urinary incontinence can be caused by everyday habits, underlying medical conditions or physical problems. A thorough evaluation by your doctor can help determine what's behind your incontinence.",
    "Precaution": [
      "use washcloth to clean yourself",
      "allow your skin to air-dry",
      "avoid frequent washing that can overwhelm your body's natural defenses",
      "consider using a barrier cream",
      "ask your doctor about special cleansers made to remove urine that may be less drying than other products"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/urinary-incontinence/symptoms-causes/syc-20352808#:~:text=Overview,to%20a%20toilet%20in%20time."
    ]
  },
  "paroxysmal dyspnea": {
    "Overview": "Paroxysmal nocturnal dyspnea (PND) causes sudden shortness of breath during sleep. As a result, you wake up gasping for air. It tends to occur within a few hours after you've fallen asleep.",
    "Diagnosis": "Your doctor will try to determine the underlying cause of your PND. They'll ask you about your medical history and symptoms, and conduct tests to assess your heart and lungs.",
    "Symptoms": [
      "sleep anxiety",
      "insomnia"
    ],
    "Causes": "There is a lack of consensus over the term “paroxysmal nocturnal dyspnea.” Some medical professionals use it to refer exclusively to a symptom of heart failure. In other cases, it's used to describe nighttime shortness of breath caused by other medical conditions, some of which are benign. Some of the most common causes of nighttime shortness of breath are described below.",
    "Precaution": [
      "diuretic therapy",
      "cardiac medication therapy",
      "reduce stress",
      "get enough sleep"
    ],
    "Source": [
      "https://www.healthline.com/health/paroxysmal-nocturnal-dyspnea#diagnosis"
    ]
  },
  "hernia": {
    "Overview": "A hernia is a tear in your muscle or tissue that allows part of your insides to bulge out. It can be a bulge of an internal organ or your intestines. Sometimes you can see the hernia, depending on its location and size. Certain activities can worsen the condition, like bending over or lifting heavy objects.",
    "Diagnosis": "Your doctor usually can detect a hernia in a physical exam. They also might order tests to further assess your condition and the cause. An ultrasound test uses sound waves to scan your body. A barium X-ray takes images of your digestive area and intestines. A computed tomography (CT) scan also uses X-rays to get pictures. An endoscopy studies your esophagus and stomach using a small camera at the end of a flexible tube.",
    "Symptoms": [
      "visible bulge on affected area",
      "pressure",
      "cough",
      "heartburn",
      "difficulty swallowing",
      "shooting pain",
      "vomiting",
      "constipation"
    ],
    "Causes": "The various types of hernias can have different causes. In general, a hernia starts with pressure on an organ or your intestines. A hernia forms when this pressure happens in the same area as a weakened muscle or tissue. Some people are born with weak muscles or tissue that isn't fully developed. However, most people get hernias as their bodies age and their muscles weaken.",
    "Precaution": [
      "eating smaller meals",
      "losing weight",
      "avoiding alcohol and tobacco",
      "avoiding certain foods",
      "using proper lifting techniques to prevent strains"
    ],
    "Source": [
      "https://familydoctor.org/condition/hernia/#:~:text=A%20hernia%20is%20a%20tear,over%20or%20lifting%20heavy%20objects."
    ]
  },
  "malignant neoplasm of prostate": {
    "Overview": "Prostate cancer is cancer that occurs in the prostate. The prostate is a small walnut-shaped gland in males that produces the seminal fluid that nourishes and transports sperm.",
    "Diagnosis": "f prostate cancer screening detects an abnormality, your doctor may recommend further tests to determine whether you have prostate cancer, such as ultrasound, magnetic resonance imaging, and collecting samples of prostate tissue.",
    "Symptoms": [
      "trouble urinating",
      "decreased force in the stream of urine",
      "blood in the urine",
      "blood in the semen",
      "bone pain",
      "losing weight",
      "erectile dysfunction"
    ],
    "Causes": "It's not clear what causes prostate cancer. Doctors know that prostate cancer begins when cells in the prostate develop changes in their DNA. A cell's DNA contains the instructions that tell a cell what to do. The changes tell the cells to grow and divide more rapidly than normal cells do. The abnormal cells continue living, when other cells would die. The accumulating abnormal cells form a tumor that can grow to invade nearby tissue. In time, some abnormal cells can break away and spread (metastasize) to other parts of the body.",
    "Precaution": [
      "immediate treatment",
      "surgery to remove the prostate",
      "radiation therapy",
      "hormone therapy",
      "chemotherapy",
      "immunotherapy"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/prostate-cancer/diagnosis-treatment/drc-20353093"
    ]
  },
  "carcinoma prostate": {
    "Overview": "Prostate cancer is cancer that occurs in the prostate. The prostate is a small walnut-shaped gland in males that produces the seminal fluid that nourishes and transports sperm.",
    "Diagnosis": "f prostate cancer screening detects an abnormality, your doctor may recommend further tests to determine whether you have prostate cancer, such as ultrasound, magnetic resonance imaging, and collecting samples of prostate tissue.",
    "Symptoms": [
      "trouble urinating",
      "decreased force in the stream of urine",
      "blood in the urine",
      "blood in the semen",
      "bone pain",
      "losing weight",
      "erectile dysfunction"
    ],
    "Causes": "It's not clear what causes prostate cancer. Doctors know that prostate cancer begins when cells in the prostate develop changes in their DNA. A cell's DNA contains the instructions that tell a cell what to do. The changes tell the cells to grow and divide more rapidly than normal cells do. The abnormal cells continue living, when other cells would die. The accumulating abnormal cells form a tumor that can grow to invade nearby tissue. In time, some abnormal cells can break away and spread (metastasize) to other parts of the body.",
    "Precaution": [
      "immediate treatment",
      "surgery to remove the prostate",
      "radiation therapy",
      "hormone therapy",
      "chemotherapy",
      "immunotherapy"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/prostate-cancer/diagnosis-treatment/drc-20353093"
    ]
  },
  "edema pulmonary": {
    "Overview": "Pulmonary edema is a condition caused by excess fluid in the lungs. This fluid collects in the numerous air sacs in the lungs, making it difficult to breathe. In most cases, heart problems cause pulmonary edema. But fluid can collect in the lungs for other reasons, including pneumonia, exposure to certain toxins and medications, trauma to the chest wall, and traveling to or exercising at high elevations.",
    "Diagnosis": "Breathing problems require immediate diagnosis and treatment. Your doctor can make a preliminary diagnosis of pulmonary edema based on your signs and symptoms and the results of a physical exam, electrocardiogram and chest X-ray. Once your condition is more stable, your doctor will ask questions about your medical history, especially whether you have ever had cardiovascular or lung disease.",
    "Symptoms": [
      "difficulty breathing",
      "feeling of suffocating",
      "cough that produces frothy sputum that may be tinged with blood",
      "wheezing or gasping for breath",
      "cold, clammy skin",
      "anxiety",
      "bluish lips",
      "rapid, irregular heartbeat"
    ],
    "Causes": "The causes of pulmonary edema vary. Pulmonary edema is grouped into two categories, depending on where the problem started. If a heart problem causes the pulmonary edema, it's called cardiogenic pulmonary edema. Most often, the fluid buildup in the lungs is due to a heart condition. If pulmonary edema is not heart related, it's called noncardiogenic pulmonary edema. Sometimes, pulmonary edema can be caused by both a heart problem and a non-heart problem.",
    "Precaution": [
      "keep blood pressure under control",
      "manage other medical conditions",
      "avoid the cause of your condition",
      "don't smoke",
      "eat less salt",
      "choose a healthy diet",
      "manage your weight",
      "regular exercise"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/pulmonary-edema/diagnosis-treatment/drc-20377014"
    ]
  },
  "lymphatic diseases": {
    "Overview": "Lymphedema refers to tissue swelling caused by an accumulation of protein-rich fluid that's usually drained through the body's lymphatic system. It most commonly affects the arms or legs, but can also occur in the chest wall, abdomen, neck and genitals. Lymph nodes are an important part of your lymphatic system. Lymphedema can be caused by cancer treatments that remove or damage your lymph nodes. Any type of problem that blocks the drainage of lymph fluid can cause lymphedema.",
    "Diagnosis": "If you're at risk of lymphedema — for instance, if you've recently had cancer surgery involving your lymph nodes — your doctor may diagnose lymphedema based on your signs and symptoms. If the cause of your lymphedema isn't as obvious, your doctor may order imaging tests to get a look at your lymph system",
    "Symptoms": [
      "swelling of part or all the arm or leg",
      "feeling of heaviness or tightness",
      "restricted range of motion",
      "recurring infections",
      "hardening and thickening of the skin"
    ],
    "Causes": "The lymphatic system is a network of vessels that carry protein-rich lymph fluid throughout the body. It's part of your immune system. Lymph nodes act as filters and contain cells that fight infection and cancer. The lymph fluid is pushed through the lymph vessels by muscle contractions as you move through the tasks of your day and small pumps in the wall of the lymph vessels. Lymphedema occurs when the lymph vessels are not able to adequately drain lymph fluid, usually from an arm or leg.",
    "Precaution": [
      "protect yourself from sharp objects",
      "find out all you can about lymphedema",
      "take care of the affected limb",
      "take care of your whole body",
      "get support from others with lymphedema"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/lymphedema/diagnosis-treatment/drc-20374687"
    ]
  },
  "stenosis aortic valve": {
    "Overview": "Aortic valve stenosis — or aortic stenosis — occurs when the heart's aortic valve narrows. The valve doesn't open fully, which reduces or blocks blood flow from your heart into the main artery to your body (aorta) and to the rest of your body. Your treatment depends on the severity of your condition. You may need surgery to repair or replace the valve. Without treatment, severe aortic valve stenosis can lead to death.",
    "Diagnosis": "To diagnose aortic valve stenosis, your doctor will review your signs and symptoms, discuss your medical history, and do a physical examination. He or she will listen to your heart with a stethoscope to determine if you have a heart murmur that may signal an aortic valve condition.",
    "Symptoms": [
      "abnormal heart sound",
      "chest pain",
      "feeling dizzy or faint",
      "shortness of breath",
      "fatigue",
      "rapid, fluttering heartbeat",
      "not eating enough",
      "not gaining enough weight"
    ],
    "Causes": "Your heart has four valves that keep blood flowing in the correct direction. These valves include the mitral valve, tricuspid valve, pulmonary valve and aortic valve. Each valve has flaps (cusps or leaflets) that open and close once during each heartbeat. Sometimes, the valves don't open or close properly. If a valve doesn't fully open or close, blood flow is reduced or blocked. In aortic valve stenosis, the aortic valve between the lower left heart chamber (left ventricle) and the aorta does not open completely. The area through which blood moves out of the heart to the aorta is narrowed (stenosis). When the aortic valve opening is narrowed, your heart must work harder to pump enough blood into the aorta and to the rest of your body. The extra work of the heart can cause the left ventricle to thicken and enlarge. Eventually the strain can cause a weakened heart muscle and can ultimately lead to heart failure and other serious problems.",
    "Precaution": [
      "eating a heart-healthy diet",
      "maintaining a healthy weight",
      "regular exercise",
      "managing stress",
      "avoiding tobacco"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/aortic-stenosis/diagnosis-treatment/drc-20353145"
    ]
  },
  "malignant neoplasm of breast": {
    "Overview": "Breast cancer is cancer that forms in the cells of the breasts. After skin cancer, breast cancer is the most common cancer diagnosed in women in the United States. Breast cancer can occur in both men and women, but it's far more common in women. Substantial support for breast cancer awareness and research funding has helped created advances in the diagnosis and treatment of breast cancer. Breast cancer survival rates have increased, and the number of deaths associated with this disease is steadily declining, largely due to factors such as earlier detection, a new personalized approach to treatment and a better understanding of the disease.",
    "Diagnosis": "Tests and procedures used to diagnose breast cancer include breast exam, mammogram, breast ultrasound, removing a sample of breast cells for testing, and breast magnetic resonance imaging.",
    "Symptoms": [
      "breast lump",
      "change in size, shape or appearance of a breast",
      "changes to the skin over the breast, such as dimpling",
      "a newly inverted nipple",
      "peeling, scaling, crusting or flaking of the pigmented area of skin surrounding the nipple",
      "redness or pitting of the skin over your breast"
    ],
    "Causes": "Doctors know that breast cancer occurs when some breast cells begin to grow abnormally. These cells divide more rapidly than healthy cells do and continue to accumulate, forming a lump or mass. Cells may spread (metastasize) through your breast to your lymph nodes or to other parts of your body. Breast cancer most often begins with cells in the milk-producing ducts (invasive ductal carcinoma). Breast cancer may also begin in the glandular tissue called lobules (invasive lobular carcinoma) or in other cells or tissue within the breast. Researchers have identified hormonal, lifestyle and environmental factors that may increase your risk of breast cancer. But it's not clear why some people who have no risk factors develop cancer, yet other people with risk factors never do. It's likely that breast cancer is caused by a complex interaction of your genetic makeup and your environment.",
    "Precaution": [
      "limit alcochol",
      "maintain a healthy weight",
      "regular exercise",
      "breast-feed",
      "limit postmenopausal hormone therapy"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/breast-cancer/diagnosis-treatment/drc-20352475",
      "https://www.mayoclinic.org/healthy-lifestyle/womens-health/in-depth/breast-cancer-prevention/art-20044676"
    ]
  },
  "carcinoma breast": {
    "Overview": "Breast cancer is cancer that forms in the cells of the breasts. After skin cancer, breast cancer is the most common cancer diagnosed in women in the United States. Breast cancer can occur in both men and women, but it's far more common in women. Substantial support for breast cancer awareness and research funding has helped created advances in the diagnosis and treatment of breast cancer. Breast cancer survival rates have increased, and the number of deaths associated with this disease is steadily declining, largely due to factors such as earlier detection, a new personalized approach to treatment and a better understanding of the disease.",
    "Diagnosis": "Tests and procedures used to diagnose breast cancer include breast exam, mammogram, breast ultrasound, removing a sample of breast cells for testing, and breast magnetic resonance imaging.",
    "Symptoms": [
      "breast lump",
      "change in size, shape or appearance of a breast",
      "changes to the skin over the breast, such as dimpling",
      "a newly inverted nipple",
      "peeling, scaling, crusting or flaking of the pigmented area of skin surrounding the nipple",
      "redness or pitting of the skin over your breast"
    ],
    "Causes": "Doctors know that breast cancer occurs when some breast cells begin to grow abnormally. These cells divide more rapidly than healthy cells do and continue to accumulate, forming a lump or mass. Cells may spread (metastasize) through your breast to your lymph nodes or to other parts of your body. Breast cancer most often begins with cells in the milk-producing ducts (invasive ductal carcinoma). Breast cancer may also begin in the glandular tissue called lobules (invasive lobular carcinoma) or in other cells or tissue within the breast. Researchers have identified hormonal, lifestyle and environmental factors that may increase your risk of breast cancer. But it's not clear why some people who have no risk factors develop cancer, yet other people with risk factors never do. It's likely that breast cancer is caused by a complex interaction of your genetic makeup and your environment.",
    "Precaution": [
      "limit alcochol",
      "maintain a healthy weight",
      "regular exercise",
      "breast-feed",
      "limit postmenopausal hormone therapy"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/breast-cancer/diagnosis-treatment/drc-20352475",
      "https://www.mayoclinic.org/healthy-lifestyle/womens-health/in-depth/breast-cancer-prevention/art-20044676"
    ]
  },
  "schizophrenia": {
    "Overview": "Schizophrenia is a serious mental disorder in which people interpret reality abnormally. Schizophrenia may result in some combination of hallucinations, delusions, and extremely disordered thinking and behavior that impairs daily functioning, and can be disabling. People with schizophrenia require lifelong treatment. Early treatment may help get symptoms under control before serious complications develop and may help improve the long-term outlook.",
    "Diagnosis": "Diagnosis of schizophrenia involves ruling out other mental health disorders and determining that symptoms are not due to substance abuse, medication or a medical condition. Determining a diagnosis of schizophrenia may include physical exam, tests and screenings, psychiatric evaluation, and diagnostic criteria for schizophrenia.",
    "Symptoms": [
      "delusions",
      "hallucinations",
      "disorganized thinking",
      "extremely disorganized or abnormal motor behavior",
      "negative symptoms"
    ],
    "Causes": "It's not known what causes schizophrenia, but researchers believe that a combination of genetics, brain chemistry and environment contributes to development of the disorder. Problems with certain naturally occurring brain chemicals, including neurotransmitters called dopamine and glutamate, may contribute to schizophrenia. Neuroimaging studies show differences in the brain structure and central nervous system of people with schizophrenia. While researchers aren't certain about the significance of these changes, they indicate that schizophrenia is a brain disease.",
    "Precaution": [
      "medications",
      "second-generation antiphyschotics",
      "first-generation antipsychotics",
      "long-acting injectable antipsychotics",
      "psychosocial interventions",
      "electroconvulsive therapy"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/schizophrenia/diagnosis-treatment/drc-20354449"
    ]
  },
  "diverticulitis": {
    "Overview": "Diverticula are small, bulging pouches that can form in the lining of your digestive system. They are found most often in the lower part of the large intestine (colon). Diverticula are common, especially after age 40, and seldom cause problems. The presence of diverticula is known as diverticulosis (die-vur-tik-yoo-LOE-sis). When one or more of the pouches become inflamed, and in some cases infected, that condition is known as diverticulitis (die-vur-tik-yoo-LIE-tis). Diverticulitis can cause severe abdominal pain, fever, nausea and a marked change in your bowel habits.",
    "Diagnosis": "Diverticula are small, bulging pouches that can form in the lining of your digestive system. They are found most often in the lower part of the large intestine (colon). Diverticula are common, especially after age 40, and seldom cause problems. The presence of diverticula is known as diverticulosis (die-vur-tik-yoo-LOE-sis). When one or more of the pouches become inflamed, and in some cases infected, that condition is known as diverticulitis (die-vur-tik-yoo-LIE-tis). Diverticulitis can cause severe abdominal pain, fever, nausea and a marked change in your bowel habits.",
    "Symptoms": [
      "pain",
      "nausea and vomiting",
      "fever",
      "abdominal tenderness",
      "constipation"
    ],
    "Causes": "Diverticula usually develop when naturally weak places in your colon give way under pressure. This causes marble-sized pouches to protrude through the colon wall. Diverticulitis occurs when diverticula tear, resulting in inflammation, and in some cases, infection.",
    "Precaution": [
      "primary bowel resection",
      "have an appointment as soon as possible",
      "bowel resection with colostomy",
      "follow-up care"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/diverticulitis/diagnosis-treatment/drc-20371764"
    ]
  },
  "overload fluid": {
    "Overview": "Fluid overload is also called hypervolemia. It's when you have too much fluid in your body. It can be caused by several different conditions including heart failure, kidney failure, cirrhosis, or pregnancy.",
    "Diagnosis": "Your doctor will do a physical exam and talk to you about your symptoms and your medical history. Your doctor may be able to diagnose you with fluid overload based on edema and weight gain. You may also need additional lab or imaging tests to determine the underlying cause.   ",
    "Symptoms": [
      "swelling",
      "high blood pressure",
      "shortness of breath",
      "discomfort",
      "weight gain",
      "chest pain"
    ],
    "Causes": "Fluid overload happens when your kidneys retain sodium. Your kidneys manage the salt and fluid balance in your body. When something causes your kidneys to retain sodium, it increases the sodium in the rest of your body. This causes your body to produce too much fluid. ",
    "Precaution": [
      "quit smoking",
      "take medicines as directed",
      "maintain a healthy weight",
      "keep track of how much fluid you drink",
      "alcohol intake moderation",
      "eat a healthy diet",
      "avoid too much caffeine",
      "regular exercise",
      "manage your stress",
      "get enough sleep",
      "keep track of your blood pressure",
      "control your blood sugar",
      "stay up to date with your flu and pneumonia vaccines"
    ],
    "Source": [
      "https://www.webmd.com/a-to-z-guides/what-is-fluid-overload#091e9c5e8219186d-2-7"
    ]
  },
  "ulcer peptic": {
    "Overview": "Peptic ulcers are open sores that develop on the inside lining of your stomach and the upper portion of your small intestine. The most common symptom of a peptic ulcer is stomach pain.",
    "Diagnosis": "To detect an ulcer, your doctor may first take a medical history and perform a physical exam. You then may need to undergo diagnostic tests, such as laboratory tests for H. pylori, endoscopy, and upper gastrointestinal series.",
    "Symptoms": [
      "burning stomach pain",
      "feeling of fullnes, bloating or belching",
      "intolerance to fatty foods",
      "heartburn",
      "nausea"
    ],
    "Causes": "Peptic ulcers occur when acid in the digestive tract eats away at the inner surface of the stomach or small intestine. The acid can create a painful open sore that may bleed. Your digestive tract is coated with a mucous layer that normally protects against acid. But if the amount of acid is increased or the amount of mucus is decreased, you could develop an ulcer.",
    "Precaution": [
      "consider switching pain relievers",
      "control stress",
      "don't smoke",
      "limit or avoid alcohol"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/peptic-ulcer/diagnosis-treatment/drc-20354229"
    ]
  },
  "osteomyelitis": {
    "Overview": "Osteomyelitis is an infection in a bone. Infections can reach a bone by traveling through the bloodstream or spreading from nearby tissue. Infections can also begin in the bone itself if an injury exposes the bone to germs. Smokers and people with chronic health conditions, such as diabetes or kidney failure, are more at risk of developing osteomyelitis. People who have diabetes may develop osteomyelitis in their feet if they have foot ulcers.",
    "Diagnosis": "Your doctor may feel the area around the affected bone for any tenderness, swelling or warmth. If you have a foot ulcer, your doctor may use a dull probe to determine the proximity of the underlying bone. Your doctor may order a combination of tests and procedures to diagnose osteomyelitis and to determine which germ is causing the infection.",
    "Symptoms": [
      "fever",
      "swelling",
      "pain in the area of the infection",
      "fatigue"
    ],
    "Causes": "Most cases of osteomyelitis are caused by staphylococcus bacteria, types of germs commonly found on the skin or in the nose of even healthy individuals. Germs can enter a bone in a variety of ways, including the bloodstream, injuries, and surgery.",
    "Precaution": [
      "appointment for surgery as soon as possible",
      "medications"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/osteomyelitis/diagnosis-treatment/drc-20375917"
    ]
  },
  "gastritis": {
    "Overview": "Gastritis is a general term for a group of conditions with one thing in common: Inflammation of the lining of the stomach. The inflammation of gastritis is most often the result of infection with the same bacterium that causes most stomach ulcers or the regular use of certain pain relievers. Drinking too much alcohol also can contribute to gastritis.",
    "Diagnosis": "Although your doctor is likely to suspect gastritis after talking to you about your medical history and performing an exam, you may also have one or more of the following tests to pinpoint the exact cause.",
    "Symptoms": [
      "gnawing or burning ache or pain in the upper abdomen",
      "nausea",
      "vomiting",
      "feeling of fullness in your upper abdomen after eating"
    ],
    "Causes": "Gastritis is an inflammation of the stomach lining. Weaknesses or injury to the mucus-lined barrier that protects the stomach wall allows digestive juices to damage and inflame the stomach lining. A number of diseases and conditions can increase the risk of gastritis, including inflammatory conditions, such as Crohn's disease.",
    "Precaution": [
      "avoid alcohol",
      "consider switching pain relievers"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/gastritis/diagnosis-treatment/drc-20355813"
    ]
  },
  "bacteremia": {
    "Overview": "Bacteremia is when there are bacteria present in your bloodstream. Another term that you may have heard for bacteremia is “blood poisoning,” however this isn't a medical term. In some cases, bacteremia can be asymptomatic, meaning there are no symptoms. In other cases, symptoms may be present and there's a potential risk for serious complications.",
    "Diagnosis": "Bacteremia can be diagnosed using a blood culture. To do this, a sample of blood will be taken from a vein in your arm. It will then be sent to a lab to be tested for the presence of bacteria. Depending on the presumed cause of your infection, your doctor may want to perform additional tests. Some examples include sputum culture, wound culture, and taking samples from in-dwelling catheters or other devices.",
    "Symptoms": [
      "fever",
      "chills",
      "shaking or shivering"
    ],
    "Causes": "A variety of different bacteria can cause bacteremia. Some of these bacteria can go on to establish an infection in the bloodstream.",
    "Precaution": [
      "antibiotics to prevent implications like sepsis"
    ],
    "Source": [
      "https://www.healthline.com/health/bacteremia#treatment"
    ]
  },
  "failure kidney": {
    "Overview": "Kidney failure is a condition in which one or both of the kidneys can no longer work on their own. This condition is also called renal failure. Treatments for kidney failure include dialysis and kidney transplant.",
    "Diagnosis": "Doctors use a variety of tests to measure kidney function and diagnose kidney failure. If your doctors suspect you may be at risk for kidney failure, they may recommend blood tests, advanced imaging and urine tests.",
    "Symptoms": [
      "fatigue",
      "upset stomach or vomiting",
      "confusion",
      "swelling around your ankles or hands",
      "more frequent bathroom trips",
      "muscle spasms",
      "dry or itchy skin",
      "poor appetite"
    ],
    "Causes": "The most common causes of kidney failure are diabetes and high blood pressure. Sometimes, though, kidney failure happens quickly due to an unforeseen cause. When the kidneys lose function suddenly (within hours or days), it's called acute kidney failure (or acute kidney injury).",
    "Precaution": [
      "monitor your kidney's function with your doctor's help",
      "keep your blood sugar levels under control",
      "keep your blood pressure levels in a normal range",
      "avoid smoking",
      "make healthy diet choices"
    ],
    "Source": [
      "https://my.clevelandclinic.org/health/diseases/17689-kidney-failure#prevention"
    ]
  },
  "sickle cell anemia": {
    "Overview": "Sickle cell anemia is one of a group of inherited disorders known as sickle cell disease. It affects the shape of red blood cells, which carry oxygen to all parts of the body. Red blood cells are usually round and flexible, so they move easily through blood vessels. In sickle cell anemia, some red blood cells are shaped like sickles or crescent moons. These sickle cells also become rigid and sticky, which can slow or block blood flow.",
    "Diagnosis": "A blood test can check for the form of hemoglobin that underlies sickle cell anemia. In the United States, this blood test is part of routine newborn screening. But older children and adults can be tested, too. In adults, a blood sample is drawn from a vein in the arm. In young children and babies, the blood sample is usually collected from a finger or heel. The sample is then sent to a laboratory, where it's screened for the sickle cell form of hemoglobin.",
    "Symptoms": [
      "anemia",
      "episodes of pain",
      "swelling of hands and feet",
      "frequent infections",
      "delayed growth or puberty",
      "vision problems"
    ],
    "Causes": "Sickle cell anemia is caused by a change in the gene that tells the body to make the iron-rich compound in red blood cells called hemoglobin. Hemoglobin enables red blood cells to carry oxygen from the lungs throughout the body. The hemoglobin associated with sickle cell anemia causes red blood cells to become rigid, sticky and misshapen. For a child to be affected, both mother and father must carry one copy of the sickle cell gene — also known as sickle cell trait — and pass both copies of the altered form to the child. If only one parent passes the sickle cell gene to the child, that child will have the sickle cell trait. With one typical hemoglobin gene and one altered form of the gene, people with the sickle cell trait make both typical hemoglobin and sickle cell hemoglobin. Their blood might contain some sickle cells, but they generally don't have symptoms. They're carriers of the disease, however, which means they can pass the gene to their children.",
    "Precaution": [
      "take folic acid supplements daily",
      "have a healthy diet",
      "drink plenty of water",
      "avoid temperature extremes",
      "regular exercise",
      "use nonpresctiption medications with caution",
      "don't smoke"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/sickle-cell-anemia/diagnosis-treatment/drc-20355882"
    ]
  },
  "failure heart": {
    "Overview": "Heart failure — sometimes known as congestive heart failure — occurs when the heart muscle doesn't pump blood as well as it should. When this happens, blood often backs up and fluid can build up in the lungs, causing shortness of breath. Certain heart conditions, such as narrowed arteries in the heart (coronary artery disease) or high blood pressure, gradually leave the heart too weak or stiff to fill and pump blood properly.",
    "Diagnosis": "To diagnose heart failure, your doctor will take a careful medical history, review your symptoms and perform a physical examination. Your doctor will also check to see if you have risk factors for heart failure, such as high blood pressure, coronary artery disease or diabetes. Your doctor can listen to your lungs for signs of fluid buildup (lung congestion) and your heart for whooshing sounds (murmurs) that may suggest heart failure. The doctor may examine the veins in your neck and check for fluid buildup in your abdomen and legs.",
    "Symptoms": [
      "shortness of breath",
      "fatigue",
      "swelling on legs",
      "irregular heartbeat",
      "reduced ability to exercise",
      "persistent cough or wheezing",
      "swelling of the belly area",
      "rapid weight gain",
      "nausea",
      "difficulty concentrating",
      "chest pain"
    ],
    "Causes": "Heart failure often develops after other conditions have damaged or weakened the heart. However, heart failure can also occur if the heart becomes too stiff. In heart failure, the main pumping chambers of the heart (the ventricles) may become stiff and not fill properly between beats. In some people, the heart muscle may become damaged and weakened. The ventricles may stretch to the point that the heart can't pump enough blood through the body. Over time, the heart can no longer keep up with the typical demands placed on it to pump blood to the rest of the body.",
    "Precaution": [
      "stop smoking",
      "check your legs, ankles and feet for swelling daily",
      "discuss weight monitoring with your doctor",
      "maintain a healthy weight",
      "eat a healthy diet",
      "limit salt",
      "limit saturated or trans fats in your diet",
      "get vaccinations",
      "limit alochol and fluids",
      "be active",
      "reduce stress",
      "sleep easy"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/heart-failure/diagnosis-treatment/drc-20373148"
    ]
  },
  "hepatitis": {
    "Overview": "Hepatitis A is a highly contagious liver infection caused by the hepatitis A virus. The virus is one of several types of hepatitis viruses that cause inflammation and affect your liver's ability to function. You're most likely to get hepatitis A from contaminated food or water or from close contact with a person or object that's infected. Mild cases of hepatitis A don't require treatment. Most people who are infected recover completely with no permanent liver damage.",
    "Diagnosis": "Blood tests are used to look for signs of the hepatitis A virus in your body. A sample of blood is taken, usually from a vein in your arm. It's sent to a laboratory for testing.",
    "Symptoms": [
      "fatigue",
      "sudden nausea and vomiting",
      "abdominal pain",
      "clay-colored bowel movements",
      "loss of appetite",
      "low-grade fever",
      "dark urine",
      "joint pain",
      "yellowing of skin and the whites of your eyes",
      "intense itching"
    ],
    "Causes": "Hepatitis A is caused by a virus that infects liver cells and causes inflammation. The inflammation can affect how your liver works and cause other signs and symptoms of hepatitis A. The virus most commonly spreads when you eat or drink something contaminated with fecal matter, even just tiny amounts. It does not spread through sneezing or coughing.",
    "Precaution": [
      "avoid sexual activity",
      "wash your hands thoroughly after using the toilet and changing diapers",
      "don't prepare foods for others while you're actively infected"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/hepatitis-a/diagnosis-treatment/drc-20367055"
    ]
  },
  "hypertension pulmonarydeglutition disorder": {
    "Overview": "Pulmonary hypertension is a type of high blood pressure that affects the arteries in the lungs and the right side of the heart. In one form of pulmonary hypertension, called pulmonary arterial hypertension (PAH), blood vessels in the lungs are narrowed, blocked or destroyed. The damage slows blood flow through the lungs, and blood pressure in the lung arteries rises. The heart must work harder to pump blood through the lungs. The extra effort eventually causes the heart muscle to become weak and fail.",
    "Diagnosis": "Pulmonary hypertension is hard to diagnose early because it's not often detected during a routine physical exam. Even when pulmonary hypertension is more advanced, its signs and symptoms are similar to those of other heart and lung conditions. To diagnose pulmonary hypertension, a health care provider will perform a physical exam and review your symptoms. You'll likely be asked questions about your medical and family history.",
    "Symptoms": [
      "blue lips and skin",
      "chest pressure or pain",
      "dizziness or fainting spells",
      "fast pulse or pounding heartbeat",
      "fatigue",
      "shortness of breath",
      "swelling in the ankles, legs, and eventually the belly area"
    ],
    "Causes": "The typical heart has two upper chambers (atria) and two lower chambers (ventricles). Each time blood passes through the heart, the lower right chamber (right ventricle) pumps blood to the lungs through a large blood vessel (pulmonary artery). In the lungs, the blood releases carbon dioxide and picks up oxygen. The blood typically flows easily through blood vessels in the lungs (pulmonary arteries, capillaries and veins) to the left side of the heart. However, changes in the cells that line the pulmonary arteries can cause the walls of the arteries to become stiff, swollen and thick. These changes may slow down or block blood flow through the lungs, causing pulmonary hypertension.",
    "Precaution": [
      "get plenty of rest",
      "stay as active as possible",
      "don't smoke",
      "talk to a health care provider before becoming pregnant",
      "avoid high altitudes",
      "avoid situations that can excessively lower blood pressure",
      "eat healthy and manage weight",
      "review all medications with your health care provider",
      "get regular health checkups",
      "get recommended vaccines",
      "get support"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/pulmonary-hypertension/diagnosis-treatment/drc-20350702"
    ]
  },
  "gout": {
    "Overview": "Gout is a common and complex form of arthritis that can affect anyone. It's characterized by sudden, severe attacks of pain, swelling, redness and tenderness in one or more joints, most often in the big toe. An attack of gout can occur suddenly, often waking you up in the middle of the night with the sensation that your big toe is on fire. The affected joint is hot, swollen and so tender that even the weight of the bedsheet on it may seem intolerable.",
    "Diagnosis": "Doctors usually diagnose gout based on your symptoms and the appearance of the affected joint. Tests to help diagnose gout may include joint fluid test, blood test, x-ray imaging, ultrasound and dual-energy computerized tomography.",
    "Symptoms": [
      "intense joint pain",
      "lingering discomfort",
      "inflammation and redness",
      "limited range of motion"
    ],
    "Causes": "Gout occurs when urate crystals accumulate in your joint, causing the inflammation and intense pain of a gout attack. Urate crystals can form when you have high levels of uric acid in your blood. Your body produces uric acid when it breaks down purines — substances that are found naturally in your body. Purines are also found in certain foods, including red meat and organ meats, such as liver. Purine-rich seafood includes anchovies, sardines, mussels, scallops, trout and tuna. Alcoholic beverages, especially beer, and drinks sweetened with fruit sugar (fructose) promote higher levels of uric acid. Normally, uric acid dissolves in your blood and passes through your kidneys into your urine. But sometimes either your body produces too much uric acid or your kidneys excrete too little uric acid. When this happens, uric acid can build up, forming sharp, needlelike urate crystals in a joint or surrounding tissue that cause pain, inflammation and swelling.",
    "Precaution": [
      "choose healthier beverages",
      "avoid foods high in purines",
      "exercise regularly and lose weight"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/gout/diagnosis-treatment/drc-20372903"
    ]
  },
  "thrombocytopaenia": {
    "Overview": "Thrombocytopenia is a condition in which you have a low blood platelet count. Platelets (thrombocytes) are colorless blood cells that help blood clot. Platelets stop bleeding by clumping and forming plugs in blood vessel injuries. Thrombocytopenia might occur as a result of a bone marrow disorder such as leukemia or an immune system problem. Or it can be a side effect of taking certain medications. It affects both children and adults.",
    "Diagnosis": "The following can be used to determine whether you have thrombocytopenia:  blood test and physical exams. Your doctor might suggest other tests and procedures to determine the cause of your condition, depending on your signs and symptoms.",
    "Symptoms": [
      "easy or excessive bruising",
      "superficial bleeding into the skin that appears as a rash of pinpoint-sized reddish-purple spots that are usually on the lower legs",
      "prolonged bleeding from cuts",
      "bleeding from your gums or nose",
      "blood in urine of stools",
      "unusually heavy menstrual flows",
      "fatigue",
      "enlarged spleen"
    ],
    "Causes": "Thrombocytopenia means you have fewer than 150,000 platelets per microliter of circulating blood. Because each platelet lives only about 10 days, your body normally renews your platelet supply continually by producing new platelets in your bone marrow. Thrombocytopenia rarely is inherited; or it can be caused by a number of medications or conditions. Whatever the cause, circulating platelets are reduced by one or more of the following processes: trapping of platelets in the spleen, decreased platelet production or increased destruction of platelets.",
    "Precaution": [
      "avoid activities that could cause injury",
      "alcohol intake moderation",
      "use caution with over-the-counter medications"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/thrombocytopenia/diagnosis-treatment/drc-20378298"
    ]
  },
  "hypoglycemia": {
    "Overview": "Hypoglycemia is a condition in which your blood sugar (glucose) level is lower than normal. Glucose is your body's main energy source. Hypoglycemia is often related to diabetes treatment. But other drugs and a variety of conditions — many rare — can cause low blood sugar in people who don't have diabetes",
    "Diagnosis": "If you use insulin or another diabetes medication to lower your blood sugar, and you have signs and symptoms of hypoglycemia, test your blood sugar levels with a blood glucose meter. If the result shows low blood sugar (under 70 mg/dL), treat accordingly.",
    "Symptoms": [
      "irregular or fast heartbeat",
      "fatigue",
      "pale skin",
      "shakiness",
      "anxiety",
      "sweating",
      "hunger",
      "irratibilty",
      "tingling or numbness of the lips, tongue or cheek"
    ],
    "Causes": "Hypoglycemia occurs when your blood sugar (glucose) level falls too low. There are several reasons why this can happen; the most common is a side effect of drugs used to treat diabetes.",
    "Precaution": [
      "immediate treatment"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/hypoglycemia/diagnosis-treatment/drc-20373689"
    ]
  },
  "pneumonia aspiration": {
    "Overview": "Aspiration pneumonia is an infection of the lungs caused by inhaling saliva, food, liquid, vomit and even small foreign objects. It can be treated with appropriate medications. If left untreated, complications can be serious, even fatal.",
    "Diagnosis": "Generally, the first thing your provider will do in any situation is take a complete medical history and perform a physical examination. They'll ask you about your current signs and symptoms. One thing that is a little tricky about aspiration pneumonia is that often no one actually sees you breathe in an object or food or saliva.",
    "Symptoms": [
      "shortness of breath",
      "coughing up blood",
      "chest pain",
      "bad breath",
      "extreme tiredness"
    ],
    "Causes": "Aspiration pneumonia is caused by inhaling foreign materials into your lungs. These materials can be bacteria from saliva, stomach contents such as digestive juices, food or small foreign objects.",
    "Precaution": [
      "avoid drinking alcohol",
      "stay upright when you are eating",
      "chew slowly and completely",
      "don't smoke or use nicotine products",
      "take good care of your teeth"
    ],
    "Source": [
      "https://my.clevelandclinic.org/health/diseases/21954-aspiration-pneumonia#prevention"
    ]
  },
  "colitis": {
    "Overview": "Ulcerative colitis (UL-sur-uh-tiv koe-LIE-tis) is an inflammatory bowel disease (IBD) that causes inflammation and ulcers (sores) in your digestive tract. Ulcerative colitis affects the innermost lining of your large intestine (colon) and rectum. Symptoms usually develop over time, rather than suddenly. Ulcerative colitis can be debilitating and can sometimes lead to life-threatening complications. While it has no known cure, treatment can greatly reduce signs and symptoms of the disease and bring about long-term remission.",
    "Diagnosis": "Endoscopic procedures with tissue biopsy are the only way to definitively diagnose ulcerative colitis. Other types of tests can help rule out complications or other forms of inflammatory bowel disease, such as Crohn's disease.",
    "Symptoms": [
      "diarrhea",
      "abdominal pain",
      "rectal pain",
      "rectal bleeding",
      "urgency to defecate",
      "inability to defecate despite urgency",
      " weight loss",
      "fatigue",
      "fever",
      "in children, failure to grow"
    ],
    "Causes": "The exact cause of ulcerative colitis remains unknown. Previously, diet and stress were suspected, but now doctors know that these factors may aggravate but don't cause ulcerative colitis. One possible cause is an immune system malfunction. When your immune system tries to fight off an invading virus or bacterium, an abnormal immune response causes the immune system to attack the cells in the digestive tract, too. Heredity also seems to play a role in that ulcerative colitis is more common in people who have family members with the disease. However, most people with ulcerative colitis don't have this family history.",
    "Precaution": [
      "limit dairy products",
      "eat small meals' ,'drink plenty of liquids",
      "talk to a dietitian"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/ulcerative-colitis/diagnosis-treatment/drc-20353331"
    ]
  },
  "diverticulosis": {
    "Overview": "Diverticulosis is “the presence of” and diverticulitis is “inflammation and infection of” one or more diverticula (bulges in your colon wall). Diverticulosis is common, doesn't cause symptoms or need treatment. Mild diverticulitis is treated with antibiotics. Surgery is needed if problems develop. A high fiber diet, exercise and drinking lots of water can help prevent.",
    "Diagnosis": "Because most people with diverticulosis don't have symptoms, it's usually found from other tests that are done for an unrelated reason.",
    "Symptoms": [
      "tenderness over the affected area",
      "mild abdominal cramps",
      "swelling or bloating",
      "constipation"
    ],
    "Causes": "Scientists aren't really sure what causes diverticulosis, but they think it's caused by not eating enough fiber. Not eating enough fiber causes a buildup of waste (constipation) in your colon. Constipation puts extra strain on the walls of the colon. This increased pressure causes the little pockets — the diverticula — to form in weak areas in your colon. Again, scientists aren't sure what causes diverticulitis, but they think the infection starts due to the bacteria in stool that gets pushed into the diverticula. Another theory is that the walls of the diverticula itself erode from the increased pressure on the colon walls.",
    "Precaution": [
      "eat more fiber",
      "drink plenty of water",
      "exercise daily"
    ],
    "Source": [
      "https://my.clevelandclinic.org/health/diseases/10352-diverticular-disease#prevention"
    ]
  },
  "suicide attempt": {
    "Overview": "Suicide, taking your own life, is a tragic reaction to stressful life situations — and all the more tragic because suicide can be prevented. Whether you're considering suicide or know someone who feels suicidal, learn suicide warning signs and how to reach out for immediate help and professional treatment. You may save a life — your own or someone else's",
    "Diagnosis": "Your doctor may do a physical exam, tests and in-depth questioning about your mental and physical health to help determine what may be causing your suicidal thinking and to determine the best treatment.",
    "Symptoms": [
      "talking about suicide",
      "getting the means to take your own life",
      "withdrawing from social contact",
      "having mood swings",
      "being preoccupied with death",
      "feeling trapped or hopeless about a situation",
      "increasing use of alcohol or drugs",
      "changing normal routine",
      "doing risky things",
      "giving away belongings or gettings affairs in order when there's no other logical explanation for doing things",
      "saying goodbye to people as if they won't be seen again",
      "developing personality changes"
    ],
    "Causes": "Suicidal thoughts have many causes. Most often, suicidal thoughts are the result of feeling like you can't cope when you're faced with what seems to be an overwhelming life situation. If you don't have hope for the future, you may mistakenly think suicide is a solution. You may experience a sort of tunnel vision, where in the middle of a crisis you believe suicide is the only way out. There also may be a genetic link to suicide. People who complete suicide or who have suicidal thoughts or behavior are more likely to have a family history of suicide.",
    "Precaution": [
      "avoid drugs and alcohol",
      "form a strong support network",
      "get active"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/suicide/diagnosis-treatment/drc-20378054"
    ]
  },
  "Pneumocystis carinii pneumonia": {
    "Overview": "Pneumocystis pneumonia (PCP) is a serious infection that causes inflammation and fluid buildup in your lungs. It's brought on by a fungus called Pneumocystis jirovecii that spreads through the air. This fungus is very common. Most people's immune systems have fought it off by the time they're 3 or 4 years old. But it can make people who have weakened immune systems, like from HIV, very sick. It's rare, but PCP can also affect other parts of your body, including your lymph nodes, liver, and bone marrow.",
    "Diagnosis": "A technician will use a microscope to look for traces of the fungus in fluid or tissue from your lungs. Your doctor will help you cough up fluid. Or they might use a special tool called a bronchoscope, which goes through your mouth and into your airways, to take a sample. They could also do a biopsy, using a needle or a knife to remove a tiny amount of cells from your lung. A test called PCR (polymerase chain reaction) makes copies of specific pieces of DNA so it can find smaller amounts of the fungus in samples. You might also get a chest X-ray or blood tests to check for low oxygen levels or high levels of something called beta-D-glucan.",
    "Symptoms": [
      "fever",
      "dry cough or wheezing",
      "shortness of breath",
      "fatigue",
      "chest pain",
      "chills",
      "weight loss"
    ],
    "Causes": "Pneumocystis pneumonia (PCP) is a serious infection caused by the fungus Pneumocystis jirovecii. Most people who get PCP have a medical condition that weakens their immune system, like HIV/AIDS, or take medicines (such as corticosteroids) that lower the body's ability to fight germs and sickness.",
    "Precaution": [
      "antibiotics such as trimethoprim and sulfamethoxazole"
    ],
    "Source": [
      "https://www.webmd.com/hiv-aids/guide/aids-hiv-opportunistic-infections-pneumocystis-pcp-pneumonia#091e9c5e80091cdb-3-9",
      "https://www.cdc.gov/fungal/diseases/pneumocystis-pneumonia/index.html#:~:text=Pneumocystis%20pneumonia%20(PCP)%20is%20a,to%20fight%20germs%20and%20sickness."
    ]
  },
  "hepatitis B": {
    "Overview": "Hepatitis B is a serious liver infection caused by the hepatitis B virus (HBV). For some people, hepatitis B infection becomes chronic, meaning it lasts more than six months. Having chronic hepatitis B increases your risk of developing liver failure, liver cancer or cirrhosis — a condition that permanently scars of the liver.",
    "Diagnosis": "Your doctor will examine you and look for signs of liver damage, such as yellowing skin or belly pain. Tests that can help diagnose hepatitis B or its complications are blood tests, liver ultrasound, and liver biopsy.",
    "Symptoms": [
      "abdominal pain",
      "dark urine",
      "fever",
      "joint pain",
      "loss of appetite",
      "nausea and vomiting",
      "weakness and fatigue",
      "yellowing of your skin and the whites of your eyes"
    ],
    "Causes": "Hepatitis B infection is caused by the hepatitis B virus (HBV). The virus is passed from person to person through blood, semen or other body fluids. It does not spread by sneezing or coughing.",
    "Precaution": [
      "make sex safer",
      "tell your sexual partner to get tested",
      "don't share personal care items"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/hepatitis-b/diagnosis-treatment/drc-20366821"
    ]
  },
  "parkinson disease": {
    "Overview": "Parkinson's disease is a progressive nervous system disorder that affects movement. Symptoms start gradually, sometimes starting with a barely noticeable tremor in just one hand. Tremors are common, but the disorder also commonly causes stiffness or slowing of movement. In the early stages of Parkinson's disease, your face may show little or no expression. Your arms may not swing when you walk. Your speech may become soft or slurred. Parkinson's disease symptoms worsen as your condition progresses over time.",
    "Diagnosis": "No specific test exists to diagnose Parkinson's disease. Your doctor trained in nervous system conditions (neurologist) will diagnose Parkinson's disease based on your medical history, a review of your signs and symptoms, and a neurological and physical examination. Your doctor may suggest a specific single-photon emission computerized tomography (SPECT) scan called a dopamine transporter scan (DaTscan). Although this can help support the suspicion that you have Parkinson's disease, it is your symptoms and neurologic examination that ultimately determine the correct diagnosis. Most people do not require a DaTscan .",
    "Symptoms": [
      "tremor",
      "slowed movement",
      "rigid muscles",
      "impaired posture and balance",
      "loss of automatic movements",
      "speech changes",
      "writing changes"
    ],
    "Causes": "In Parkinson's disease, certain nerve cells (neurons) in the brain gradually break down or die. Many of the symptoms are due to a loss of neurons that produce a chemical messenger in your brain called dopamine. When dopamine levels decrease, it causes abnormal brain activity, leading to impaired movement and other symptoms of Parkinson's disease.",
    "Precaution": [
      "healthy eating",
      "exercise",
      "avoiding falls",
      "daily living activities"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/parkinsons-disease/diagnosis-treatment/drc-20376062"
    ]
  },
  "lymphoma": {
    "Overview": "Lymphoma is a cancer of the lymphatic system, which is part of the body's germ-fighting network. The lymphatic system includes the lymph nodes (lymph glands), spleen, thymus gland and bone marrow. Lymphoma can affect all those areas as well as other organs throughout the body.",
    "Diagnosis": "Tests and procedures used to diagnose lymphoma include physcial exams, removing a lymph node for testing, blood tests, removing a sample of bone marrow for testing and imaging tests.",
    "Symptoms": [
      "painless swelling of lymph nodes in your neck, armpits or groin",
      "persistent fatigue",
      "fever",
      "night sweats",
      "shortness of breath",
      "unexplained weight loss",
      "itchy skin"
    ],
    "Causes": "Doctors aren't sure what causes lymphoma. But it begins when a disease-fighting white blood cell called a lymphocyte develops a genetic mutation. The mutation tells the cell to multiply rapidly, causing many diseased lymphocytes that continue multiplying. The mutation also allows the cells to go on living when other normal cells would die. This causes too many diseased and ineffective lymphocytes in your lymph nodes and causes the lymph nodes, spleen and liver to swell.",
    "Precaution": [
      "treatments such as therapy",
      "physical acitvity",
      "art therapy",
      "medtitation",
      "music therapy",
      "relaxation exercises",
      "acupunture",
      "massage"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/lymphoma/diagnosis-treatment/drc-20352642"
    ]
  },
  "hyperglycemia": {
    "Overview": "High blood sugar (hyperglycemia) affects people who have diabetes. Several factors can contribute to hyperglycemia in people with diabetes, including food and physical activity choices, illness, nondiabetes medications, or skipping or not taking enough glucose-lowering medication.",
    "Diagnosis": "Your doctor sets your target blood sugar range. For many people who have diabetes, Mayo Clinic generally recommends the following target blood sugar levels before meals: between 80 and 120 mg/dL (4.4 and 6.7 mmol/L) for people age 59 and younger who have no other underlying medical conditions. Between 80 and 120 mg/dL (4.4 and 6.7 mmol/L) for people age 59 and younger who have no other underlying medical conditions",
    "Symptoms": [
      "frequent urination",
      "increased thirst",
      "blurred vision",
      "fatigue",
      "headache"
    ],
    "Causes": "During digestion, your body breaks down carbohydrates from foods — such as bread, rice and pasta — into various sugar molecules. One of these sugar molecules is glucose, a main energy source for your body. Glucose is absorbed directly into your bloodstream after you eat, but it can't enter the cells of most of your tissues without the help of insulin — a hormone secreted by your pancreas. When the glucose level in your blood rises, it signals your pancreas to release insulin. The insulin unlocks your cells so that glucose can enter and provide the fuel your cells need to function properly. Any extra glucose is stored in your liver and muscles in the form of glycogen. This process lowers the amount of glucose in your bloodstream and prevents it from reaching dangerously high levels. As your blood sugar level returns to normal, so does the secretion of insulin from your pancreas. Diabetes drastically lowers insulin's effects on your body. This may be because your pancreas is unable to produce insulin (type 1 diabetes), or it may be because your body is resistant to the effects of insulin or doesn't produce enough insulin to maintain a normal glucose level (type 2 diabetes). As a result, glucose tends to build up in your bloodstream (hyperglycemia) and may reach dangerously high levels if not treated properly. Insulin or other drugs are used to lower blood sugar levels.",
    "Precaution": [
      "get physical",
      "take your medication as directed",
      "follow your diabetes eating plan",
      "check your blood sugar",
      "adjust your insulin doses to contol hyperglycemia"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/hyperglycemia/diagnosis-treatment/drc-20373635"
    ]
  },
  "encephalopathy": {
    "Overview": "Encephalopathy means damage or disease that affects the brain. It happens when there's been a change in the way your brain works or a change in your body that affects your brain. Those changes lead to an altered mental state, leaving you confused and not acting like you usually do. Encephalopathy is not a single disease but a group of disorders with several causes. It's a serious health problem that, without treatment, can cause temporary or permanent brain damage.",
    "Diagnosis": "To diagnose the disorder, your doctor will give you a physical exam and ask you about your medical history, especially any medications you're taking.",
    "Symptoms": [
      "confusion",
      "memory loss",
      "personality changes",
      "trouble thinking clearly",
      " trouble speaking",
      "muscle weakness",
      "eye movements they can't control",
      "tremors",
      "trouble swallowing",
      "sleepiness",
      "seizures"
    ],
    "Causes": "There are two main types of encephalopathy: reversible and irreversible. Reversible causes multiple types of encephalopathy, infections of the brain, brain tremors, long-term exposure to toxins and nonconvulsive status epilepticus. Types of encephalopathy that are irreversible include chronic traumatic encephalopathy and hypoxic-ischemic encephalopathy.",
    "Precaution": [
      "medications to stop seizures",
      "stopping a medication you've been taking",
      "changing the foods you eat",
      "nutritional supplements",
      "dialysis"
    ],
    "Source": [
      "https://www.webmd.com/brain/what-is-encephalopathy#091e9c5e81d09ccc-2-4"
    ]
  },
  "tricuspid valve insufficiency": {
    "Overview": "Tricuspid valve regurgitation is a type of heart valve disease in which the valve between the two right heart chambers (right ventricle and right atrium) doesn't close properly. As a result, blood leaks backward into the upper right chamber (right atrium). A person may be born with tricuspid valve regurgitation (congenital heart disease). Sometimes, tricuspid valve regurgitation results from valve problems caused by other health conditions.",
    "Diagnosis": "Tricuspid valve regurgitation can occur silently. In children, the condition may not be diagnosed until adulthood. Tricuspid valve regurgitation may be discovered when imaging tests of the heart are done for other reasons.",
    "Symptoms": [
      "fatigue",
      "irregular heart rhythms",
      "pulsing in the neck",
      "shortness of breath with activity",
      "swelling in the belly area, legs or neck veins"
    ],
    "Causes": "To understand the causes of tricuspid valve regurgitation, it may be helpful to know how the heart and heart valves typically work. A typical heart has four chambers. The two upper chambers (atria) receive blood. The two lower chambers (ventricles) pump blood. Four valves open and close to keep blood flowing in the correct direction.",
    "Precaution": [
      "eat a heart-healthy diet",
      "exercise",
      "prevent heart infections",
      "prepare for pregnancy",
      "see your health care provider regularly"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/tricuspid-valve-regurgitation/diagnosis-treatment/drc-20350173"
    ]
  },
  "Alzheimer's disease": {
    "Overview": "Alzheimer's disease is a progressive neurologic disorder that causes the brain to shrink (atrophy) and brain cells to die. Alzheimer's disease is the most common cause of dementia — a continuous decline in thinking, behavioral and social skills that affects a person's ability to function independently.",
    "Diagnosis": "An important part of diagnosing Alzheimer's disease includes being able to explain your symptoms, as well as perspective from a close family member or friend about symptoms and their impact on daily life. Additionally, a diagnosis of Alzheimer's disease is based on tests your doctor administers to assess memory and thinking skills.Laboratory and imaging tests can rule out other potential causes or help the doctor better identify the disease causing dementia symptoms. Traditionally, Alzheimer's disease was only diagnosed with complete certainty after death, when examining the brain with a microscope revealed the characteristic plaques and tangles. Clinicians and researchers are now able to diagnose Alzheimer's disease during life with more certainty. Biomarkers can detect the presence of plaques and tangles, such as specific types of PET scans or measuring amyloid and tau proteins in plasma and cerebral spinal fluid.",
    "Symptoms": [
      "memory loss",
      "frequent memory lapses",
      "difficulty concentrating",
      "decline in the ability to make reasonable decisions",
      "depression",
      "apathy",
      "social withdrawal",
      "mood swings",
      "distrust in others",
      "irritability and aggressiveness",
      "changes in sleeping habits",
      "wandering",
      "loss in inhibitions",
      "delusions"
    ],
    "Causes": "The exact causes of Alzheimer's disease aren't fully understood. But at a basic level, brain proteins fail to function normally, which disrupts the work of brain cells (neurons) and triggers a series of toxic events. Neurons are damaged, lose connections to each other and eventually die. Scientists believe that for most people, Alzheimer's disease is caused by a combination of genetic, lifestyle and environmental factors that affect the brain over time. Less than 1% of the time, Alzheimer's is caused by specific genetic changes that virtually guarantee a person will develop the disease. These rare occurrences usually result in disease onset in middle age. The damage most often starts in the region of the brain that controls memory, but the process begins years before the first symptoms. The loss of neurons spreads in a somewhat predictable pattern to other regions of the brains. By the late stage of the disease, the brain has shrunk significantly.",
    "Precaution": [
      "cholinesterase inhibitors",
      "memantine",
      "creating a safe and supportive environment",
      "treatments such as vitamin E, omega-3 fatty acids, curcumin, ginkgo and melatonin"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/alzheimers-disease/diagnosis-treatment/drc-20350453"
    ]
  },
  "candidiasis": {
    "Overview": "Candidiasis is a fungal infection caused by several species of the yeast Candida, especially Candida albicans. Candidiasis is a fungal infection caused by several species of the yeast Candida, especially Candida albicans. The most common type of candidiasis is a superficial infection of the mouth, vagina, or skin that causes white or red patches and itching, irritation, or both. People whose immune system is weakened may have serious infections of the esophagus and other internal organs. A sample of infected material is examined under a microscope and sent for culture. Antifungal drugs may be applied directly to the affected area or taken by mouth, but serious infections require drugs given by vein. Candida is normally present on the skin, in the intestinal tract, and, in women, in the genital area. Usually, Candida in these areas does not cause problems. However, the fungi sometimes cause skin infections, mouth infections (affecting the mucous membranes), or infections of the vagina. Such infections can develop in people with a healthy immune system, but they are more common or persistent in people with diabetes, cancer, or AIDS and in pregnant women. Candidiasis of the mouth and esophagus are common among people with AIDS. Candidiasis is also common among people who are taking antibiotics because the antibiotics kill the bacteria that normally live in the body and compete with Candida, allowing Candida to grow unchecked.",
    "Diagnosis": "Many candidal infections are apparent from the symptoms alone. To confirm the diagnosis, a doctor must identify the fungi in a sample viewed under a microscope. Samples of blood or other infected tissues may be sent to a laboratory to be cultured and examined to identify the fungi. Doctors may do a blood test called the T2Candida® Panel to detect Candida in the blood quickly and accurately. Other tests that detect genetic material in microorganisms may be done, including polymerase chain reaction (PCR). The PCR test is used to produce many copies of a gene from a microorganism, making the microorganism much easier to identify. If candidemia is diagnosed, doctors may examine the eyes to determine whether the eyes are infected.",
    "Symptoms": [
      "creamy, white, painful patches inside the mouth",
      "cracking at the corners of the mouth (cheilitis)",
      "red, painful, smooth tongue"
    ],
    "Causes": "Candida normally lives in the mouth, throat, and the rest of the digestive tract without causing any problems. Sometimes, Candida can multiply and cause an infection if the environment inside the mouth, throat, or esophagus changes in a way that encourages its growth.",
    "Precaution": [
      "maintain good oral health",
      "rinse your mouth or brush your teeth after using inhaled corticosteroids"
    ],
    "Source": [
      "https://www.cdc.gov/fungal/diseases/candidiasis/thrush/index.html",
      "https://www.msdmanuals.com/home/infections/fungal-infections/candidiasis#v787792"
    ]
  },
  "oral candidiasis": {
    "Overview": "Candidiasis in the mouth and throat is also called thrush or oropharyngeal candidiasis. Candidiasis in the esophagus (the tube that connects the throat to the stomach) is called esophageal candidiasis or Candida esophagitis. Esophageal candidiasis is one of the most common infections in people living with HIV/AIDS.",
    "Diagnosis": "Healthcare providers can usually diagnose candidiasis in the mouth or throat simply by looking inside. Sometimes a healthcare provider will take a small sample from the mouth or throat. The sample is sent to a laboratory for testing, usually to be examined under a microscope.Healthcare providers usually diagnose candidiasis in the esophagus by doing an endoscopy. An endoscopy is a procedure to examine the digestive tract using a tube with a light and a camera. A healthcare provider might prescribe antifungal medicine without doing an endoscopy to see if the patient's symptoms get better.",
    "Symptoms": [
      "white patches on the inner cheeks, tongue, roof of the mouth and throat",
      "redness or soreness",
      "cotton-like feeling in the mouth",
      "loss of taste",
      "pain while eating or swallowing",
      "cracking and redness at the corners of the mouth"
    ],
    "Causes": "Candida normally lives in the mouth, throat, and the rest of the digestive tract without causing any problems. Sometimes, Candida can multiply and cause an infection if the environment inside the mouth, throat, or esophagus changes in a way that encourages its growth.",
    "Precaution": [
      "maintain good oral health",
      "rinse your mouth or brush your teeth after using inhaled corticosteroids"
    ],
    "Source": [
      "https://www.cdc.gov/fungal/diseases/candidiasis/thrush/index.html"
    ]
  },
  "neuropathy": {
    "Overview": "Peripheral neuropathy, a result of damage to the nerves located outside of the brain and spinal cord (peripheral nerves), often causes weakness, numbness and pain, usually in the hands and feet. It can also affect other areas and body functions including digestion, urination and circulation.",
    "Diagnosis": "Peripheral neuropathy has many potential causes. Besides a physical exam, which may include blood tests, diagnosis usually requires a full medical history and neurological examination.",
    "Symptoms": [
      "gradual onset of numbness on the legs and arms",
      "sharp, jabbing, throbbing or burning pain",
      "extreme sensitivity to touch",
      "pain during activities",
      "lack of coordination and falling",
      "muscle weakness",
      "feeling as if you're wearing gloves or socks when you're not",
      "paralysis if motor nerves are affected"
    ],
    "Causes": "Peripheral neuropathy is nerve damage caused by a number of different conditions. Health conditions that can cause peripheral neuropathy include autoimmune diseases, diabetes, infections, inherited disorders, tumors, bone marrow disorders or other diseases.",
    "Precaution": [
      "take care of your feet",
      "exercise",
      "quit smoking",
      "eat healthy meals",
      "avoid excessive alcohol",
      "monitor your blood glucose levels"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/peripheral-neuropathy/diagnosis-treatment/drc-20352067"
    ]
  },
  "kidney disease": {
    "Overview": "Kidney disease can affect your body's ability to clean your blood, filter extra water out of your blood, and help control your blood pressure. It can also affect red blood cell production and vitamin D metabolism needed for bone health. You're born with two kidneys. They're on either side of your spine, just above your waist. When your kidneys are damaged, waste products and fluid can build up in your body. That can cause swelling in your ankles, nausea, weakness, poor sleep, and shortness of breath. Without treatment, the damage can get worse and your kidneys may eventually stop working. That's serious, and it can be life-threatening.",
    "Diagnosis": "Your doctor will start by asking questions about your family medical history, which medications you're taking, and if you notice that you're peeing more or less than normal. After that, they'll do a physical exam.",
    "Symptoms": [
      "high blood pressure",
      "nausea and vomiting",
      "loss of appetite",
      "metallic taste in your mouth",
      "fatigue",
      "weakness",
      "trouble thinking",
      "sleep issues",
      "muscle twitches and cramps",
      "swelling in your feet and ankles",
      "itching that won't go away",
      "chest pain",
      "shortness of breath"
    ],
    "Causes": "When your kidneys don't work well for longer than 3 months, doctors call it chronic kidney disease. You may not have any symptoms in the early stages, but that's when it's simpler to treat. Diabetes (types 1 and 2) and high blood pressure are the most common culprits. High blood sugar levels over time can harm your kidneys. And high blood pressure creates wear and tear on your blood vessels, including those that go to your kidneys.",
    "Precaution": [
      "monitoring blood pressure",
      "monitoring blood sugar",
      "not smoking",
      "eating a healthy diet",
      "limting alcohol",
      "staying active",
      "taking prescribed medicine"
    ],
    "Source": [
      "https://www.webmd.com/a-to-z-guides/understanding-kidney-disease-prevention"
    ]
  },
  "fibroid tumor": {
    "Overview": "Uterine fibroids are noncancerous growths of the uterus that often appear during childbearing years. Also called leiomyomas (lie-o-my-O-muhs) or myomas, uterine fibroids aren't associated with an increased risk of uterine cancer and almost never develop into cancer. Fibroids range in size from seedlings, undetectable by the human eye, to bulky masses that can distort and enlarge the uterus. You can have a single fibroid or multiple ones. In extreme cases, multiple fibroids can expand the uterus so much that it reaches the rib cage and can add weight.",
    "Diagnosis": "Uterine fibroids are frequently found incidentally during a routine pelvic exam. Your doctor may feel irregularities in the shape of your uterus, suggesting the presence of fibroids.",
    "Symptoms": [
      "heavy menstrual bleeding",
      "menstrual periods lasting more than a week",
      "pelvic pressure or pain",
      "frequent urination",
      "difficulty emptying the bladder",
      "constipation",
      "backache or leg pains"
    ],
    "Causes": "Doctors believe that uterine fibroids develop from a stem cell in the smooth muscular tissue of the uterus (myometrium). A single cell divides repeatedly, eventually creating a firm, rubbery mass distinct from nearby tissue. The growth patterns of uterine fibroids vary — they may grow slowly or rapidly, or they may remain the same size. Some fibroids go through growth spurts, and some may shrink on their own. Many fibroids that have been present during pregnancy shrink or disappear after pregnancy, as the uterus goes back to its usual size.",
    "Precaution": [
      "watchful waiting",
      "medications",
      "noninvasive procedures such as noninvasive treatment",
      "minimally invasive procedures such as uterine artery embolization",
      "traditional surgical procedures such as abdominal myomectomy",
      "getting an appointment as soon as possible"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/uterine-fibroids/diagnosis-treatment/drc-20354294"
    ]
  },
  "glaucoma": {
    "Overview": "Glaucoma is a group of eye conditions that damage the optic nerve, the health of which is vital for good vision. This damage is often caused by an abnormally high pressure in your eye. Glaucoma is one of the leading causes of blindness for people over the age of 60. It can occur at any age but is more common in older adults.",
    "Diagnosis": "Your doctor will review your medical history and conduct a comprehensive eye examination. He or she may perform several tests, including measuring intraocular pressure, testing for optic nerve damage, check  for areas of vision loss, measuring corneal thickness and inspecting the drainage angle.",
    "Symptoms": [
      "patchy blind spots in your side or central vision",
      "tunnel vision",
      "severe headache",
      "eye pain",
      "nausea and vomting",
      "blurred vision",
      "halos around lights",
      "eye redness"
    ],
    "Causes": "Glaucoma is the result of damage to the optic nerve. As this nerve gradually deteriorates, blind spots develop in your visual field. For reasons that doctors don't fully understand, this nerve damage is usually related to increased pressure in the eye. Elevated eye pressure is due to a buildup of a fluid (aqueous humor) that flows throughout the inside of your eye. This internal fluid normally drains out through a tissue called the trabecular meshwork at the angle where the iris and cornea meet. When fluid is overproduced or the drainage system doesn't work properly, the fluid can't flow out at its normal rate and eye pressure increases. Glaucoma tends to run in families. In some people, scientists have identified genes related to high eye pressure and optic nerve damage.",
    "Precaution": [
      "eat a healthy diet",
      "exercise regularly",
      "limit your caffeine",
      "sip fluids frequently",
      "sleep with your head elevated",
      "take prescribed medicine"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/glaucoma/diagnosis-treatment/drc-20372846"
    ]
  },
  "neoplasm metastasis": {
    "Overview": "Metastatic cancer occurs when cancer cells break off from the original tumor, enter your bloodstream or lymph system and spread to other areas of your body. Most metastatic cancers are manageable, but not curable. Treatment can ease your symptoms, slow cancer growth and improve your quality of life.",
    "Diagnosis": "There is no standard test to check for metastasis. Your healthcare provider will order tests based on the type of cancer you have and the symptoms you've developed.",
    "Symptoms": [
      "severe back pain",
      "difficulty with bowel or bladder control",
      "headache",
      "dizziness",
      "visual problems",
      "speech problems",
      "nausea",
      "difficulty walking or confusion",
      "coughing up blood",
      "chest pain",
      "shortness of breath",
      "pain",
      "loss of appetite",
      "jaundice"
    ],
    "Causes": "Metastatic cancer occurs when cancer cells break off from the original tumor and spread to other parts of the body via bloodstream or lymph vessels.",
    "Precaution": [
      "if detected at an earlier stage, systematic treatments are given in addition to surgery",
      "chemotherapy",
      "hormonal treatments",
      "immunotherapy"
    ],
    "Source": [
      "https://my.clevelandclinic.org/health/diseases/22213-metastasis-metastatic-cancer#prevention"
    ]
  },
  "malignant tumor of colon": {
    "Overview": "Colon cancer is a type of cancer that begins in the large intestine (colon). The colon is the final part of the digestive tract. Colon cancer typically affects older adults, though it can happen at any age. It usually begins as small, noncancerous (benign) clumps of cells called polyps that form on the inside of the colon. Over time some of these polyps can become colon cancers.",
    "Diagnosis": "Doctors recommend certain screening tests for healthy people with no signs or symptoms in order to look for signs of colon cancer or noncancerous colon polyps. Finding colon cancer at its earliest stage provides the greatest chance for a cure. Screening has been shown to reduce your risk of dying of colon cancer.",
    "Symptoms": [
      "persistent change in bowel habits",
      "rectal bleeding",
      "persistent abdominal discomfort",
      "feeling that your bowel doesn't empty completely",
      "weakness or fatigue",
      "unexplained weight loss"
    ],
    "Causes": "Doctors aren't certain what causes most colon cancers. In general, colon cancer begins when healthy cells in the colon develop changes (mutations) in their DNA. A cell's DNA contains a set of instructions that tell a cell what to do. Healthy cells grow and divide in an orderly way to keep your body functioning normally. But when a cell's DNA is damaged and becomes cancerous, cells continue to divide — even when new cells aren't needed. As the cells accumulate, they form a tumor. With time, the cancer cells can grow to invade and destroy normal tissue nearby. And cancerous cells can travel to other parts of the body to form deposits there (metastasis).",
    "Precaution": [
      "surgery for early-stage colon cancer",
      "surgery for more advanced colon cancer",
      "chemotherapy",
      "radiation therapy",
      "targeted drug therapy",
      "immunotherapy",
      "supportive care"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/colon-cancer/diagnosis-treatment/drc-20353674"
    ]
  },
  "carcinoma colon": {
    "Overview": "Colon cancer is a type of cancer that begins in the large intestine (colon). The colon is the final part of the digestive tract. Colon cancer typically affects older adults, though it can happen at any age. It usually begins as small, noncancerous (benign) clumps of cells called polyps that form on the inside of the colon. Over time some of these polyps can become colon cancers.",
    "Diagnosis": "Doctors recommend certain screening tests for healthy people with no signs or symptoms in order to look for signs of colon cancer or noncancerous colon polyps. Finding colon cancer at its earliest stage provides the greatest chance for a cure. Screening has been shown to reduce your risk of dying of colon cancer.",
    "Symptoms": [
      "persistent change in bowel habits",
      "rectal bleeding",
      "persistent abdominal discomfort",
      "feeling that your bowel doesn't empty completely",
      "weakness or fatigue",
      "unexplained weight loss"
    ],
    "Causes": "Doctors aren't certain what causes most colon cancers. In general, colon cancer begins when healthy cells in the colon develop changes (mutations) in their DNA. A cell's DNA contains a set of instructions that tell a cell what to do. Healthy cells grow and divide in an orderly way to keep your body functioning normally. But when a cell's DNA is damaged and becomes cancerous, cells continue to divide — even when new cells aren't needed. As the cells accumulate, they form a tumor. With time, the cancer cells can grow to invade and destroy normal tissue nearby. And cancerous cells can travel to other parts of the body to form deposits there (metastasis).",
    "Precaution": [
      "surgery for early-stage colon cancer",
      "surgery for more advanced colon cancer",
      "chemotherapy",
      "radiation therapy",
      "targeted drug therapy",
      "immunotherapy",
      "supportive care"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/colon-cancer/diagnosis-treatment/drc-20353674"
    ]
  },
  "ketoacidosis diabetic": {
    "Overview": "Diabetic ketoacidosis is a serious complication of diabetes that occurs when your body produces high levels of blood acids called ketones. The condition develops when your body can't produce enough insulin. Insulin normally plays a key role in helping sugar (glucose) — a major source of energy for your muscles and other tissues — enter your cells. Without enough insulin, your body begins to break down fat as fuel. This process produces a buildup of acids in the bloodstream called ketones, eventually leading to diabetic ketoacidosis if untreated.",
    "Diagnosis": "If your doctor suspects diabetic ketoacidosis, he or she will do a physical exam and order blood tests. In some cases, additional tests may be needed to help determine what triggered the diabetic ketoacidosis.",
    "Symptoms": [
      "excessive thirst",
      "frequent urination",
      "nausea and vomting",
      "stomach pain",
      "weakness or fatigue",
      "shortness of breath",
      "fruity-scented breath",
      "confusion"
    ],
    "Causes": "Sugar is a main source of energy for the cells that make up your muscles and other tissues. Normally, insulin helps sugar enter your cells. Without enough insulin, your body can't use sugar properly for energy. This prompts the release of hormones that break down fat as fuel, which produces acids known as ketones. Excess ketones build up in the blood and eventually 'spill over' into the urine.",
    "Precaution": [
      "getting an appointment as soon as possible",
      "fluid replacement",
      "electrolyte replacement",
      "insulin therapy"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/diabetic-ketoacidosis/diagnosis-treatment/drc-20371555"
    ]
  },
  "tonic-clonic epilepsy": {
    "Overview": "Tonic-clonic seizures, previously known as grand mal seizures, are characterized by both stiffness and jerking motions. A generalized tonic-clonic seizure is a disturbance in the functioning of both sides of your brain. A seizure that starts by affecting one side of your brain but spreads to involve both sides is called a focal to bilateral tonic-clonic seizure. This disturbance is caused by an atypical spread of electrical signals through the brain. Often this will result in signals being sent to your muscles, nerves, or glands. The spread of these signals in your brain can make you lose consciousness and have severe muscle contractions.",
    "Diagnosis": "A doctor or other healthcare professional will ask you questions about other seizures or medical conditions you've had. They might ask the people who were with you during the seizure to describe what they saw. They might also ask you to remember what you were doing immediately before the seizure happened. This helps to determine what activity or behavior may have triggered the seizure A doctor or other healthcare professional will perform tests to check your balance, coordination, and reflexes. They'll assess your muscle tone and strength. They'll also judge how you hold and move your body and whether your memory and judgment seem abnormal. A doctor may order blood tests to look for medical problems that could influence the onset of a seizure. Some types of brain scans can help your doctor monitor your brain function. This could include an electroencephalogram (EEG), which shows the patterns of electrical activity in your brain.",
    "Symptoms": [
      "a certain smell",
      "nausea",
      "vertigo",
      "anxiety",
      "muscle stiffness",
      "loss of consciousness",
      "falling",
      "moaning, screaming, or crying out involuntarily",
      "drooling",
      "jerking movements of the arms and legs",
      "facial muscle contractions",
      "loss of bladder or bowel control during or after the seizure"
    ],
    "Causes": "All seizures are caused by unusual electrical activity in the brain. The onset of tonic-clonic seizures could be related to a variety of health conditions. Some of the more severe conditions include a brain tumor or a ruptured blood vessel in your brain, which can cause a stroke.",
    "Precaution": [
      "avoid traumatic brain injury by using motorcycle helmets, safety belts, and cars with airbags",
      "maintain good hygiene",
      "reduce your risk factors for stroke",
      "maintain blood pressure and cholesterol at a normal range",
      "prevent smoking and inactivity"
    ],
    "Source": [
      "https://www.healthline.com/health/generalized-tonic-clonic-seizure#prevention"
    ]
  },
  "tonic-clonic seizures": {
    "Overview": "Tonic-clonic seizures, previously known as grand mal seizures, are characterized by both stiffness and jerking motions. A generalized tonic-clonic seizure is a disturbance in the functioning of both sides of your brain. A seizure that starts by affecting one side of your brain but spreads to involve both sides is called a focal to bilateral tonic-clonic seizure. This disturbance is caused by an atypical spread of electrical signals through the brain. Often this will result in signals being sent to your muscles, nerves, or glands. The spread of these signals in your brain can make you lose consciousness and have severe muscle contractions.",
    "Diagnosis": "A doctor or other healthcare professional will ask you questions about other seizures or medical conditions you've had. They might ask the people who were with you during the seizure to describe what they saw. They might also ask you to remember what you were doing immediately before the seizure happened. This helps to determine what activity or behavior may have triggered the seizure A doctor or other healthcare professional will perform tests to check your balance, coordination, and reflexes. They'll assess your muscle tone and strength. They'll also judge how you hold and move your body and whether your memory and judgment seem abnormal. A doctor may order blood tests to look for medical problems that could influence the onset of a seizure. Some types of brain scans can help your doctor monitor your brain function. This could include an electroencephalogram (EEG), which shows the patterns of electrical activity in your brain.",
    "Symptoms": [
      "a certain smell",
      "nausea",
      "vertigo",
      "anxiety",
      "muscle stiffness",
      "loss of consciousness",
      "falling",
      "moaning, screaming, or crying out involuntarily",
      "drooling",
      "jerking movements of the arms and legs",
      "facial muscle contractions",
      "loss of bladder or bowel control during or after the seizure"
    ],
    "Causes": "All seizures are caused by unusual electrical activity in the brain. The onset of tonic-clonic seizures could be related to a variety of health conditions. Some of the more severe conditions include a brain tumor or a ruptured blood vessel in your brain, which can cause a stroke.",
    "Precaution": [
      "avoid traumatic brain injury by using motorcycle helmets, safety belts, and cars with airbags",
      "maintain good hygiene",
      "reduce your risk factors for stroke",
      "maintain blood pressure and cholesterol at a normal range",
      "prevent smoking and inactivity"
    ],
    "Source": [
      "https://www.healthline.com/health/generalized-tonic-clonic-seizure#prevention"
    ]
  },
  "respiratory failure": {
    "Overview": "Acute respiratory failure occurs when fluid builds up in the air sacs in your lungs. When that happens, your lungs can't release oxygen into your blood. In turn, your organs can't get enough oxygen-rich blood to function. You can also develop acute respiratory failure if your lungs can't remove carbon dioxide from your blood. Respiratory failure happens when the capillaries, or tiny blood vessels, surrounding your air sacs can't properly exchange carbon dioxide for oxygen. The condition can be acute or chronic. With acute respiratory failure, you experience immediate symptoms from not having enough oxygen in your body. In most cases, this failure may lead to death if it's not treated quickly.",
    "Diagnosis": "Acute respiratory failure requires immediate medical attention. You may receive oxygen to help you breathe and to prevent tissue death in your organs and brain.",
    "Symptoms": [
      "rapid breathing",
      "confusion",
      "inability to breathe",
      "bluish coloration in the skin, fingertips, or lips",
      "restlessness",
      "anxiety",
      "sleepiness",
      "loss of consciousness",
      "rapid and shallow breathing",
      "racing heart",
      "irregular heartbeats",
      "profuse sweating"
    ],
    "Causes": "Acute respiratory failure has several different causes obstruction, injury, acute respiratory distress syndrome, drug abuse, chemical inhalation, stroke, infection.",
    "Precaution": [
      "taking pain medications",
      "using portable oxygen tanks",
      "tracheostomy"
    ],
    "Source": [
      "https://www.healthline.com/health/acute-respiratory-failure#treatment"
    ]
  },
  "melanoma": {
    "Overview": "Melanoma, the most serious type of skin cancer, develops in the cells (melanocytes) that produce melanin — the pigment that gives your skin its color. Melanoma can also form in your eyes and, rarely, inside your body, such as in your nose or throat. The exact cause of all melanomas isn't clear, but exposure to ultraviolet (UV) radiation from sunlight or tanning lamps and beds increases your risk of developing melanoma. Limiting your exposure to UV radiation can help reduce your risk of melanoma.",
    "Diagnosis": "Tests and procedures used to diagnose melanoma include physical exams and removing a sample of tissue for testing.",
    "Symptoms": [
      "a change in an existing mole",
      "development of a new pigmented or unusual-looking growth on your skin"
    ],
    "Causes": "Melanoma occurs when something goes wrong in the melanin-producing cells (melanocytes) that give color to your skin. Normally, skin cells develop in a controlled and orderly way — healthy new cells push older cells toward your skin's surface, where they die and eventually fall off. But when some cells develop DNA damage, new cells may begin to grow out of control and can eventually form a mass of cancerous cells. Just what damages DNA in skin cells and how this leads to melanoma isn't clear. It's likely that a combination of factors, including environmental and genetic factors, causes melanoma. Still, doctors believe exposure to ultraviolet (UV) radiation from the sun and from tanning lamps and beds is the leading cause of melanoma. UV light doesn't cause all melanomas, especially those that occur in places on your body that don't receive exposure to sunlight. This indicates that other factors may contribute to your risk of melanoma.",
    "Precaution": [
      "surgery to remove affected lymph nodes",
      "immunotherapy",
      "targeted therapy",
      "radiation therapy",
      "chemotherapy",
      "learn enough about melanoma to make decisions about your care"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/melanoma/diagnosis-treatment/drc-20374888"
    ]
  },
  "gastroenteritis": {
    "Overview": "Viral gastroenteritis is an intestinal infection that includes signs and symptoms such as watery diarrhea, stomach cramps, nausea or vomiting, and sometimes fever. The most common way to develop viral gastroenteritis — often called stomach flu — is through contact with an infected person or by consuming contaminated food or water. If you're otherwise healthy, you'll likely recover without complications. But for infants, older adults and people with compromised immune systems, viral gastroenteritis can be deadly.",
    "Diagnosis": "Your doctor will likely diagnose viral gastroenteritis (stomach flu) based on symptoms, a physical exam and sometimes on the presence of similar cases in your community. A rapid stool test can detect rotavirus or norovirus, but there are no quick tests for other viruses that cause gastroenteritis. In some cases, your doctor may have you submit a stool sample to rule out a possible bacterial or parasitic infection.",
    "Symptoms": [
      "watery, usually nonbloody diarrhea",
      "nausea, vomiting or both",
      "stomach cramps or pain",
      "occasional muscle aches or headache",
      "low-grade fever"
    ],
    "Causes": "You're most likely to get viral gastroenteritis when you eat or drink contaminated food or water. You may also be likely to get gastroenteritis if you share utensils, towels or food with someone who has one of the viruses that cause the condition.",
    "Precaution": [
      "let your stomach settle",
      "try sucking on ice chips or taking small sips of water often",
      "ease back into eating",
      "avoid certain foods and substances until you feel better",
      "get plenty of rest",
      "try anti-diarrhea medications"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/viral-gastroenteritis/diagnosis-treatment/drc-20378852"
    ]
  },
  "malignant neoplasm of lung": {
    "Overview": "A malignant neoplasm, or lung cancer, is much more concerning. It requires immediate attention. Malignant lung neoplasms are characterized by abnormal-looking cells that divide uncontrollably, leading to tumors in the lungs (primary neoplasms) that may spread to other parts of the body (metastatic neoplasm). ",
    "Diagnosis": "If you have ongoing respiratory symptoms (such as a persistent cough, recurrent respiratory infections, wheezing, and shortness of breath) that suggest a lung neoplasm, your healthcare provider may start by taking a detailed medical history. Your healthcare provider will perform a focused physical exam, listening to the heart and lungs for sounds like wheezing and crackling that may be concerning for associated lung-related diseases, like COPD and emphysema, which increase one's chances of malignancy.",
    "Symptoms": [
      "persistent cough",
      "recurrent respiratory infections",
      "wheezing",
      "shortness of breath"
    ],
    "Causes": "Smoking in any form, including traditional cigarettes, hookah, snuff, cigars, and pipe tobacco, is the single biggest risk factor for lung neoplasms. The 60 or so carcinogens, or cancer-causing chemicals, in tobacco smoke account for more than 80%–90% of lung cancer cases. Research shows that smokers are 15–30 times more likely to get lung cancer or die from lung cancer than nonsmokers. Your risk of developing lung cancer increases proportionally with the number of cigarettes you smoke in your lifetime. Smoking isn't the only cause of lung neoplasms. Benign lung neoplasms can develop from an abscess, inflamed tissue, or cysts or as a result of scarring from an infection or pneumonia",
    "Precaution": [
      "chemotherapy",
      "radiation",
      "surgery",
      "immunotherapy",
      "pallative care"
    ],
    "Source": [
      "https://www.verywellhealth.com/lung-neoplasms-definition-types-causes-and-treatment-5204884#toc-treatment-for-a-lung-neoplasm"
    ]
  },
  "carcinoma of lung": {
    "Overview": "Lung cancer is a type of cancer that begins in the lungs. Your lungs are two spongy organs in your chest that take in oxygen when you inhale and release carbon dioxide when you exhale. Lung cancer is the leading cause of cancer deaths worldwide. People who smoke have the greatest risk of lung cancer, though lung cancer can also occur in people who have never smoked. The risk of lung cancer increases with the length of time and number of cigarettes you've smoked. If you quit smoking, even after smoking for many years, you can significantly reduce your chances of developing lung cancer.",
    "Diagnosis": "People with an increased risk of lung cancer may consider annual lung cancer screening using low-dose CT scans. Lung cancer screening is generally offered to older adults who have smoked heavily for many years or who have quit in the past 15 years.",
    "Symptoms": [
      "new cough that doesn't go away",
      "coughing up blood",
      "shortness of breath",
      "chest pain",
      "hoarseness",
      "losing weight without trying",
      "bone pain",
      "headache"
    ],
    "Causes": "Smoking causes the majority of lung cancers — both in smokers and in people exposed to secondhand smoke. But lung cancer also occurs in people who never smoked and in those who never had prolonged exposure to secondhand smoke. In these cases, there may be no clear cause of lung cancer.",
    "Precaution": [
      "try to relax",
      "find a comfortable position",
      "focus on your breath",
      "save your energy for what's important"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/lung-cancer/diagnosis-treatment/drc-20374627"
    ]
  },
  "manic disorder": {
    "Overview": "Bipolar disorder, formerly called manic depression, is a mental health condition that causes extreme mood swings that include emotional highs (mania or hypomania) and lows (depression). When you become depressed, you may feel sad or hopeless and lose interest or pleasure in most activities. When your mood shifts to mania or hypomania (less extreme than mania), you may feel euphoric, full of energy or unusually irritable. These mood swings can affect sleep, energy, activity, judgment, behavior and the ability to think clearly. Episodes of mood swings may occur rarely or multiple times a year. While most people will experience some emotional symptoms between episodes, some may not experience any. Although bipolar disorder is a lifelong condition, you can manage your mood swings and other symptoms by following a treatment plan. In most cases, bipolar disorder is treated with medications and psychological counseling (psychotherapy).",
    "Diagnosis": "To determine if you have bipolar disorder, your evaluation may include physical exams, psychiatric assessment, mood charting and criteria for bipolar disorder.",
    "Symptoms": [
      "abnormally jumpy",
      "increased activity",
      "exaggerated sense of well-being",
      "decreased need for sleep",
      "unusual talkativeness",
      "racing thoughts",
      "distractability",
      "poor decision-making",
      "depressed mood",
      "loss of interest",
      "weight loss",
      "insomnia",
      "restlessness",
      "fatigue",
      "feelings of worthlessness",
      "decreased ability to think",
      "attempting suicide"
    ],
    "Causes": "The exact cause of bipolar disorder is unknown, but several factors may be involved, such as biological differences and genetics.",
    "Precaution": [
      "medications",
      "day treatment programs",
      "psychotherapy",
      "continued treatment",
      "substance abuse treatment",
      "hospitalization"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/bipolar-disorder/symptoms-causes/syc-20355955"
    ]
  },
  "personality disorder": {
    "Overview": "Personality disorders are a group of mental health conditions that are characterized by inflexible and atypical patterns of thinking, feeling, and behaving. These inner experiences and behaviors often differ from the expectations of the culture in which someone lives. If you have a personality disorder, you may have a difficult time relating to others and dealing with everyday problems in the ways that are expected by your cultural group. You may not be fully aware of this discrepancy between your thoughts and behaviors and those accepted by society. You may have a view of the world that's quite different than that of others. As a result, you could find it difficult to participate in social, educational, and family activities. These behaviors and attitudes often cause problems and limitations in relationships, social encounters, and work or school settings. They may also make people you feel isolated, which can contribute to depression and anxiety.",
    "Diagnosis": "The Diagnostic and Statistical Manual of Mental Disorders, Fifth Edition (DSM-5), is a reference that doctors and mental health professionals use to help diagnose mental health conditions. Each personality disorder has criteria that must be met for a diagnosis. A primary care doctor or mental health professional will ask you questions based on these criteria to determine the type of personality disorder. In order for a diagnosis to be made, the behaviors and feelings must be consistent across many life circumstances. In some cases, your primary care doctor or mental health professional may perform blood tests to determine whether a medical problem is causing your symptoms. In some cases, they may order a screening test for alcohol or drugs if they think substances are causing your symptoms.",
    "Symptoms": [
      "fear",
      "anxiety",
      "pattern of unstable relationships",
      "rapid changes in self-identity",
      "stress-related paranoia",
      "impulsive and risky behavior",
      "suicidal threats",
      "mood swings",
      "feelings of emptiness",
      "inappropriate anger"
    ],
    "Causes": "The cause of personality disorders isn't known. However, it's believed that they may be triggered by genetic and environmental influences, most prominently childhood trauma. Personality disorders tend to emerge in the teenage years or early adulthood. The symptoms vary depending on the specific type of personality disorder. For all of them, treatment typically includes talk therapy and medication.",
    "Precaution": [
      "psychotherapy",
      "medication"
    ],
    "Source": [
      "https://www.healthline.com/health/personality-disorders#coping-and-support",
      "https://www.mayoclinic.org/diseases-conditions/borderline-personality-disorder/symptoms-causes/syc-20370237"
    ]
  },
  "primary carcinoma of the liver cells": {
    "Overview": "Your liver helps clean your blood, digest food, and store sugar that your body uses for energy. Typically, its cells chug along doing their job until they wear out or get damaged. Then they die and new ones take their place. It's all very orderly. But when you have primary liver cancer, those cells grow at a pace that's out of control. Cancer cells start to take over and make it hard for your normal cells to do their job. Primary means the cancer starts in your liver. If it starts somewhere else and spreads to your liver, it's called secondary liver cancer, and it's treated differently.",
    "Diagnosis": "Typically, your doctor starts with a physical exam to check for lumps or anything else that seems unusual. You'll also talk about your health history.",
    "Symptoms": [
      "fever",
      "feeling like you might throw up",
      "no desire to eat",
      "weakness or feeling more tired than usual",
      "hard lump on the right side of the belly",
      "pain on the upper right side of the belly",
      "swelling on your belly",
      "weight loss for no reason",
      "white, chalky stool or dark urine",
      "yellowish eyes and skin"
    ],
    "Causes": "If you're very overweight or drink heavily for many years, you're more likely to get cirrhosis, which can make you more likely to get liver cancer. Also, if you've eaten foods with aflatoxins, you have a higher chance of getting this cancer. Aflatoxins are poisons made by a fungus that grows on some crops, such as corn and peanuts, when they aren't stored the right way.",
    "Precaution": [
      "surgery",
      "tumor ablation",
      "embolization therapy",
      "radiation therapy",
      "targeted drug therapy",
      "chemotherapy"
    ],
    "Source": [
      "https://www.webmd.com/cancer/primary-liver-cancer#091e9c5e815a7431-3-6"
    ]
  },
  "emphysema pulmonary": {
    "Overview": "Emphysema is a lung condition that causes shortness of breath. In people with emphysema, the air sacs in the lungs (alveoli) are damaged. Over time, the inner walls of the air sacs weaken and rupture — creating larger air spaces instead of many small ones. This reduces the surface area of the lungs and, in turn, the amount of oxygen that reaches your bloodstream.",
    "Diagnosis": "To determine if you have emphysema, your doctor will ask about your medical history and do a physical exam. Your doctor may recommend a variety of tests.",
    "Symptoms": [
      "shortness of breath",
      "lips or fingernails turn blue or gray with exertion",
      "not mentally alert"
    ],
    "Causes": "The main cause of emphysema is long-term exposure to airborne irritants, including tobacco smoke, air pollution, marijuana smoke and chemical fumes/dust.",
    "Precaution": [
      "stop smoking",
      "avoid other respiratory irritants",
      "exercise regularly",
      "protect yourself from cold air",
      "get recommended vaccinations",
      "prevent respiratory infections"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/emphysema/diagnosis-treatment/drc-20355561"
    ]
  },
  "hemorrhoids": {
    "Overview": "Hemorrhoids (HEM-uh-roids), also called piles, are swollen veins in your anus and lower rectum, similar to varicose veins. Hemorrhoids can develop inside the rectum (internal hemorrhoids) or under the skin around the anus (external hemorrhoids). Nearly three out of four adults will have hemorrhoids from time to time. Hemorrhoids have a number of causes, but often the cause is unknown.",
    "Diagnosis": "Your doctor might be able to see external hemorrhoids. Diagnosing internal hemorrhoids might include examination of your anal canal and rectum.",
    "Symptoms": [
      "itching or irritation in your anal region",
      "pain or discomfort",
      "swelling around your anus",
      "bleeding",
      "painless bleeding",
      "severe pain",
      "swelling",
      "inflammation",
      "a hard lump near your anus"
    ],
    "Causes": "The veins around your anus tend to stretch under pressure and may bulge or swell. Hemorrhoids can develop from increased pressure in the lower rectum due to straining during bowel movements, sitting for long periods of time on the toilet, having chronic diarrhea, being obese, being pregnant, having anal intercourse, eating a low-fiber diet and regular heavy lifting.",
    "Precaution": [
      "eat high-fiber foods",
      "use topical treatments",
      "soak regularly in a warm bath",
      "take oral pain relievers"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/hemorrhoids/diagnosis-treatment/drc-20360280"
    ]
  },
  "spasm bronchial": {
    "Overview": "When you breathe, air travels through your throat and trachea, which is also known as your windpipe. Then it travels into and out of your bronchial tubes. These tubes extend into your lungs and branch into smaller air passages. Normally, the muscles surrounding your bronchial tubes are thin and smooth, and they allow air to flow easily. If you have a respiratory problem, such as asthma, these muscles can contract and narrow your airway. When that happens, it's called a bronchial spasm, or a bronchospasm. During a bronchial spasm, breathing becomes more difficult. You may find yourself wheezing as you try to catch your breath.",
    "Diagnosis": "If you're experiencing bronchial spasms, your doctor will probably ask you about your current symptoms and medical history. They will listen to your chest with a stethoscope for signs of wheezing or other symptoms. They may also conduct other tests to learn what's causing your bronchial spasms. For example, your doctor may order a chest X-ray or other imaging tests. This can help them assess your lung health and check for signs of infection or structural abnormalities. They may conduct a spirometry test. This measures how much air you can inhale and exhale. It also measures how fast you can empty your lungs. All of these actions can be severely limited if your bronchial tubes are inflamed and narrowed. If they suspect you have allergic asthma, your doctor may refer you to an allergist for allergy testing. This can help them identify any allergens that might trigger your symptoms. If they suspect you have acute bronchitis, your doctor may collect a sample of your mucus to send to a laboratory for testing. This can help them learn if your symptoms are caused by a bacterial, viral, or fungal infection.",
    "Symptoms": [
      "tightness in the chest area",
      "wheezing",
      "coughing a lot"
    ],
    "Causes": "Bronchial spasms occur when your bronchial tubes become inflamed. This inflammation may be caused by asthma, bronchitis, emphysema, or other serious respiratory problems.",
    "Precaution": [
      "prescribed inhaler",
      "prescribed inhaled steroids",
      "antibiotics"
    ],
    "Source": [
      "https://www.healthline.com/health/bronchial-spasms#treatment"
    ]
  },
  "aphasia": {
    "Overview": "Aphasia is a condition that affects your ability to communicate. It can affect your speech, as well as the way you write and understand both spoken and written language. Aphasia typically occurs suddenly after a stroke or a head injury. But it can also come on gradually from a slow-growing brain tumor or a disease that causes progressive, permanent damage (degenerative). The severity of aphasia depends on a number of conditions, including the cause and the extent of the brain damage.",
    "Diagnosis": "Your doctor will likely give you a physical and a neurological exam, test your strength, feeling and reflexes, and listen to your heart and the vessels in your neck. He or she will likely request an imaging test, usually an MRI, to quickly identify what's causing the aphasia.",
    "Symptoms": [
      "speak in short or incomplete sentences",
      "speak in sentences that don't make sense",
      "substitute one word for another or one sound for another",
      "speak unrecognizable words",
      "not understand other people's conversation",
      "write sentences that don't make sense"
    ],
    "Causes": "The most common cause of aphasia is brain damage resulting from a stroke — the blockage or rupture of a blood vessel in the brain. Loss of blood to the brain leads to brain cell death or damage in areas that control language. Brain damage caused by a severe head injury, a tumor, an infection or a degenerative process also can cause aphasia. In these cases, the aphasia usually occurs with other types of cognitive problems, such as memory problems or confusion. Primary progressive aphasia is the term used for language difficulty that develops gradually. This is due to the gradual degeneration of brain cells located in the language networks. Sometimes this type of aphasia will progress to a more generalized dementia. Sometimes temporary episodes of aphasia can occur. These can be due to migraines, seizures or a transient ischemic attack (TIA). A TIA occurs when blood flow is temporarily blocked to an area of the brain. People who've had a TIA are at an increased risk of having a stroke in the near future.",
    "Precaution": [
      "speech and language rehabilitation",
      "medications",
      "treatments such as brain stimulation"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/aphasia/diagnosis-treatment/drc-20369523"
    ]
  },
  "obesity morbid": {
    "Overview": "Morbid obesity is a condition in which you have a body mass index (BMI) higher than 35. BMI is used to estimate body fat and can help determine if you are at a healthy body weight for your size. BMI is not a perfect measurement but it does help give a general idea of ideal weight ranges for height.",
    "Diagnosis": "Your doctor will perform a physical exam and ask you about the history of your weight and your weight-loss efforts. They will ask you about your eating and exercise habits, and your medical history.",
    "Symptoms": [
      "sweating",
      "tiredness",
      "joint and back pain",
      "difficulty breathing",
      "sleep problems",
      "difficulty with physical activity",
      "low confidence and feelings of isolation",
      "high blood pressure"
    ],
    "Causes": "When you eat, your body uses the calories you consume to run your body. Even at rest, the body needs calories to pump your heart or digest food. If those calories are not used, the body stores them as fat. Your body will build up fat stores if you continue to eat more calories than your body can use during daily activities and exercise. Obesity and morbid obesity are the result of too much fat being stored in your body. Certain medications, such as antidepressants, can cause weight gain. Medical conditions such as hypothyroidism can also lead to weight gain, but can usually be managed so that they do not lead to obesity.",
    "Precaution": [
      "adding more fruits and vegetables to your diet",
      "eating smaller meals",
      "count calories",
      "eating mindfully",
      "limiting saturated fats, trans fats, and refined sugars",
      "regular exercise"
    ],
    "Source": [
      "https://www.healthline.com/health/weight-loss/obesity#prevention",
      "https://www.medicalnewstoday.com/articles/320460#symptoms"
    ]
  },
  "pyelonephritis": {
    "Overview": "Kidney infection (pyelonephritis) is a type of urinary tract infection (UTI) that generally begins in your urethra or bladder and travels to one or both of your kidneys. A kidney infection requires prompt medical attention. If not treated properly, a kidney infection can permanently damage your kidneys or the bacteria can spread to your bloodstream and cause a life-threatening infection.",
    "Diagnosis": "To confirm that you have a kidney infection, you'll likely be asked to provide a urine sample to test for bacteria, blood or pus in your urine. Your doctor might also take a blood sample for a culture — a lab test that checks for bacteria or other organisms in your blood. Other tests might include an ultrasound, CT scan or a type of X-ray called a voiding cystourethrogram. A voiding cystourethrogram involves injecting a contrast dye to take X-rays of the bladder when full and while urinating.",
    "Symptoms": [
      "fever",
      "chills",
      "back, side or groin pain",
      "abdominal pain",
      "frequent urination",
      "strong, persistent urge to urinate",
      "burning sensation or pain when urinating",
      "nausea and vomiting",
      "pus or blood in your urine",
      "urine that smells bad or is cloudy"
    ],
    "Causes": "Bacteria that enter your urinary tract through the tube that carries urine from your body (urethra) can multiply and travel to your kidneys. This is the most common cause of kidney infections. Bacteria from an infection elsewhere in your body also can spread through your bloodstream to your kidneys. Although it's unusual to develop a kidney infection, it can happen — for instance, if you have an artificial joint or heart valve that becomes infected. Rarely, kidney infection results after kidney surgery.",
    "Precaution": [
      "apply heat on the abdomen",
      "use pain medicine",
      "stay hydrated"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/kidney-infection/diagnosis-treatment/drc-20353393"
    ]
  },
  "endocarditis": {
    "Overview": "Endocarditis is a life-threatening inflammation of the inner lining of your heart's chambers and valves (endocardium). Endocarditis is usually caused by an infection. Bacteria, fungi or other germs from another part of your body, such as your mouth, spread through your bloodstream and attach to damaged areas in your heart. If it's not treated quickly, endocarditis can damage or destroy your heart valves. Treatments for endocarditis include medications and, sometimes, surgery.",
    "Diagnosis": "Your doctor will consider your medical history, your signs and symptoms, and your test results when making a diagnosis of endocarditis. The diagnosis is usually based on several factors instead of a single positive test result or symptom.",
    "Symptoms": [
      "aching joints",
      "chest pain when breathing",
      "fatigue",
      "flu-like symptoms",
      "night sweats",
      "shortness of breath",
      "swelling in your feet, legs or abdomen",
      "new or changed heart murmur",
      "unexplained weight loss",
      "blood in your urine",
      "tenderness in your spleen",
      "red spots on the soles of your feet",
      "red, tender spots under the skin of your fingers or toes",
      "tiny purple or red sports on the skin"
    ],
    "Causes": "Endocarditis occurs when germs, usually bacteria, enter your bloodstream, travel to your heart, and attach to abnormal heart valves or damaged heart tissue. Fungi or other germs also may cause endocarditis. Usually, your immune system destroys any harmful bacteria that enter your bloodstream. However, bacteria that live in your mouth, throat or other parts of your body, such as your skin or your gut, can sometimes cause endocarditis under the right circumstances.",
    "Precaution": [
      "medications",
      "surgery",
      "having an appointment to your doctor as soon as possible"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/endocarditis/diagnosis-treatment/drc-20352582"
    ]
  },
  "effusion pericardial": {
    "Overview": "Pericardial effusion (per-e-KAHR-dee-ul uh-FU-zhun) is the buildup of too much fluid in the double-layered, saclike structure around the heart (pericardium). The space between these layers typically contains a thin layer of fluid. But if the pericardium is diseased or injured, the resulting inflammation can lead to excess fluid. Fluid can also build up around the heart without inflammation, such as from bleeding, related to a cancer or after chest trauma.",
    "Diagnosis": "To diagnose pericardial effusion, the health care provider will typically perform a physical exam and ask questions about your symptoms and medical history. He or she will likely listen to your heart with a stethoscope. If your health care provider thinks you have pericardial effusion, tests can help identify a cause.",
    "Symptoms": [
      "shortness of breath",
      "discomfort when breathing while lying down",
      "chest pain",
      "chest fullness",
      "lightheadedness",
      "swelling in the abdomen or legs"
    ],
    "Causes": "Pericardial effusion can result from inflammation of the pericardium (pericarditis) after an illness or injury. In some settings, large effusions may be caused by certain cancers. A blockage of pericardial fluids or a collection of blood within the pericardium also can lead to this condition. Sometimes the cause can't be determined (idiopathic pericarditis).",
    "Precaution": [
      "medications",
      "surgery",
      "fluid drainage",
      "open-heart surgery",
      "removal of the pericardium"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/pericardial-effusion/diagnosis-treatment/drc-20353724"
    ]
  },
  "pericardial effusion body substance": {
    "Overview": "A pericardial effusion is excess fluid between the heart and the sac surrounding the heart, known as the pericardium. Most are not harmful, but they sometimes can make the heart work poorly. The pericardium is a tough and layered sac. When your heart beats, it slides easily within it. Normally, 2 to 3 tablespoons of clear, yellow pericardial fluid are between the sac's two layers. That fluid helps your heart move easier within the sac. If you have a pericardial effusion, much more fluid sits there. Small ones may contain 100 milliliters of fluid. Very large ones may have more than 2 liters.",
    "Diagnosis": "Because these often cause no symptoms, they're frequently discovered after the results of routine tests are abnormal. These tests can include physical examination, electrocardiogram, and chest x-ray film.",
    "Symptoms": [
      "fever",
      "fatigue",
      "muscle aches",
      "shortness of breath",
      "nausea, vomiting, diarrhea"
    ],
    "Causes": "In most cases, inflammation of the sac, a condition called pericarditis, leads to the effusion. As it becomes inflamed, more fluid is produced. Viral infections are one of the main causes of the inflammation and the effusions it leads to.",
    "Precaution": [
      "nonsteroidal anti-inflammatory drugs",
      "corticosteroids",
      "colchicine",
      "pericardiocentesis",
      "pericardiectomy"
    ],
    "Source": [
      "https://www.webmd.com/heart-disease/guide/pericardial-effusion#091e9c5e80010ded-2-7"
    ]
  },
  "chronic alcoholic intoxication": {
    "Overview": "Alcohol (ethanol) is a central nervous system depressant. Large amounts consumed rapidly can cause respiratory depression, coma, and death. Large amounts chronically consumed damage the liver and many other organs. Alcohol withdrawal manifests as a continuum, ranging from tremor to seizures, hallucinations, and life-threatening autonomic instability in severe withdrawal (delirium tremens). Diagnosis is clinical.",
    "Diagnosis": "In acute intoxication, laboratory tests, except for fingerstick glucose to rule out hypoglycemia and tests to determine BAC, are generally not helpful; diagnosis is usually made clinically. Confirmation by breath or blood alcohol levels is useful for legal purposes (eg, to document intoxication in drivers or employees who appear impaired). However, finding a low BAC in patients who have altered mental status and smell of alcohol is helpful because it expedites the search for an alternate cause. Clinicians should not assume that a high BAC in patients with apparently minor trauma accounts for their obtundation, which may be due to intracranial injury or other abnormalities. Such patients should also have toxicology tests to search for evidence of toxicity due to other substances. Chronic alcohol abuse and dependence are clinical diagnoses; experimental markers of long-term use have not proved sufficiently sensitive or specific for general use. Screening tests such as AUDIT (Alcohol Use Disorders Identification Test) or the CAGE questionnaire can be used. However, heavy alcohol users may have a number of metabolic derangements that are worth screening for, so complete blood count, electrolytes (including magnesium), liver tests (including coagulation profile [PT/PTT]), and serum albumin are often recommended. In severe withdrawal and toxicity, symptoms may resemble those of central nervous system injury or infection, so medical evaluation with CT and lumbar puncture may be needed. Patients with mild symptoms do not require routine testing unless improvement is not marked within 2 to 3 days. A clinical assessment tool for severity of alcohol withdrawal is available.",
    "Symptoms": [
      "toxicity or overdose",
      "chronic effects",
      "mild alcohol withdrawal syndrome",
      "alcoholic hallucinosis",
      "delirium tremens"
    ],
    "Causes": "One serving of alcohol (one 12-oz can of beer, one 6-oz glass of wine, or 1.5 oz of distilled liquor) contains 10 to 15 g of ethanol. Alcohol is absorbed into the blood mainly from the small bowel, although some is absorbed from the stomach. Alcohol accumulates in blood because absorption is more rapid than oxidation and elimination. The concentration peaks about 30 to 90 minutes after ingestion if the stomach was previously empty. About 5 to 10% of ingested alcohol is excreted unchanged in urine, sweat, and expired air; the remainder is metabolized mainly by the liver, where alcohol dehydrogenase converts ethanol to acetaldehyde. Acetaldehyde is ultimately oxidized to CO2 and water at a rate of 5 to 10 mL/hour (of absolute alcohol); each milliliter yields about 7 kcal. Alcohol dehydrogenase in the gastric mucosa accounts for some metabolism; much less gastric metabolism occurs in women. Alcohol exerts its effects by several mechanisms. Alcohol binds directly to gamma-aminobutyric acid (GABA) receptors in the central nervous system, causing sedation. Alcohol also directly affects cardiac, hepatic, and thyroid tissue.",
    "Precaution": [
      "supportive measures",
      "benzodiazepines",
      "airway protection when overdosed",
      "IV fluids with thiamin, magnesium, and vitamins"
    ],
    "Source": [
      "https://www.msdmanuals.com/professional/special-subjects/recreational-drugs-and-intoxicants/alcohol-toxicity-and-withdrawal#v1026675"
    ]
  },
  "pneumothorax": {
    "Overview": "A pneumothorax (noo-moe-THOR-aks) is a collapsed lung. A pneumothorax occurs when air leaks into the space between your lung and chest wall. This air pushes on the outside of your lung and makes it collapse. A pneumothorax can be a complete lung collapse or a collapse of only a portion of the lung.",
    "Diagnosis": "A pneumothorax is generally diagnosed using a chest X-ray. In some cases, a computerized tomography (CT) scan may be needed to provide more-detailed images. Ultrasound imaging also may be used to identify a pneumothorax.",
    "Symptoms": [
      "sudden chest pain",
      "shortness of breath"
    ],
    "Causes": "A pneumothorax can be caused by chest injury, lung disease, ruptured air blisters and mechanical ventilation.",
    "Precaution": [
      "observation",
      "needle aspiration or chest tube insertion",
      "nonsurgical repairs",
      "surgery",
      "ongoing care"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/pneumothorax/diagnosis-treatment/drc-20350372"
    ]
  },
  "delirium": {
    "Overview": "Delirium is a serious disturbance in mental abilities that results in confused thinking and reduced awareness of the environment. The start of delirium is usually rapid — within hours or a few days. Delirium can often be traced to one or more contributing factors, such as a severe or chronic illness, changes in metabolic balance (such as low sodium), medication, infection, surgery, or alcohol or drug intoxication or withdrawal.",
    "Diagnosis": "A doctor can diagnose delirium on the basis of medical history, tests to assess mental status and the identification of possible contributing factors. An examination may include mental status assessment, physical and neurological exams, and other tests.",
    "Symptoms": [
      "inability to stay focused",
      "getting stuck in an idea",
      "being easily distracted",
      "being withdrawn",
      "poor memory",
      "disorientation",
      "difficulty speaking",
      "rambling",
      "trouble understanding speech",
      "difficulty reading",
      "hallucinations",
      "restlessness",
      "calling out",
      "being quiet and withdrawn",
      "slowed movement",
      "disturbed sleep habits",
      "reversal of night-day sleep-wake cycle",
      "anxiety",
      "depression",
      "irritability or anger",
      "a sense of feeling elated",
      "apathy",
      "rapid and unpredictable mood shifts",
      "personality changes"
    ],
    "Causes": "Delirium occurs when the normal sending and receiving of signals in the brain become impaired. This impairment is most likely caused by a combination of factors that make the brain vulnerable and trigger a malfunction in brain activity. Delirium may have a single cause or more than one cause, such as a combination of a medical condition and drug toxicity. Sometimes no cause can be identified.",
    "Precaution": [
      "supportive care",
      "medications",
      "promoting good sleep habits",
      "promote calmness and orientation",
      "prevent complicating problems"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/delirium/diagnosis-treatment/drc-20371391"
    ]
  },
  "neutropenia": {
    "Overview": "Neutropenia is a condition that means that you have lower-than-normal levels of neutrophils, a type of white blood cell, in your blood. This might happen due to an infection, but can result from cancer treatment. Avoiding infection is very important.",
    "Diagnosis": "The most common test is a simple blood test known as a complete blood count. In some cases, such as when a certain disease is suspected, the doctor might want to test your bone marrow.",
    "Symptoms": [
      "fever",
      "sores",
      "swelling",
      "repeated infections"
    ],
    "Causes": "Neutropenia happens for one of these reasons: the neutrophils are used up or destroyed faster than they are produced, or the bone marrow does not make enough neutrophils in the first place. ",
    "Precaution": [
      "wash your hands frequently",
      "getting a flu shot",
      "staying away from crowds",
      "do not share personal items",
      "having a healthy diet",
      "cooking foods in the proper temperature",
      "use gloves when picking up waste",
      "proper hygiene",
      "avoid becoming constipated"
    ],
    "Source": [
      "https://my.clevelandclinic.org/health/diseases/21058-neutropenia#management-and-treatment"
    ]
  },
  "hyperbilirubinemia": {
    "Overview": "Hyperbilirubinemia is a condition in which there is a build up of bilirubin in the blood, causing yellow discoloration of the eyes and skin, called jaundice. Low levels of bilirubin in the newborn is common and does not cause any trouble and will resolve on its own in the first week of life. However some conditions like prematurity, infection or certain blood disorders can lead to a rapid accumulation of bilirubin to a toxic level.",
    "Diagnosis": "The timing of the appearance of jaundice helps with the diagnosis. Jaundice appearing in the first 12-24 hours can be serious and may require early treatment. When jaundice appears on the second or third day, it is usually 'physiologic' or related to dehydration. The physician will usually rely on a bilirubin tool or graph to decide when the level of bilirubin becomes dangerous as infants who are a few days old can tolerate higher levels of bilirubin compared to an infant who is less than 48 hours old. When jaundice appears toward the end of the first week, it may be due to an infection. Later appearance of jaundice in the second week, is often related to breast milk feedings, but may have other causes.",
    "Symptoms": [
      "yellow discolorationg of the baby's eyes, mucosa and skin",
      "poor feeding or lethargy"
    ],
    "Causes": "Bilirubin is a natural byproduct produced when red blood cells breakdown. The adult liver converts unconjugated bilirubin into a conjugated form, that be excreted. During pregnancy, the placenta excretes bilirubin but when the baby is born, the baby's immature liver must assume that role",
    "Precaution": [
      "phototherapy",
      "exchange transfusion",
      "adequate hydration with breastfeeding or pumped breast milk",
      "treating any underlying cause of hyperbilirubinemia"
    ],
    "Source": [
      "https://www.chop.edu/conditions-diseases/hyperbilirubinemia-and-jaundice#:~:text=Hyperbilirubinemia%20is%20a%20condition%20in,the%20first%20week%20of%20life."
    ]
  },
  "influenza": {
    "Overview": "Influenza is a viral infection that attacks your respiratory system — your nose, throat and lungs. Influenza is commonly called the flu, but it's not the same as stomach 'flu' viruses that cause diarrhea and vomiting.",
    "Diagnosis": "Your doctor will conduct a physical exam, look for signs and symptoms of influenza, and possibly order a test that detects influenza viruses. In some cases, your doctor may suggest that you be tested for influenza. He or she may use various tests to diagnose influenza. Polymerase chain reaction (PCR) testing is becoming more common in many hospitals and labs. This test may be done while you're in your doctor's office or in the hospital. PCR testing is more sensitive than other tests and may be able to identify the influenza strain. It's possible to have a test to diagnose both influenza and COVID-19. You may have both COVID-19 and influenza at the same time.During times when influenza is widespread, you may not need to be tested for influenza. Your doctor may diagnose you based on your signs and symptoms.",
    "Symptoms": [
      "fever",
      "aching muscles",
      "chills and sweats",
      "headache",
      "dry, persistent cough",
      "shortness of breath",
      "tiredness and weakness",
      "runny or stuffy nose",
      "sore throat",
      "eye pain",
      "vomiting and diarrhea"
    ],
    "Causes": "Influenza viruses travel through the air in droplets when someone with the infection coughs, sneezes or talks. You can inhale the droplets directly, or you can pick up the germs from an object — such as a telephone or computer keyboard — and then transfer them to your eyes, nose or mouth. People with the virus are likely contagious from about a day before symptoms appear until about five days after they start. Children and people with weakened immune systems may be contagious for a slightly longer time. Influenza viruses are constantly changing, with new strains appearing regularly. If you've had influenza in the past, your body has already made antibodies to fight that specific strain of the virus. If future influenza viruses are similar to those you've encountered before, either by having the disease or by getting vaccinated, those antibodies may prevent infection or lessen its severity. But antibody levels may decline over time. Also, antibodies against influenza viruses you've encountered in the past may not protect you from new influenza strains that can be very different viruses from what you had before.",
    "Precaution": [
      "drink plenty of fluids",
      "rest",
      "consider pain relievers"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/flu/diagnosis-treatment/drc-20351725"
    ]
  },
  "dependence": {
    "Overview": "Drug addiction, also called substance use disorder, is a disease that affects a person's brain and behavior and leads to an inability to control the use of a legal or illegal drug or medication. Substances such as alcohol, marijuana and nicotine also are considered drugs. When you're addicted, you may continue using the drug despite the harm it causes. Drug addiction can start with experimental use of a recreational drug in social situations, and, for some people, the drug use becomes more frequent. For others, particularly with opioids, drug addiction begins with exposure to prescribed medications, or receiving medications from a friend or relative who has been prescribed the medication. The risk of addiction and how fast you become addicted varies by drug. Some drugs, such as opioid painkillers, have a higher risk and cause addiction more quickly than others. As time passes, you may need larger doses of the drug to get high. Soon you may need the drug just to feel good. As your drug use increases, you may find that it's increasingly difficult to go without the drug. Attempts to stop drug use may cause intense cravings and make you feel physically ill (withdrawal symptoms).",
    "Diagnosis": "Diagnosing drug addiction (substance use disorder) requires a thorough evaluation and often includes an assessment by a psychiatrist, a psychologist, or a licensed alcohol and drug counselor. Blood, urine or other lab tests are used to assess drug use, but they're not a diagnostic test for addiction. However, these tests may be used for monitoring treatment and recovery. For diagnosis of a substance use disorder, most mental health professionals use criteria in the Diagnostic and Statistical Manual of Mental Disorders (DSM-5), published by the American Psychiatric Association.",
    "Symptoms": [
      "feeling that you have to use the drug regularly",
      "having intense urges for the drug that block out any other thoughts",
      "needing more of the drugh to get the same effect",
      "taking larger amounts of the drug",
      "making certain that you maintain supply of the drug",
      "spending money on the drug, even though you can't afford it",
      "not meeting obligations or work responsibilities",
      "continuing to use the drug, even though you know it's causing problems in your life",
      "doing things to get the durg that you normally won't do",
      "failing in your attempts to stop using the drug",
      "experiencing withdrawal symptoms when you attempt to stop taking the drug"
    ],
    "Causes": "Like many mental health disorders, several factors may contribute to development of drug addiction. The main factors are environment and genetics.",
    "Precaution": [
      "chemical dependence treatment programs",
      "detoxification",
      "oploid overdose",
      "behavior therapy",
      "self-help groups"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/drug-addiction/diagnosis-treatment/drc-20365113"
    ]
  },
  "thrombus": {
    "Overview": "Thrombosis is a serious condition where one or more clots form inside of your blood vessels. When this happens, the clot can block blood flow where it formed, or it can break loose and move to somewhere else in your body. If a moving clot gets stuck in a critical area, this can cause deadly conditions like stroke and heart attack.",
    "Diagnosis": "A diagnosis of thrombosis usually happens in a hospital. However, healthcare providers may start suspecting it in a healthcare setting like a doctor's office or an urgent care-type clinic. If it happens outside a hospital, medical professionals will likely treat your case as a medical emergency because of the risk of heart attack, stroke or pulmonary embolism, all of which are life-threatening. A healthcare provider diagnoses thrombosis based on a combination of your medical history, questions they ask you, a physical examination, laboratory tests, imaging tests and other diagnostic methods. The tests they use may vary greatly depending on the conditions they suspect or are possible.",
    "Symptoms": [
      "visible color changes on the skin",
      "temperature change in the affected area",
      "weakness",
      "numbness or tingling",
      "blisters, wounds or sores",
      "skin sloughing",
      "necrosis",
      "pain",
      "swelling from the fluid buildup",
      "skin that feels noticeably warmer than other areas"
    ],
    "Causes": "Thrombosis can happen for many reasons, but certain conditions are more likely to cause clots to form. These conditions fall under the following types or categories. Conditions like atherosclerosis, where arteries stiffen because of a buildup of plaque (a waxy substance related to cholesterol) inside them, often cause clots. This happens when a clot forms over a rupture or break in a section of plaque. This is often what causes heart attacks.",
    "Precaution": [
      "regular exercise",
      "quit tobacco",
      "managing your weight with diet",
      "taking your medication"
    ],
    "Source": [
      "https://my.clevelandclinic.org/health/diseases/22242-thrombosis#prevention"
    ]
  },
  "cholecystitis": {
    "Overview": "Cholecystitis (ko-luh-sis-TIE-tis) is inflammation of the gallbladder. Your gallbladder is a small, pear-shaped organ on the right side of your abdomen, beneath your liver. The gallbladder holds a digestive fluid that's released into your small intestine (bile). In most cases, gallstones blocking the tube leading out of your gallbladder cause cholecystitis. This results in a bile buildup that can cause inflammation. Other causes of cholecystitis include bile duct problems, tumors, serious illness and certain infections. If left untreated, cholecystitis can lead to serious, sometimes life-threatening complications, such as a gallbladder rupture. Treatment for cholecystitis often involves gallbladder removal.",
    "Diagnosis": "Tests and procedures used to diagnose cholecystitis include blood tests, imaging tests that show your gallbladder, and a scan that shows the movement of bile through your body.",
    "Symptoms": [
      "severe pain in the upper right or center abdomen",
      "pain that spreads to your right shoulder or back",
      "tenderness over your abdomen when it's touched",
      "nausea",
      "vomiting",
      "fever"
    ],
    "Causes": "Cholecystitis occurs when your gallbladder becomes inflamed. Gallbladder inflammation can be caused by gallstones, tumor, bile duct blockage, infection and blood vessel problems.",
    "Precaution": [
      "fasting",
      "fluids through a vein in your arm",
      "antibiotics to fight infection",
      "pain medications",
      "procedure to remove stones"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/cholecystitis/diagnosis-treatment/drc-20364895"
    ]
  },
  "hernia hiatal": {
    "Overview": "A hiatal hernia occurs when the upper part of your stomach bulges through the large muscle separating your abdomen and chest (diaphragm). Your diaphragm has a small opening (hiatus) through which your food tube (esophagus) passes before connecting to your stomach. In a hiatal hernia, the stomach pushes up through that opening and into your chest. A small hiatal hernia usually doesn't cause problems. You may never know you have one unless your doctor discovers it when checking for another condition. But a large hiatal hernia can allow food and acid to back up into your esophagus, leading to heartburn. Self-care measures or medications can usually relieve these symptoms. A very large hiatal hernia might require surgery.",
    "Diagnosis": "A hiatal hernia is often discovered during a test or procedure to determine the cause of heartburn or chest or upper abdominal pain. These tests or procedures include x-ray of the upper digestive system, upper endoscopy, and esophageal manometry.",
    "Symptoms": [
      "heartburn",
      "regurgitation of food or liquids into the mouth",
      "backflow of stomach acid into the esophagus",
      "difficulty swallowing",
      "chest or abdominal pain",
      "feeling full soon after you eat",
      "shortness of breath",
      "vomiting blood"
    ],
    "Causes": "A hiatal hernia occurs when weakened muscle tissue allows your stomach to bulge up through your diaphragm. It's not always clear why this happens.",
    "Precaution": [
      "eat several smaller meals",
      "avoid foods that trigger heartburn",
      "avoid lying down after a meal or eating late in the day",
      "maintain a healthy weight",
      "stop smoking",
      "elevate the head of your bed by 6 inches"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/hiatal-hernia/diagnosis-treatment/drc-20373385"
    ]
  },
  "migraine disorders": {
    "Overview": "A migraine is a headache that can cause severe throbbing pain or a pulsing sensation, usually on one side of the head. It's often accompanied by nausea, vomiting, and extreme sensitivity to light and sound. Migraine attacks can last for hours to days, and the pain can be so severe that it interferes with your daily activities. For some people, a warning symptom known as an aura occurs before or with the headache. An aura can include visual disturbances, such as flashes of light or blind spots, or other disturbances, such as tingling on one side of the face or in an arm or leg and difficulty speaking.",
    "Diagnosis": "If you have migraines or a family history of migraines, a doctor trained in treating headaches (neurologist) will likely diagnose migraines based on your medical history, symptoms, and a physical and neurological examination.",
    "Symptoms": [
      "constipation",
      "mood changes",
      "food cravings",
      "neck stiffness",
      "increased urination",
      "fluid retention",
      "frequent yawning",
      "visual phenomena",
      "vision loss",
      "pins and needles sensations in an arm or leg",
      "weakness or numbness in the face or one side of the body",
      "difficulty speaking",
      "pain usually on one side of your head",
      "pain that throbs or pulses",
      "sensitivity to light, sound, and sometimes smell and touch",
      "nausea and vomiting"
    ],
    "Causes": "hough migraine causes aren't fully understood, genetics and environmental factors appear to play a role. Changes in the brainstem and its interactions with the trigeminal nerve, a major pain pathway, might be involved. So might imbalances in brain chemicals — including serotonin, which helps regulate pain in your nervous system. Researchers are studying the role of serotonin in migraines. Other neurotransmitters play a role in the pain of migraine, including calcitonin gene-related peptide (CGRP).",
    "Precaution": [
      "try relaxation techniques",
      "develop a sleeping and eating routine",
      "drink plenty of fluids",
      "keep a headache diary",
      "exercise regularly"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/migraine-headache/diagnosis-treatment/drc-20360207"
    ]
  },
  "pancytopenia": {
    "Overview": "Your body produces three types of blood cells: red blood cells, white blood cells, and platelets. Pancytopenia is when you have abnormally low amounts of all three types of blood cells. It can be caused by diseases, medicines, or the cause may not be known. ",
    "Diagnosis": "Your doctor will listen to your symptoms and ask you about your medical history. They will perform a physical exam. ",
    "Symptoms": [
      "anemia",
      "leukopenia",
      "thrombocytopenia"
    ],
    "Causes": "There are many different conditions that can cause pancytopenia. In about half of all cases, the cause is never found. That is called idiopathic pancytopenia. In some parts of the world, pancytopenia is caused by poor nutrition.  In North America, most cases of pancytopenia are related to the uncontrolled growth of cells. These are called neoplastic conditions, and they can be cancerous or noncancerous.  Pancytopenia can be caused by disorders that cause your bone marrow to produce too few blood cells or by disorders that cause your body to destroy blood cells too quickly. You may have underlying causes that do one or that do both. ",
    "Precaution": [
      "stem cell transplant",
      "bone marrow transplant",
      "medicines that help your bone marrow produce more blood cells",
      "blood transfusions",
      "medicine that suppresses your immune system",
      "waiting and monitoring your condition"
    ],
    "Source": [
      "https://www.webmd.com/a-to-z-guides/what-is-pancytopenia#091e9c5e821b1e55-3-8"
    ]
  },
  "cholelithiasis": {
    "Overview": "Gallstones are hardened deposits of digestive fluid that can form in your gallbladder. Your gallbladder is a small, pear-shaped organ on the right side of your abdomen, just beneath your liver. The gallbladder holds a digestive fluid called bile that's released into your small intestine. Gallstones range in size from as small as a grain of sand to as large as a golf ball. Some people develop just one gallstone, while others develop many gallstones at the same time. People who experience symptoms from their gallstones usually require gallbladder removal surgery. Gallstones that don't cause any signs and symptoms typically don't need treatment.",
    "Diagnosis": "Tests and procedures used to diagnose gallstones and complications of gallstones include abdominal ultrasound, endoscopic ultrasound, other imaging tests and blood tests.",
    "Symptoms": [
      "sudden intensifying pain in the upper right portion of the abdomen",
      "sudden intensifying pain in the center of the abdomen",
      "back pain between your shoulder blades",
      "pain in your right shoulder",
      "nausea or vomiting"
    ],
    "Causes": "It's not clear what causes gallstones to form. Doctors think gallstones may result when your bile contains too much cholesterol, bilirubin and your gallbladder does not empty correctly.",
    "Precaution": [
      "surgery to remove the gallbladder",
      "medications to dissolve gallstones"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/gallstones/diagnosis-treatment/drc-20354220"
    ]
  },
  "biliary calculus": {
    "Overview": "The gallbladder is an expandable pear-shaped organ located beneath your liver. The gallbladder stores bile — a dark green fluid that helps your body digest and absorb food. After you eat, your gallbladder releases bile into your cystic duct. From there, bile moves down the common bile duct and enters your small intestine. Sometimes this process is inhibited and bile builds up inside your gallbladder, causing it to become larger and inflamed. This buildup can lead to the creation of gallstones, or gallbladder calculi. Gallstones can also form from other substances in the body, such as calcium, bilirubin, or cholesterol. These gallstones are not an issue as long as they are small in number and remain in the gallbladder space. However, if a stone blocks the cystic duct, inflammation and infection may occur.",
    "Diagnosis": "The following tests may be helpful in diagnosing calculus of gallbladder with acute cholecystitis: blood tests, ultrasonography, x-ray, oral cholecystogram, hepatobiliary iminodiacetic acid scan, computed tomography and magnetic resonance imaging.",
    "Symptoms": [
      "pain",
      "abdominal tenderness",
      "nausea",
      "vomiting",
      "dark urine",
      "pale stools",
      "fever",
      "chills",
      "sweating"
    ],
    "Causes": "The exact cause of gallstones hasn't been pinpointed. They may form as a result of too much cholesterol or bilirubin in your bile. Another possible cause is a malfunctioning gallbladder that doesn't empty bile properly, leading to bile that's overly concentrated. In about 90 percent of cases, acute cholecystitis is caused by gallstones blocking your cystic duct. However, in most cases the infection that causes acute cholecystitis is a result of gallstones, not the cause.",
    "Precaution": [
      "antibiotics to prevent or treat infection",
      "medications to temporarily control your pain",
      "fasting to relieve the gallbladder from stress"
    ],
    "Source": [
      "https://www.healthline.com/health/calculus-gallbladder-acute-cholecystitis#treatment"
    ]
  },
  "tachycardia sinus": {
    "Overview": "Sinus tachycardia is when your body sends out electrical signals to make your heart beat faster. Hard exercise, anxiety, certain drugs, or a fever can spark it. When it happens for no clear reason, it's called inappropriate sinus tachycardia (IST). Your heart rate might shoot up with just a little movement or stress. Or it might be high when you're doing nothing. IST is most common in women in their 30s. Symptoms can last for months or years. You might not notice it at first.",
    "Diagnosis": "Your doctor will ask you about your health history and symptoms. An obvious sign would be a racing heart. But something else may be causing your fast pulse, like certain heart and thyroid conditions or mental health issues like anxiety.",
    "Symptoms": [
      "difficulty exercising",
      "trouble catching your breath",
      "chest pain",
      "dizziness",
      "fainting",
      "headache",
      "anxiousness"
    ],
    "Causes": "Doctors don't fully understand why IST happens. In some cases, nerves might mistakenly send signals to speed up your heart rate. The nerves that lower your heart rate might not work right, either. A viral infection can lead to IST in some people. In those cases, symptoms sometimes go away suddenly in a few months or years.",
    "Precaution": [
      "avoiding nicotine, alcohol or caffeine",
      "regular exercise",
      "having a healthy diet",
      "taking prescribed medicine such as beta-blockers"
    ],
    "Source": [
      "https://www.webmd.com/heart-disease/inappropriate-sinus-tachycardia#091e9c5e81e5f026-1-5"
    ]
  },
  "ileus": {
    "Overview": "Ileus is the medical term for this lack of movement somewhere in the intestines that leads to a buildup and potential blockage of food material. An ileus can lead to an intestinal obstruction. This means no food material, gas, or liquids can get through. It can occur as a side effect after surgery. However, there are other causes of this condition. An ileus is a serious concern. However, people with an ileus often don't know that food is building up in their intestines, so they continue to eat. This pushes more and more material toward the buildup. Without treatment, the ileus can perforate or tear the intestine. This causes bowel contents — which have high levels of bacteria — to leak into areas of your body cavity. This can be deadly.",
    "Diagnosis": "Your doctor will usually first listen to a description of your symptoms. You'll likely be asked about any history of medical conditions, prescribed medications, and surgeries, especially recent procedures. Your doctor may then conduct a physical exam, looking at your abdomen for signs of swelling or tightness. Your doctor will also listen with a stethoscope to your abdomen for typical bowel sounds. If your bowels aren't moving because of an ileus, your doctor may not hear anything or may hear excessive bowel sounds. Imaging studies are usually ordered after a thorough physical exam. These can indicate where an ileus is located by showing a buildup of gas, an enlarged intestine, or even an obstruction. Your doctor may use these to identify areas where your bowel content seems to be concentrated.",
    "Symptoms": [
      "abdominal cramping",
      "appetite loss",
      "feeling of fullness",
      "constipation",
      "inability to pass gas",
      "abdominal swelling",
      "nausea",
      "vomiting"
    ],
    "Causes": "An ileus is common after surgery because people are often prescribed medication that can slow intestinal movement. This is a type of paralytic ileus. In this instance, the intestine is not blocked. Rather, it isn't moving properly. The result is little to no movement of digested food through your intestines.",
    "Precaution": [
      "being aware of the symptoms of ileus"
    ],
    "Source": [
      "https://www.healthline.com/health/ileus#prevention"
    ]
  },
  "adhesion": {
    "Overview": "Abdominal adhesions are bands of scar tissue that form between abdominal organs, mainly the small intestine. Adhesions occur after abdominal surgery and can cause your tissues to stick together, when normally they would just move around freely.",
    "Diagnosis": "Imaging technology (such as X-rays, ultrasounds and CT scans) cannot detect abdominal adhesions. However, those studies can detect intestinal blockages related to adhesions",
    "Symptoms": [
      "severe abdominal pain",
      "bloating",
      "nausea and vomiting"
    ],
    "Causes": "Adhesions occur after abdominal surgery, particularly between loops of small bowel.",
    "Precaution": [
      "surgeons cannot avoid creating abdominal adhesions",
      "having surgeries that have smaller cuts"
    ],
    "Source": [
      "https://my.clevelandclinic.org/health/diseases/15254-abdominal-adhesions#prevention"
    ]
  },
  "delusion": {
    "Overview": "Delusional disorder, previously called paranoid disorder, is a type of serious mental illness — called a “psychosis”— in which a person cannot tell what is real from what is imagined. The main feature of this disorder is the presence of delusions, which are unshakable beliefs in something untrue. People with delusional disorder experience non-bizarre delusions, which involve situations that could occur in real life, such as being followed, poisoned, deceived, conspired against, or loved from a distance. These delusions usually involve the misinterpretation of perceptions or experiences. In reality, however, the situations are either not true at all or highly exaggerated. People with delusional disorder often can continue to socialize and function quite normally, apart from the subject of their delusion, and generally do not behave in an obviously odd or bizarre manner. This is unlike people with other psychotic disorders, who also might have delusions as a symptom of their disorder. In some cases, however, people with delusional disorder might become so preoccupied with their delusions that their lives are disrupted.",
    "Diagnosis": "If symptoms are present, your doctor will perform a complete medical history and physical examination. Although there are no laboratory tests to specifically diagnose delusional disorder, the doctor might use various diagnostic tests — such as X-rays or blood tests — to rule out physical illness as the cause of your symptoms. If the doctor finds no physical reason for the symptoms, he or she might refer the person to a psychiatrist or psychologist, health care professionals who are specially trained to diagnose and treat mental illnesses. Psychiatrists and psychologists use specially designed interview and assessment tools to evaluate a person for a psychotic disorder. The doctor or therapist bases his or her diagnosis on the person's report of symptoms, and his or her observation of the person's attitude and behavior. The doctor or therapist then determines if the person's symptoms point to a specific disorder as outlined in the Diagnostic and Statistical Manual of Mental Disorders (DSM-5), which is published by the American Psychiatric Association and is the standard reference book for recognized mental illnesses. According to the DSM-5, a diagnosis of delusional disorder is made if a person has non-bizarre delusions for at least one month and does not have the characteristic symptoms of other psychotic disorders, such as schizophrenia.",
    "Symptoms": [
      "irritable, angry, or low mood",
      "hallucinations"
    ],
    "Causes": "As with many other psychotic disorders, the exact cause of delusional disorder is not yet known. Researchers are, however, looking at the role of various genetic, biological, and environmental or psychological factors.",
    "Precaution": [
      "early diagnosis and treatment"
    ],
    "Source": [
      "https://my.clevelandclinic.org/health/diseases/9599-delusional-disorder#prevention"
    ]
  },
  "affect labile": {
    "Overview": "Emotional lability is a neurological condition that causes uncontrollable laughing or crying, often at inappropriate times. It tends to affect people with preexisting neurological conditions or injuries.",
    "Diagnosis": "Emotional lability is often misdiagnosed as depression or another mental health condition. To make getting a diagnosis easier, try to keep a journal of your symptoms, including when they occur and how long they last. If possible, note your general mood and emotional state between outbursts. If you don't notice any emotional symptoms between episodes, it's a good indicator that you likely have emotional lability, rather than a psychological condition. Make sure to tell your doctor about any recent head injuries or underlying conditions. You might also find it helpful to bring along a loved one who's observed your emotional outbursts. While there's no specific test for diagnosing emotional lability, your doctor will ask you a series of questions about your medical history and moods to confirm the diagnosis.",
    "Symptoms": [
      "short emotional outbursts",
      "mixed emotional outbursts",
      "lack of emotional symptoms between episodes",
      "laughing or crying in situations that other people don't find funny or sad",
      "emotional responses that are over-the-top for the situation",
      "emotional outbursts that are very different from your usual behavior"
    ],
    "Causes": "In addition to strokes, neurological conditions and traumatic brain injuries (TBIs) can lead to emotional lability.",
    "Precaution": [
      "nuedexta",
      "antidepressants"
    ],
    "Source": [
      "https://www.healthline.com/health/emotional-lability#treatment"
    ]
  },
  "decubitus ulcer": {
    "Overview": "Bedsores — also called pressure ulcers and decubitus ulcers — are injuries to skin and underlying tissue resulting from prolonged pressure on the skin. Bedsores most often develop on skin that covers bony areas of the body, such as the heels, ankles, hips and tailbone. People most at risk of bedsores have medical conditions that limit their ability to change positions or cause them to spend most of their time in a bed or chair. Bedsores can develop over hours or days. Most sores heal with treatment, but some never heal completely. You can take steps to help prevent bedsores and help them heal.",
    "Diagnosis": "Your doctor will likely look closely at your skin to decide if you have a pressure ulcer and, if so, to assign a stage to the wound. Staging helps determine what treatment is best for you. You might need blood tests to assess your general health.",
    "Symptoms": [
      "unusual changes in skin color or texture",
      "swelling",
      "pus-like draining",
      "an area of skin that feels cooler or warmer",
      "tender areas"
    ],
    "Causes": "Bedsores are caused by pressure against the skin that limits blood flow to the skin. Limited movement can make skin vulnerable to damage and lead to development of bedsores.",
    "Precaution": [
      "treatment team",
      "reducing pressure",
      "cleaning and dressing wounds",
      "removing damaged tissue",
      "healthy diet",
      "using drugs to control pain"
    ],
    "Source": [
      "https://www.mayoclinic.org/diseases-conditions/bed-sores/diagnosis-treatment/drc-20355899"
    ]
  }
}